export const importData = [
    "望而却步@指看到了危险或力不能及的事而往后退缩。@10@6",
    "望而生畏@意思是一见之下就产生了畏惧心理。形容人态度威严或事务艰难令人畏惧。@11",
    "望尘莫及@指只望见前面骑马的人走过扬起的尘土而不能赶上。比喻远远落后，常用作谦词。@14",
    "望洋兴叹@原指在伟大的事物面前感叹自己的微小，后比喻因眼界大开而惊奇赞叹或因能力不及而感到无可奈何，含贬义。@11",
    "裹足不前@停步不前，好像脚被缠住了一样，比喻有所顾忌，不愿去做；在句子中可充当谓语、定语、状语。@5",
    "畏缩不前@畏惧退缩，不敢向前。也作“畏蕙不前”。@1",
    "知难而退@原义指作战时相机行事，遇到不利情况应及时退避；中性。后指碰到困难就退缩；含贬义。该成语在句中一般作谓语，也作宾语。@5",


    "一鸣惊人@一叫就使人震惊。比喻平时不被人注意的人，突然做出惊人的成绩。@9@6",
    "脱颖而出@比喻有才能的人得到机会，即本领全部显现出来。其本身结构为偏正式，在句子中可充当谓语、宾语、定语，含褒义。@19",
    "横空出世@优秀的人或事物突然出现，或比喻卓尔不群。@5",
    "异军突起@比喻突然兴起的新生力量，一下崛起;在句子中可充当谓语、宾语、补语；含褒义。@12",
    "出人头地@指高人一等，超出一般人；形容德才超众或成就突出比其他人优秀。含褒义；在句中一般作谓语、宾语、定语@4",
    "出类拔萃@比喻超过聚在一起的同类人或物，多用于形容才德超出众人之上的人。含褒义;@8",
    "灵光乍现@就是突然有了灵感的意思。@2",


    "充耳不闻@塞住耳朵不听。形容有意不听别人的意见。@5@6",
    "置若圈闻@放在一边，好像没有听见似的。指不去过问或不予关心，强调不重视，不关心，侧重于听。@13",
    "置之不理@放在一边；不予理躲，形容对某人某事十分冷淡。@7",
    "不以为然@不认为是对的。@10",
    "将信将疑@意思是有点相信，又有点怀疑。@2",
    "敷衍塞责@指工作不认真负责，表面应付了事。@2",
    "无动于裹@心里一点儿也没有触动。指对应该关心、注意的事情毫不关心，置之不理。@2",


    "独占鳌头@原指科举时代考试中了状元。现泛指占首位或第-名。@10@6",
    "鹤立鸡群@是指像鹤站在鸡群中一样。比喻一个人的仪表或才能在周围一群人里显得很突出。@10",
    "风起云涌@形容雄浑磅之势；也比喻事物迅速发展，声势浩大。@12",
    "崭露头角@比喻突出地显示出才能和本领。@19",
    "齐头并进@多方面同时前进。多形容几件事情或几项工作同时进行。@13",
    "独当一面@指单独承当一方面的工作或使命；在句子中可充当作谓语、定语、状语；含褒义。@9",
    "各领风骚@各在自己所在的领域有作为。@1",


    "事半功倍@意思是只用一半的力气，而收到加倍的功效。形容用力小而收效大。@10@6",
    "举一反三@举一例便能够推知其他的，侧重于理解知识。@13",
    "一劳永逸@辛苦一次，把事情办好，以后就可以不再费力了。@25",
    "水到渠成@比喻条件成熟，事情就会自然成功，侧重强调条件成熟。含褒义;@25",
    "万无一失@指非常有把握，绝对不会出差错。@3",
    "抛砖引玉@比喻用自己先发表的粗浅、不成熟的观点或文章去引出别人高明的意见或佳作。@1",
    "一呼百应@指一人召唤，百人响应。形容响应附和的人众多。@4",



    "自暴自弃@自己甘心落后，不求上进。@6@6",
    "妄自菲薄@过分看轻自己，形容自卑，含贬义。@7",
    "苟且偷安@形容得过且过，只顾眼前的安逸，不顾将来，强调偏重眼前安逸。@1",
    "得过且过@只要能够过得去，就这样过下去。形容胸无大志，没有长远打算；也指做事马马虎虎，敷衍了事。含贬义。@5",
    "自甘堕落@不知自重自爱,甘心落后和腐败。@1",
    "夜郎自大@原指国土很小的夜郎国王自以为大，比喻人不自量力，妄自尊大；在句中作谓语、定语，含贬义。@5",
    "谨小慎微@意思是过分小心谨慎，缩手缩脚，不敢放手去做。@4",


    "大显身手@充分展示自己的本领。@7@6",
    "脱颖而出@比喻有才能的人得到机会，即本领全部显现出来。其本身结构为偏正式，在句子中可充当谓语、宾语、定语，含义。@19",
    "先发制人@指先下手采取行动。@3",
    "闪亮登场@指在演戏时，人物上场前台上的灯光会弄得一闪一闪的以增加气氛。后多喻指一个人经过刻意装扮或悉心安排后进入某个行业，带有贬义色彩@1",
    "舍己救人@指不惜牺牲自己去救别人。@1",
    "齐头并进@多方面同时前进。多形容几件事情或几项工作同时进行。@13",
    "虎视眈眈@像老虎那样凶狠地町着。形容心怀不善，伺机取。@2",


    "空中楼阁@指悬在半空中的阁楼，比喻虚幻的事物或脱离实际的空想。该成语构词方式是偏正式；在句中作主语、宾语。@9@6",
    "海市蜃楼@比实际不存在的虚无缥缈的事物。@5",
    "昙花一现@比喻美好的事物或景象出现了一下，很快就消失。@14",
    "纸上谈兵@比喻空谈理论，不解决实际问题，含贬义。@15",
    "镜花水月@原指诗中灵活而不可捉摸的空灵的意境，后比喻虚幻的景象。@3",
    "无源之水@意思是没有基础的事物。@3",
    "夸夸其谈@指浮夸空泛地大发议论或写文章浮夸，不切合实际。@11",


    "跃跃欲试@意思是形容心里急切地想试试。@5@6",
    "摩拳擦掌@形容战斗或劳动之前，人们精神振奋，跃跃欲试的样子。@4",
    "争先恐后@指竞相抢先而不肯落后；多用于形容人的动作等；在句子中可充当谓语、状语；也作“恐后争先”，常与“趋之若鹭”一起连用。@6",
    "卷土重来@人马奔跑时扬起尘土，重新猛扑过来;比喻失败之后，重新恢复势力；含贬义。@5",
    "兴致高昂@兴趣浓厚的意思。@1",
    "踌躇满志@形容对自己取得的成就非常得意，多有褒义。@4",
    "一哄而上@没有经过认真准备和严密组织，一下子行动起来；同“一哄而起”。作谓语、宾语、定语；用于人。@1",


    "一筹莫展@什么计策也施展不出，常用于形容一点办法也想不出来。含贬义；在句中一般作谓语、定语、补语。@6@6",
    "寸步难行@意思是连一步都难以进行，形容走路困难；也比喻处境艰难。@3",
    "难以为继@难以继续下去。@12",
    "步履维艰@意思是指行走困难行动不方便。@3",
    "举步维艰@形容已陷入十分艰难的处境，办事很困难。@10",
    "孤军奋战@一支军队在没有友军的情况下单独英勇作战。后比喻单独承担任务或工作。也作“孤军作战”、“孤军独战”。@2",
    "凤毛麟角@比喻难得而宝贵的人或事物。@16",


    "正本清源@从根本上整顿，从源头上清理。比喻从根源上加以整顿清理。@6@6",
    "严惩不贷@严加惩办，不予宽容。@1",
    "多管齐下@比喻做一件事从多个方面同时进行或多种方法同时使用。@2",
    "标本兼治@指医者在医治的治疗中采取治标兼治本的手段。@4",
    "因地制宜@根据不同环境的实际情况制定相应的妥善办法。@16",
    "齐心协力@指思想一致，共同努力。也作齐心合力。@5",
    "有的放矢@放箭要对准靶子。比喻说话做事有针对性。@22",


    "明哲保身@做贬义时指为了保住个人利益回避原则斗争的庸俗作风；褒义时指处世待人十分明智。@10@6",
    "独善其身@只顾自己，不管他人的个人主义处事哲学。@14",
    "置身事外@意思是把自己放在事情之外，毫不关心。@8",
    "袖手旁观@把手笼在袖子里，在一旁观看。比喻人置身事外、不帮助别人。多指看到别人有困难，不帮助别人。@7",
    "抽身其外@谓弃官引退。脱身离开。@2",
    "洁身自好@指保持自身清白，做褒义时表示不与世俗同流合污；做贬义时表示怕惹是。@4",
    "竭泽而渔@指把池塘里的抽干了捉鱼；比喻做事只顾眼前的利益，丝毫不为以后打算。含贬义；在句中一般作谓语、宾语、定语。@8",


    "微不足道@指意义、价值等小得不值得一提。@10@6",
    "不足挂齿@表示不值得一提。@5",
    "谨小慎微@意思是过分小心谨慎，缩手缩脚，不敢放手去做。@4",
    "司空见惯@某事常见，不足为奇，偏向描述事物多用于书面语。@31",
    "微乎其微@意思是形容非常小或非常少。@7",
    "差强人意@形容某人某事还不错，大体上还能使人满意。含义；在句中一般作谓语、定语。@6",
    "漫不经心@随随便便的，不放在心上。「反」专心致志@6",


    "不期而至@指事先没有约定而意外到来，没有预料的到来。这里要特别注意，该词语不带有主观感情色彩。@6@6",
    "不期而遇@没有约定而遇见。指意外碰见。@6",
    "姗姗来迟@指走的缓慢从容而迟到；形容慢腾腾地来的很晚。在句中一般作谓语、宾语。@2",
    "不疾不徐@不快不慢。指速度或节奏掌握适当。@2",
    "缓不济急@缓慢的行动适应不了紧急的需要。@1",
    "有机可乘@有机会可以利用，有空子可钻。@1",
    "纷至沓来@形容连续不断地到来。@19",


    "偃旗息鼓@原意是放倒军旗，停止擂鼓，秘密行军，不暴露目标。后比喻休战或无声无息地停止活动。[]在句中可作谓语、定语、宾语。@6@6",
    "戛然而止@形容声音因为被打断而突然终止。@4",
    "无功而返@指没有任何成效而回来。@5",
    "知错就改@知错就改比人知道了错误就改正。@2",
    "改弦易辙@本义是乐器更换弦，车子改变道路（改弦更换琴弦。易改变。辙车轮压过的痕迹，指道路)；比喻变方向态度。@3",
    "前功尽弃@指以往的功劳全部废弃。含贬义。@4",
    "曲终人散@万事万物都有消亡的一刻，曲子停息了。人也就都散了。或比喻天下没有不散的席。@2",


    "实至名归@有真正的学识、本领或功业，自然就有声誉。@6@6",
    "理所当然@道理当然是这样的，意为发生的事情本身合乎道理（非情理)，不容怀疑。@27",
    "水到渠成@比喻条件成熟，事情就会自然成功，侧重强调条件成熟。含义；@25",
    "无可辩驳@意思是没有理由或根据来否定对方的意见。形容事实确凿，理由充足。@3",
    "名正言顺@指名分正当，说话合理。后多指做某事名义正当，道理也说得通。@2",
    "众望所归@用于形容某人威望很高，受到大家敬仰和信赖。@6",
    "不负众望@指为人所信服，很争气，不辜负大家的期望。@3",


    "按图索骥@按照图像寻找好马，比按线索寻找，也比喻办事机械、死板。@8@6",
    "有的放矢@放箭要对准靶子。比喻说话做事有针对性。@22",
    "有章可循@有章法可以依照。@2",
    "循规蹈矩@指拘泥于旧的准则，不敢稍做变通。@19",
    "按部就班@按照一定的步骤、顺序进行；也指按老规矩办事，缺乏创新精神。@18",
    "轻而易举@强调事情容易做，不费力，与时间无关。@19",
    "易如反掌@指像翻一下手掌那样容易，比喻事情很简单非常容易完成。@4",



    "枉费心机@白白的浪费心思，意谓徒劳无功@2@6",
    "徒劳无益@指付出了劳动(做了工作),但得不到任何的益处(好处)。@1",
    "白费口舌@谈话一无所获。@1",
    "无济于事@对事情没有什么帮助或益处，比喻不解决问题。@6",
    "前功尽弃@指以往的功劳全部废弃。含贬义。@4",
    "徒劳无功@白白付出劳动而没有成效。@4",
    "无所适从@指不知依从谁才好，也指不知道怎么办才好；在句子中可充当谓语、宾语、定语。@13",


    "劳民伤财@既使人民劳苦，又耗费钱财；现也指滥用人力物力。@4@6",
    "徒劳无功@白白付出劳动而没有成效。@4",
    "得不偿失@所得的利益抵偿不了所受的损失。@11",
    "血本无归@指本钱赔光了，一点也没收回。@1",
    "兴师动众@意思是指大规模出兵。现多指动用很多人力做某件事。@1",
    "繁文缛节@烦琐而多余的仪式或礼节，比喻烦琐多余的事项。@2",
    "大动王戈@大规模地进行战争。比喻大张声势地行事。@2",


    "高枕无忧@垫高枕头，无忧无虑地睡觉；比身心安逸，无所忧虑；也用来形容思想麻痹，放松警惕；在句中一般作谓语、状语。@10@6",
    "一劳永逸@辛苦一次，把事情办好，以后就可以不再费力了。@25",
    "丰衣足食@穿的丰富，吃的充足。形容生活富裕@3",
    "为所欲为@想干什么就干什么。@3",
    "无忧无虑@形容没有什么可忧虑和担心的，心情安然自得。@3",
    "万事大吉@什么事都很圆满顺利，也指一切事情都已办好。@2",
    "麻痹大意@比喻失去警觉。指粗心、疏忽，对事物不敏感，失去警惕性。@1",


    "无源之水@意思是没有基础的事物。@3@6",
    "空中楼阁@指悬在半空中的阁楼，比喻虚幻的事物或脱离实际的空想。该成语构词方式是偏正式；在句中作主语、宾语。@9",
    "昙花一现@比喻美好的事物或景象出现了一下，很快就消失。@14",
    "根基不牢@基础不牢固。@1",
    "本末倒置@比喻颠倒了事物的轻重主次。@9",
    "过眼云烟@指从眼前飘过的云烟。原比喻身外之物，不必重视。后比喻很快就消失的事物。@2",
    "纸上谈兵@比喻空谈理论，不解决实际问题，含贬义。@15",


    "有条不紊@形容做事、说话有条有理，丝毫不乱。@10@6",
    "一以贯之@做人做事，按照一个道理，从一而终不会改变，主要指精神、纲领、准则等。@11",
    "运筹帷幄@指在帐幕中谋划军机，拟定作战策略。含褒义；在句中一般作谓语、定语。@5",
    "坚持不邂@形容做事持之以恒，比喻有恒心，有毅力。@8",
    "并然有序@指整整齐齐，次序分明，条理清楚。偏正式；作定语、状语；含褒义。@4",
    "一丝不乱@形容布置或收拾得非常整齐。@1",
    "星罗棋布@像天空中的星星和棋盘上的棋子一样罗分布着。形容数量众多，散布的范围很广@10",


    "铺天盖地@形容声势大，到处都是。@7@6",
    "层出不穷@比喻事物或言论接连不断地出现，尚未穷尽，数量多。@34",
    "大行其道@在某范围内广为流传，盛行一时。@12",
    "浮光掠影@像水面的光和掠过的影子一样，一晃就消逝，形容印象不深刻。又指文章言论的肤浅,无真知实学。@23",
    "此起彼伏@意思是这里起来，那里下去；形容接连不断。@15",
    "等量齐观@指对有差别的事物同等看待。@12",
    "翻天覆地@形容变化巨大而彻底，也指闹得很凶。@9",


    "优柔寡断@指做事犹豫，缺乏决断。@4@6",
    "举棋不定@举棋不定指拿着棋子，不知下哪一步才好。比喻犹豫不决，拿不定主意。含贬义。@5",
    "三心二意@意志不坚定，犹豫不决，也指又想这样又想那样，犹豫不定。@4",
    "迟疑不决@迟疑犹豫。心存疑虑而没有作出决定。也作“疑未决”@1",
    "瞻前顾后@原形容做事谨慎，考虑周到。后多形容顾虑过多，犹豫不决。@11",
    "犹豫不决@意思是迟疑，拿不定主意。@2",
    "将信将疑@意思是有点相信，又有点怀疑。@2",


    "高歌猛进@声歌唱，勇猛前进；形容在前进的道路上，充满乐观精神。@7@6",
    "方兴未艾@事物正在蓬勃发展，不会很快终止。强调新事物初级阶段正在蓬勃的发展，偏向积极方向。@24",
    "如日中天@比喻事物正发展到最兴盛的阶段。@17",
    "乘风破浪@指船只乘着风势破浪前进（乘趁着、借着；破冲开)，形容发展迅猛，也喻志趣远大勇往前；在句中一般作谓语；多含褒义。@4",
    "急流勇进@在急流中勇敢前进，形容果断、勇猛一往无前。@2",
    "长风破浪@指船只乘着风势破浪前进，比喻志向远大，不怕困难，奋勇前进。含褒义。@1",
    "有目共睹@形容人人都可以看到，极其明显。@23",


    "粗制滥造@意思是写文章或做东西马虎草率，只求数量，不顾质量。@6@6",
    "良菱不齐@旧版只能指人，现在可以指好的坏的事物混杂在一起。@16",
    "鱼目混珠@拿鱼眼睛冒充珍珠。比喻拿假的冒充真的，感情消极。@11",
    "稍纵即逝@稍微一放松就消失了。形容时间或机会等很容易过去。@7",
    "昙花一现@比喻美好的事物或景象出现了一下，很快就消失。@14",
    "泥沙俱下@指在江河的急流中泥土和沙子随着水一起冲下。比喻好坏性质不同的人或者事物混杂在一起。@14",
    "鱼龙混杂@意思是形容好人和坏人混在一起。@15",


    "事与愿违@事情的发展与愿望相反，指事情没能按照预想的方向发展。@8@6",
    "适得其反@恰恰得到与预期相反的结果。@13",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对。一般是一个人。含义。@29",
    "欲速不达@想求快速，反而不能达到目的。@3",
    "过犹不及@形容事情要适得其中；在句子中可充当谓语、宾语、定语。@6",
    "雪上加霜@比喻一再遭受灾难，损害愈加严重。@3",
    "一败涂地@一旦失败就肝脑涂染遍地，形容惨败;后用于溃败的不可收拾。含贬义；在句中一般作谓语、定语、补语。@6",


    "各行其是@按照各自认为对的去做，指思想不统一，各人按照自己的意见、主张去做，侧重强调做法。@8@6",
    "自以为是@总以为自己是对的，认为自己的观点和做法都正确，不接受他人意见，形容主观，不虚心。@9",
    "各司其职@各自负责掌握自己的职责。@3",
    "随心所欲@指随着自己的意思，想要干什么就干什么。@13",
    "不以为然@不认为是对的.@10",
    "独善其身@只顾自己，不管他人的个人主义处事哲学。@14",
    "两败俱伤@相斗的双方都受到损伤。@1",


    "大同小异@指大体相同，略有差异。@10@6",
    "如出一辙@像出自同一个车辙。比喻言论或行动完全一样。@15",
    "殊途同归@比喻采取不同的方法而得到相同的结果。@11",
    "异曲同工@比喻不同时代、不同人的文章、言论一样精彩，或不同的事情产生相同的效果。原意为不同的曲子有着相同的影响，同样精彩。@9",
    "不谋而合@强调事先没有商量过，意见或行动却完全一致，@15",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同，不同之处很多。@28",
    "概莫能外@一概不能超出这个范围；一概不能例外。指都在所指范围之内。@4",


    "废寝忘食@不睡觉，忘记了吃饭。侧重专心努力。含褒义@8@6",
    "蝉精竭虑@形容用尽精力、费尽心思，一般偏重脑力劳动。@15",
    "呕心沥血@形容苦思冥想，费尽心血，为事业、工作、文艺创作用心的艰苦。含褒义。@10",
    "兢兢业业@形容做事小心谨慎，认真踏实，一般用在工作上。@14",
    "一掷千金@原指赌博时一注就扔下千金。现形容花钱没有节制，任意挥霍。也作“千金一掷”。@2",
    "竭尽全力@用尽全部力量，一般是体力劳动。@2",
    "宠辱不惊@对受宠或受辱都不感到动心。比喻把荣辱得失置之度外。@2",


    "浑然不觉@毫无察觉的样子。@4@6",
    "默不作声@不说话、不出声，保持沉默。@2",
    "习焉不察@指经常接触某种事物，反而觉察不到其中存在的问题。@2",
    "默然接受@默然的意思是沉默不语的样子,是一种状态。@1",
    "茫然若失@形容心中茫茫然然，像失去了什么。@2",
    "不知所措@不知道怎么办才好，形容处境为难或心神慌乱。@8",
    "六神无主@形容惊恐万分而毫无主张。@1",

    "敷衍了事@意思是指办事马马虎虎，只求应付过去就算完事。@6@6",
    "各自为政@指各自在职权范围内按照自己的主张行事，不互相配合；也比喻不考虑全局，各搞一套。含贬义；在句中一般作谓语、定语。@8",
    "二盘散沙@比喻力量分散，没有组织起来。@4",
    "群龙无首@比喻一群人中没有领头的人。@3",
    "偷工减料@指商人为了牟取暴利而暗中降低产品质量，削减工料。现也指做事图省事，马虎敷衍。@1",
    "花里胡哨@形容颜色过分鲜艳繁杂，也比喻浮华而不实在。@1",
    "粗制滥造@意思是写文章或做东西马虎草率，只求数量，不顾质量。@6",


    "拾人牙慧@比喻拾取别人的一言半语当作自己的话。含贬义；在句中一般作谓语、宾语。@6@6",
    "人云亦云@别人说什么，自己也跟着说什么。形容没有主见，随声附和，含贬义色彩，通常搭配人。@17",
    "子虚乌有@表示为假设而非实有的事物，含贬义,在句子中可充当谓语、定语。@3",
    "荒诞不经@意思是少有的，荒唐，不可信之意。形容虚妄离奇，不合情理。@11",
    "一纸空文@只是写在纸上没有兑现或不能兑现的东西。@3",
    "照本宣科@照着本子读。形容死板守旧，缺乏创造发挥的精神。@3",
    "狗尾续貂@古代官员以貂尾为冠饰，晋代封官太滥，貂尾不足，以狗尾替貂；比喻用次品续在珍品之后，多用于形容续写的文学作品不如原来的好。含贬@1",


    "扬长避短@发挥或发扬优点或有利条件，克服或回避缺点或不利条件。@6@6",
    "推陈出新@去掉旧事物的糟粕，取其精华，并使它向新的方向发展，侧重强调文化的去粕取精。@24",
    "一举两得@指做一件事，同时收获两方面的好处。含义；在句中一般作谓语、定语。@5",
    "另辟蹊径@另外开辟一条路。比喻另创一种风格或方法。@9",
    "按部就班@按照一定的步骤、顺序进行；也指按老规矩办事，缺乏创新精神。@18",
    "上行下效@指上面的人怎样做，下面的人就跟着怎么做，后比喻上级的言行很大地影响着下属；在句子中充当谓语、定语、状语；含贬义。@4",
    "墨守成规@指思想保守，守着老规矩不肯改变。@20",


    "独当一面@指单独承当一方面的工作或使命；在句子中可充当作谓语、定语、状语；含褒义。@9@6",
    "游刃有余@形容技艺熟练，做事轻松利落。含褒义；在句中一般作谓语、宾语。@11",
    "驾轻就熟@驾轻车，走熟路，比喻对事情熟悉，做起来轻松便捷。@8",
    "高高在上@原指地位高，现在形容领导者脱离实际，脱离群众。@6",
    "无人能及@没有人能达到这个人所达到的程度。@3",
    "鹤立鸡群@是指像鹤站在鸡群中一样。比喻一个人的仪表或才能在周围一群人里显得很突出。@10",
    "如鱼得水@原义是像鱼得到水一样，比喻得到跟自己最相投合的人或最合适的环境；也比喻有所依靠；在句子中可充当作谓语、宾语、补语；含褒义。@5",


    "岌岌可危@形容极其危险。@6@6",
    "危在旦夕@形容处境十分危险。侧重强调时间短，危险近在眼前。@9",
    "朝不保夕@早晨不能知道晚上会变成什么样子或发生什么情况；形容形势危急，难以预料。@3",
    "奄奄一息@形容气息微弱临近死亡。也比喻事物即将消亡、潼没或毁灭。@4",
    "难以为继@难以继续下去。@12",
    "危机四伏@四面都有埋伏，强调到处都是危险。@4",
    "危如累卵@比喻形势非常危险，如同堆起来的蛋随时都有塌下打碎的可能。@2",



    "源源不断@形容接连不断、连绵不绝。多用干事物，而少用于人。@10@6",
    "络绎不绝@形容行人车马来往，接连不断。@13",
    "纷至查来@形容连续不断地到来。@19",
    "川流不息@指事物像水流一样连续不断。@5",
    "生生不息@指不断地生长、繁殖。@9",
    "生机勃勃@形容生命力旺盛的样子。@9",
    "薪火相传@意思是比喻学问和技艺代代相传。@12",


    "名副其实@指名声或名称与实际相符合，含褒义。@9@6",
    "货真价实@货物不是冒牌的，价钱也是实在的。形容实实在在，一点不假。@4",
    "名不虚传@传出的名声不是虚的，意名声和实际相符。@3",
    "巧夺天工@形容人的精巧胜过天然，比喻技艺高超巧妙。含褒义。@9",
    "不孚众望@孚信服。意思是不能使大家信服，未符合大家期望。@3",
    "危在旦夕@形容处境十分危险。侧重强调时间短,危险近在眼前。@9",
    "屈指可数@形容数目很少。［反]不计其数。@12",


    "举重若轻@指举起沉重的东西像是在摆弄轻的东西，比喻能力强，能够轻松地胜任繁重的工作或处理困难的问题。@4@6",
    "游刃有余@形容技艺熟练，做事轻松利落。含褒义；在句中一般作谓语、宾语。@11",
    "借古讽今@借评论古代的人和事来评论现实。@1",
    "微言大义@意思是包含在精微语言里的深刻的道理。@4",
    "振聋发聩@声音很大，使耳聋的人也听得见。比喻用语言文字唤醒糊涂麻木的人，使他们清醒过来。@14",
    "无与伦比@意思是指事物非常完美，没有能够与它相比的同类的东西。@20",
    "别具一格@意思是比喻另有一种独特的风格，形容别致、新颖的样子，多用于艺术创作。@14",


    "兼收并蓄@指把不同内容、不同性质的东西收下来，保存起来。@6@6",
    "融会贯通@指各方面的知识或道理融合贯穿起来，从而得到系统透彻的理解。@13",
    "集思广益@集中群众的智慧，广泛吸收有益的意见。该成语构词方式是联合式；在句中作谓语、定语、状语。@12",
    "博采众长@从多方面吸取各家的长处。@10",
    "此消彼长@不要太过于在乎此时的失去，别的方面会有长进。什么事情都有两面或者多面性。@19",
    "相辅相成@指两种事物互相辅助，互相促成，缺一不可，没有+>效果。@32",
    "见贤思齐@指见到有才德的人就想着与他齐平；在句子中可充当谓语、宾语、定语；也作“见德思齐”@5",


    "矢志不渝@立志不会改变，表示永远不变心，重点强调志向、心意不会改变，程度更重。@10@6",
    "持之以恒@有恒心地坚持下去，侧重强调时间长的坚持不懈，不中断。@20",
    "孜孜以求@不知疲倦地探求。@9",
    "百折不挠@指虽然受到很多挫折，但仍不动摇、退缩或屈服。形容意志坚强。含褒义；作谓语、定语、状语。@7",
    "坚忍不拔@形容信念坚定，意志顽强，不可动摇。@4",
    "坚定不移@意思是稳定坚强，毫不动摇；不放弃不改变自己的想法。@8",
    "专心致志@形容一心一意，精神高度集中地做事。也作“专心一志”。@8",


    "好高骛远@脱离实际地追求不可能实现的过高、过远的目标。@8@6",
    "急功近利@指急于追求成效，贪图眼前利益。含贬义;@12",
    "不切实际@不符合现实状况或需要。@4",
    "沽名钓誉@比喻故意矫情做作。用手段猎取名声或赞誉。@5",
    "天方夜谭@比喻虚诞、离奇的言论。@6",
    "鞭长莫及@指虽然鞭子很长，但总不能打到马肚子上，比喻距离太远而无能为力。@7",
    "痴人说梦@比喻根本办不到的荒唐话。@1",


    "原封不动@意思是指原来贴的封口没有动过。比喻保持原来的样子，一点不加变动。@3@6",
    "一板一眼@比喻行为有条理，合规矩，不马虎。[近］一丝不苟。［反］敷衍了事。@6",
    "原汁原味@食物原有的味道和汤汁。比喻事物本来的，没有受到外来影响的风格，特性等。@1",
    "一字不差@是一个字也没有更改的意思。@1",
    "亘古不变@从古到今，没有变化。@9",
    "一成不变@一经形成，不再改变，常用在否定句中。@22",
    "颠扑不破@无论怎样震动摔打都破不了。比喻理论、道理等牢固可靠，经得起检验@3",


    "战无不胜@打仗没有不取得胜利的。形容力量十分强大。也与攻无不克连用，战无不胜，攻无不克。又作战必胜，攻必克。@2@6",
    "匹夫之勇@指毫无智谋，单凭一己之力蛮干的勇气，该成语在句中多作宾语，也作主语；含贬义。@2",
    "炉火纯青@比喻功夫达到了纯熟完美的境界，不仅可形容技艺等，还可用在学术修养方面。@5",
    "好勇斗狠@爱ä威风，喜欢斗殴。形容人凶强好斗。@1",
    "知己知彼@对自己和对方都了解得很透彻。@2",
    "攻其不备@趁对方没有防备时进攻。@1",
    "以逸待劳@指在战争中做好充分准备，养精蓄锐等疲乏的敌人来犯时给以迎头痛击。在句中作谓语、宾语、状语；含褒义。@2",


    "不露声色@心里的打算不在说话和脸色上显露出来。@2@6",
    "见多识广@形容阅历深，经验多，知识广博，一般为口语。@2",
    "有备而来@参与某个事情以前,事先有充分的准备。@1",
    "丛容不迫@指镇定沉着，形容遇事镇定自若，不慌不忙。含褒义；在句中一般作谓语、定语、状语。@6",
    "讷口少言@不善于说话。不善言谈，说话不多。@1",
    "片言只语@简短零碎的话语、文字。形容语言文字数量极少。@3",
    "臧口不言@绒封闭。闭住嘴不说话。形容人言语谨慎，不说或不愿意说。@2",


    "另辟蹊径@开辟一条路。比喻另创一种风格或方法。@9@6",
    "推陈出新@去掉旧事物的糟粕，取其精华，并使它向新的方向发展，侧重强调文化的去粕取精。@24",
    "一举两得@指做一件事，同时收获两方面的好处。含义；在句中一般作谓语、定语。@5",
    "扬长避短@发挥或发扬优点或有利条件，克服或回避缺点或不利条件。@6",
    "独树一帜@比喻与众不同，自成一家，多含褒义,除用于艺术创作外，还可用于政治、经济等创业道路。@28",
    "崭露头角@比喻突出地显示出才能和本领。@19",
    "独领风骚@形容表现特出，超越群伦。@5",


    "灰飞烟灭@意思是像灰、烟一样很快消失。形容在极短时间内消失干净。@2@6",
    "土崩瓦解@彻底奔溃，不可收拾。@1",
    "化为乌有@乌有没有，不存在。变得什么都没有了。形容一子全部丧失或落空。@2",
    "分崩离析@形容国家或集团四分五裂，不可收拾。@5",
    "置若圈闻@放在一边，好像没有听见似的。指不去过问或不予关心，强调不重视，不关心，侧重于听。@13",
    "充耳不闻@塞住耳朵不听。形容有意不听别人的意见。@5",
    "烟消云散@像烟云消散一样。比喻事物消失得干干净净。@9",


    "与众不同@表示与其它人不一样。@10@6",
    "标新立异@故意提出新奇的见解，表示自己与众不同，着重体现在显示特点。@17",
    "独一无二@没有相同的或没有可以相比的，形容十分稀少。@19",
    "与生俱来@一生下来就是如此。@13",
    "得天独厚@具有特殊优越的条件。多指人的资质或自然环境而言。@12",
    "独辟蹊径@意思是自己开辟一条路。比喻独创一种新风格或者新方法。@7",
    "别具匠心@具有与众不同的巧妙构思，多用于写文章、绘画、工程设计等。@4",


    "悄无声息@意思是形容没有声音或声音很轻；也形容没有名声默默无闻。@3@6",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化，暗示为影响看不到，无形，主体一般是事或物。@27",
    "不着痕迹@指做事情做得天衣无缝，没有破绽，不易被人察觉。@1",
    "默不作声@不说话、不出声，保持沉默。@2",
    "耳濡目染@指经常听到看到，不知不觉地受到影响，多用于人，用于好的方面，侧重指技能方面。@14",
    "润物无声@指有大胸怀者，做了贡献而不张扬，默默奉献。@11",
    "扑朔迷离@形容事物错综复杂，不容易看清真相。@15",


    "远见卓识@解释为有远大的眼光和卓越的见解。@3@5",
    "真知灼见@意思是真正知道，确实看见。也指正确、深刻而透彻的见解。@3",
    "深谋远虑@指计划得很周密，考虑得很长远。@6",
    "肺腑之言@指发自内心的真诚话。@4",
    "不刊之论@比不能改动或不可磨灭的言论，用来形容文章或言辞的精准得当，无邂可击。@2",
    "丕易之论@不可更改的言论，形容论断或意见非常正@3",


    "不以为然@不认为是对的。@10@6",
    "不以为意@不把它放在心上。表示对人或事抱轻视态度。@4",
    "自以为是@总以为自己是对的，认为自己的观点和做法都正确，不接受他人意见，形容主观，不虚心。@9",
    "随心所欲@指随着自己的意思，想要干什么就于什么。@13",
    "各行其是@按照各自认为对的去做，指思想不统，各人按照自己的意见、主张去做，侧重强调做法。@8",
    "不可名状@无法用语言来形容。@2",
    "不置可否@不说可以，也不说不可以。指不表明态度。@4",


    "稳扎稳打@意思是有把握地作战。也比喻有把握、有步骤地工作。@3@6",
    "循序渐进@指按照一定的步骤或程序逐渐推进或提高，常用于学习、工作中以及处理事情时，含褒义。@18",
    "实事求是@原指根据实证，求索真知；现多用以按照实际情况办事，不夸大不缩小。含褒义；在句中一般作定语、宾语、状语。@5",
    "兢兢业业@形容做事小心谨慎，认真踏实，一般用在工作上。@14",
    "脚踏实地@比喻做事踏实认真，实事求是而不浮夸。@7",
    "未雨绸缪@意思是着天没下雨，先修房屋门窗。比喻事先做好准备工作，预防意外的事情发生，重在准备，侧重已经开始做了，有具体行动。@27",
    "一鼓作气@作战开始时鼓足勇气，现在比喻劲头大时一口气完成.@6",


    "逆水行舟@意思是逆着水流的方向行船，比喻不努力就要后退。@3@6",
    "背水一战@指背靠临近河水之地摆阵，或布下阵势。后来指处于绝境之中，为求出路而决一死战。多用于军事行动，也可用于比喻有“决战”性质的行动。在句子中可充当谓语、定语，含褒义。@2",
    "反败为胜@扭转败局，变为胜利。@3",
    "反戈一击@调转枪头向原来所属的阵营进攻。也比喻一旦觉悟，回过头来对自己一方的坏人坏事进行揭露和斗争。@1",
    "脚踏实地@比喻做事踏实认真，实事求是而不浮夸。@7",
    "迎难而上@算遇到困难也不退缩，迎着困难去克服它。形容不怕困难，不怕挫折，勇敢地挑战。@4",
    "砥砺前行@经历磨炼，克服困难，往前进步的意@3",


    "货真价实@货物不是冒牌的，价钱也是实在的。形容实实在在，点不假。@4@6",
    "名副其实@指名声或名称与实际相符合，含褒义。@9",
    "名不虚传@传出的名声不是虚的，意名声和实际相符。@3",
    "巧夺天工@形容人的精巧胜过天然，比喻技艺高超巧妙。含褒义。@9",
    "不孚众望@孚信服。意思是不能使大家信服，未符合大家期望。@3",
    "彻头彻尾@指从头到尾，全部，十足的意思。@2",
    "不折不扣@指没有折扣，表示完全、十足的意思，经常与贬义词一起使用。@2"
]