export const importData = [
    "不容置喙@指不允许别人插嘴说话。@@6",
    "无可厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非@",
    "毋庸置疑@事实明显或理由充分,根本就没有怀疑的余地。@",
    "不容置疑@不允许有什么怀疑,表示论证严密无可怀疑。@",
    "不容辩驳@不容辩驳@",
    "无懈可击@意思是没有可以被人攻击或挑剔的缝隙形容非常严密。@",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举足：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    
    
    "刚愎自用@指佩强固执,自以为是；形容十分固执己见,不考虑别人意见。含贬义；在句中一股作谓语、定语。@@6",
    "好大喜功@不管条件是否许可,一心想做大事,立大功(多含贬义)。@",
    "讳疾忌医@比喻怕人批评而掩饰自己的的缺点和错误；在句子中作主语、宾语、定语,@",
    "泥古不化@泥：拘泥,固执。拘泥于古代的成规或古人的说法,而不知灵活运用。@",
    "剑走偏锋@一指不走常规,找一些新的、不同以往的办法来解决问题,以求出奇制胜；二指法评述语。@",
    "恃才放旷@倚仗着自己的才能而对自己的行为不加以约束。@",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@",
    
    
    "好大喜功@不管条件是否许可,一心想做大事,立大功(多含贬义)。@@6",
    "讳疾忌医@比喻怕人批评而掩饰自己的的缺点和错误；在句子中作主语、宾语、定语。@",
    "刚复自用@指强固执,自以为是；形容十分固执已见,不考虑别人意见。含贬义；在句中一般作谓语、定语。@",
    "急功近利@指急于追求成效,贪图眼前利益。含贬义;@",
    "顾此失彼@顾了这头,丢了那头。形容照顾不过来。「反】两全其美面面俱到。@",
    "心浮气躁@不冷静,躁动。@",
    "瑕不掩瑜@比喻缺点掩盖不了优点,优点是主要的,缺点是次要的,@",
    
    
    "无稽之谈@毫无根据的说法。@@6",
    "天方夜谭@比喻虚诞、离奇的言论@",
    "荒诞不经@意思是少有的,荒唐,不可信之意。形容虚妄离奇,不合情理。@",
    "考生常谈@老书生经常发表的平凡议论：多用于比喻毫无新意的理论或者适,属中性词@",
    "荒谬之词@荒谬之词@",
    "奇谈怪论@荒唐不近情理的言论,@",
    "脑洞大开@本指观剧者在大脑里通过自己的想象来补充或添加原剧中没有的情节或内容。后来词义扩大,对小说及其基他艺术作品基至现实生活中的情节、情景进行幻想、想象,也称“脑补“即扩@",
    
    
    "百里挑一@一百个当中就挑出这一个来。形容人才出众,不可多得。@@6",
    "精挑细选@仔细的选择。@",
    "沙里淘金@从沙里淘出黄金,比喻好东西不易得,也比喻做事费力大而收效少,也比丛大量的材料里选择精华。@",
    "优中选优@优中选优@",
    "屈指可数@形容数目很少。【反]不计其数@",
    "千载难逢@本义是一千年也难碰到一次,后比喻机会非常难得；在句子中一般充当谓、定语、分句；含复义。@",
    "凤毛麟角@比喻难得而宝贵的人或事物。@",
    
    
    "光怪陆离@形容奇形怪状,五颜六色。@@6",
    "荒诞不经@意思是少有的,荒唐,不可信之意。形容虚妄离奇,不合情理。@",
    "绚烂多彩@指各种各样的色彩灿烂美丽,形容色彩华丽：也指绚烂无比,形容多姿多彩或常精彩。@",
    "色彩斑斓@形容色彩灿烂的样子或形容生活或文学作品等所包含的内容丰富多彩。@",
    "五彩纷呈@好多种颜色。@",
    "眼花缭乱@眼睛看到复杂纷繁的东西而感到迷乱,常搭配“令人。@",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真,生动形象。@",
    
    
    "流连忘返@常形容对美好景致或事物的留恋。@@6",
    "乐不思蜀@指快乐得不再思念蜀国：比乐而忘返或乐而忘本留恋他乡。含贬义：在句中一般作谓语、定语。@",
    "心驰神往@形容思想集中在追求和向往的事情或地方上,一心向往。@",
    "大开眼界@广泛地开阔了视野,增长了见识@",
    "心潮澎湃@意思是心里像浪潮翻腾。形容心情十分激动,不能平静。@",
    "眼花缭乱@眼睛看到复杂纷繁的东西而感到迷乱,常搭配“令人”。@",
    "目不暇接@东西太多,眼睛看不过来。@",
    
    
    "脱胎换骨@道教徒认为人在苦修得道之后,就能脱下胎,换上骨。现在常用来比愉痛改前非,重新做人。@@6",
    "点石成金@比把不好的文字改好。@",
    "脱颖而出@比喻有才能的人得到机会,即本领全部显现出来。基本身结构为偏止式,在句子中可充当谓语、宾语、定语,含褒义、@",
    "面且全非@指面孔变得完全不是原来的样子,也形容事物变化很大。多为贬义。@",
    "超脱尘俗@指解脱世间不知变通的、拘泥的习俗的束缚。@",
    "革故鼎新@指除去旧的,建立新的。@",
    "旧瓶新酒@比喻旧形式,新内容的意思。@",
    
    
    "语焉不详@指虽然提到了,但说得不详细。@@6",
    "轻描淡写@原指描绘时用浅淡的颜色轻轻地着笔,现多指说话写文章把重要问题轻轻带过,不加重视,也比喻做事不费力。@",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。又指文章言论的肤浅无真知实学。@",
    "穿凿附会@是把讲不通的或不相干的道理、事情硬扯在一起进行解释。@",
    "模棱两口@指对一件事情没有明确的态度或主张(模棱：意见或态度不明确。两可：这样也可以,那样也可以)。该成语在句中可作谓语、状语、定语、补语；多含贬义。@",
    "含糊其辞@故意把话说得含混不清。@",
    "善恶莫辨@对好的,和不好的不能准确的分辨。@",
    
    
    "自圆其说@是指使自己的说法前后一致,没有自相矛盾的地方。@@6",
    "尽善尽美@意思是指极其完善,极其美好：形容事物完美到没有一点缺点,也作“尽美尽善”。在句中作谓语、宾语、定语。@",
    "无懈可击@意思是没有可以被人攻击或挑剔的缝隙.形容非常严究@",
    "天衣无缝@比喻事物没有一点儿破绽。【反】破绽百出。@",
    "融会贯通@指各方面的知识或道理融合贯穿起来,从而得到系统透彻的理解。@",
    "异想天开@比喻荒唐离奇,想象着暂时无法实现的事,还比超强的想象力。@",
    "天马行空@天马奔驰神速：像是腾起在空中飞行一样。多比喻诗文气势豪放,不受拘束。多比人浮躁；不踏实。也有说明不切实际之意@",
    
    
    "江河日下@指江河的水一大大地向下流,现比愉情况一大大地坏下去。@@6",
    "日薄西山@原义是阳已经接近西边的山：比喻人已经衰老或事物衰败腐朽,临近死亡；在句子中可充当作谓语、宾语、补语；含贬义。@",
    "泥沙俱下@指在江河的急流中泥士和沙子随着水一起冲下。比愉好环性质不同的人或者事物混杂在一起。@",
    "应声而下@随着声音落下来。@",
    "突飞猛进@侧重强调进步、进展非常快@",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "与日俱增@用于人的思想感情,指随着时间的推移而不断增长。@",
    
    "日积月累@一天一月地积累起来,形容长时间积累。[近】积少成多。@@6",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而渐发生变化,暗示为影响着不到,无形,主体一般是事或物。@",
    "耳濡目染@指经常听到看到,不知不觉地受到影响,多用于人,用于好的方面,侧重指技方面,@",
    "推波助澜@比喻从旁鼓动、助长事物(多指坏的事物)的声势和发展,扩大影响。@",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不解,不中断。@",
    "按部就班@按照一定的步骤、顺序进行；也指按老规矩办事,缺乏创新精神。@",
    "不知不觉@没有意识到,没有觉察到。@",
    
    
    "酣畅淋漓@形容非常畅快、舒适。常指文章绘画,文艺作品感情饱满,笔意流畅,情感得到充分抒发。@@6",
    "淋漓尽致@形容文章或说话表达得非常充分、透彻。也可形容非常痛快@",
    "无可比拟@没有可以相比的。@",
    "如痴如醉@形容神态失常,失去自制。@",
    "由外及内@外：表面；内：本质。从表面现象看到本质。@",
    "二览无金@一眼望去就看得很清楚,毫无遗漏。@",
    "毫无保留@一点都没有剩余。指全盘托出。@",
    
    
    "毫无疑问@指没有一点疑问,十分肯定。@@6",
    "不证自明@意思是：公理是根据事实得出的结论不用证明,有的也无法证明。比愉内心的诚意不用表日,必然表现在行动上。@",
    "不言而喻@指不用说就可以明白。形容道理很浅显。@",
    "人所共知@人人都知道。@",
    "的的确确@真实的、毫无疑问@",
    "或多或少@也许,有可能就是也许多一点,也许少一点,两种情况都有可能发生。@",
    "自始至终@指从开始到未了,指一贯到底。@",
    
    
    "杂乱无章@形容乱七八槽,没有条理,@@6",
    "泥沙俱下@指在江河的急流中泥士和沙子随着水一起冲下。比好坏性质不同的人或者事物混杂在一起。@",
    "乌烟瘴气@形容环境杂、秩序混乱或社会上歪风邪气盛行。@",
    "鱼龙混杂@意思是形容好人和坏人混在一起。@",
    "细枝末节@比喻事情或问题的细小而无关紧要的部分。@",
    "繁文缛节@烦琐而多余的仪式或礼节,比喻烦琐多余的事项。@",
    "零零星星@零碎的,少量的。形容零散而不完整。@",
    
    
    "画地为牢@在地上画一个圈当做监狱,比喻只许在指定的范围内活动。在句子中可作谓语、宾语。@@6",
    "闭门造车@关上门造车,比喻只凭主观办事,不管客观实际。@",
    "一成不变@一经形成,不再改变,常用在否定句中。@",
    "固步自封@比喻守着老一套,不求进步。@",
    "墨守成规@指思想保守,守着老规矩不肯改变。@",
    "刻舟求剑@一般比喻死守教条,拘泥成法,固执不变通的人。在句子中多作谓语、定语或状语,多含贬义。@",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义@",
    
    
    "平分秋色@比双方客得一半,不分高低,表示平局。@@6",
    "等量齐观@指对有差别的事物同等看待@",
    "厚此薄彼@比喻对人、对事不同看待。@",
    "伯仲之间@伯仲：兄弟排行中的老大和老二。兄弟之间。比喻人或事物不相上下,优势难分。@",
    "双峰并峙@字面的意思是两座高峰相对嘉立。常指在某领域都取得卓越成就的两个人,@",
    "强强联合@强者和强者互相结合。形容：指力量强大。@",
    "泾渭分明@泾河水清,渭河水浑,泾河的水流入渭河时,清浊不混。比界限清楚或是非分明。@",
    
    
    "鲜为人知@意思是很少有人知道。@@6",
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很广,侧重知名度高。@",
    "众所周知@意思是大家都知道的,侧重于普遍性。@",
    "家喻户晓@家家户户都知道。形容人所共知,侧重流传的广。@",
    "知之基少@对某方面知道的太少。@",
    "不为人知@不被人所知道了解。@",
    "不予理踩@不要搭理某人。'理躲'这个词语,在这里表示对别人言行给以注意并表示态度,多用于否定。@",
    
    
    "言简意赅@形容说话写文章简明抛要@@6",
    "耐人寻味@形容值得让人仔细体会、琢磨。@",
    "微言大义@意思是包含在精微语言里的深刻的道理。@",
    "意味深长@形容含义深刻,耐人寻味。@",
    "止本清源@从根本上整顿,从源头上清理。比喻从根源上加以整顿清理。@",
    "画龙点晴@比喻写文章或讲话时,在关键处用几句话点明实质,使内容更加生动有力。该成语在句中一般充当作谓语、定语、状语；含复义@",
    "深入浅出@指言论或文章的观点主题意义深刻但在语言文字的表达方式上却浅显易懂@",
    
    
    "淋漓尽致@天形容文章或说话表达得非常充分、透彻。也可形容非常痛快。@@6",
    "酣畅淋漓@形容非常畅快、舒适。常指文章绘画,文艺作品感情饱满,笔意流畅,情感得到充分打发。@",
    "一览无余@一眼望去就看得很清楚,毫无遗漏。@",
    "痛痛快快@马上、毫不犹豫,尽情。@",
    "兴致勃勃@兴致：兴趣。勃勃：旺盛的样子。形容兴趣浓厚,情绪高昂。@",
    "尽情尽兴@尽量抒发情感.不受约束.使兴趣得到充分满足。@",
    "毫无保留@一点都没有剩余。指全盘托出。@",
    
    
    "骇人听闻@多指社会上发生的坏事使人吃惊,其事实是睿观实际的。@@6",
    "耸人听闻@指故意夸大或捏造事实,使人听后感到震惊,其“事实“并非如此@",
    "危言耸听@指故意说些弯大的吓人的话,使人惊疑震动。@",
    "触目惊心@看见某种严重情况而内心震惊,形容事态严重,引起轰动,也写作术目惊心。@",
    "惨不忍睹@悲惨得让人不忍心看下去,形容极其悲惨。@",
    "膛目结舌@瞪眼翘舌说不出话来。形容人窘迫或惊呆的样子。也形容人害怕的表情。@",
    "捕风捉影@逮住风,抓住影子,后指不可能做到的事,比喻说话做事没有确切的事实根据,无事生非：含贬义。@",
    
    
    "鞭长莫及@指虽然鞭子很长,但总不能打到马肚子上,比喻距离太远而无能为力。@@6",
    "无能为力@意思是用不上力量,帮不上忙,指没有能力或力不能及,@",
    "望尘莫及@指只望见前面骑马的人走过扬起的尘土而不能赶上。比喻远远落后,常用作谦词。@",
    "爱莫能助@指虽然心中关切同情,却没有力量帮助；在句子中一般作谓语、定语@",
    "天方夜谭@比喻虚诞、离奇的言论。@",
    "好高骛远@脱离实际地追求不可能实现的过高过远的目标。@",
    "痴人说梦@比喻根本办不到的荒唐话,@",
    
    
    "坚定不移@意思是稳定坚强,毫不动摇；不放弃,不改变自己的想法。@@6",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    "百折不挠@指虽然受到很多挫折,但仍不动摇退缩或屈服。形容意志坚强。含優义；作谓语、定语、状语。@",
    "全心全意@投入全部精力,毫无保留@",
    "聚精会神@形容专心致志,注意力高度集中的样子。@",
    "众星拱且@比喻许多人共同簇拥一个人。@",
    "步且登云@步上月亮,攀登云霄。形容志向远大。@",
    
    
    "孜孜不倦@意思是指工作或学习勤奋不知疲倦@@6",
    "兢兢业业@形容做事小心谨慎,认真踏实,一般用在工作上。@",
    "坚韧不拔@形容信念坚定,意志顽强,不可动摇。@",
    "按部就班@按照一定的步骤、顺序进行；也指按老规矩办事,缺乏创新精神@",
    "弹精竭虑@形容用尽精力、费尽心思,一般偏重脑力劳动。@",
    "大公无私@比喻一心为公,毫无私心；常用来歌颂人的优良品质和秉公处理事情。并列结构；含有义。@",
    "公而忘私@是为了公事而不考虑私事,为了集体利益而不考虑个人得失。该成语的结构为联合式；在句中一般作主语、谓语、宾语。@",
    
    
    "不容置疑@不充许有什么怀疑,表示论证严密,无可怀疑@@6",
    "不容置喙@指不允许别人插嘴说话。@",
    "不可推卸@不可推卸@",
    "必不可少@是绝对需要的或者不达到某种目的就不能做成某种事情的意思。近义词为不可或缺和至关重要。@",
    "当仁不让@以仁为任,无所谦让：后指遇到应该做的事就积极主动去做,不推让@",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举足：抬脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "大有可为@比喻指前途极有希望,值得去做。@",
    
    
    "朝令夕改@意思是早晨发布的命令,晚上就改了。比喻经常改变主张和办法,一会儿一个样。一般在句中作谓语、定语、补语、分句：用于政策的变更。@@6",
    "夸夸其谈@指浮夸空泛地大发议论或写文章浮夸,不切合实际,@",
    "花拳绣腿@指姿势好看而搏斗时用处不大的拳术。@",
    "华而不实@原义是花开得好看,但不结果实：比愉中看不中用：在句子中可充当谓语、定语；含贬义。@",
    "移风易俗@旧的风俗习惯@",
    "翻云覆雨@反复无常或惯于玩弄手段@",
    "改弦更张@指换掉日的琴弦,再安上新的。比喻去旧更新,改变制度或做法等。@",
    
    
    "越俎代庖@比喻超出自己业务范围去处理别人所管的事@@6",
    "李代桃僵@李树代替桃树孟死,原比喻兄弟互相爱护互相帮助,后转用来比喻以此代彼或代人受过。@",
    "鸠占鹊巢@指强占别人的住屋,土地,产业等。@",
    "萧规曹随@按照前人的成规办事。@",
    "广纳良言@广泛的听取、采纳好的建议,@",
    "取而代之@原指夺取别人的权位而代替他。现泛指用某一事物代替另一事物。@",
    "更弦易辙@比喻改变方法或态度。@",
    
    
    "前所未有@从来没有过的。@@6",
    "始料未及@没有想到的,在意料之外的。@",
    "翻天覆地@形容变化巨大而彻底,也指闹得很凶。@",
    "有目共睹@形容人人都可以看到,极其明显@",
    "无孔不入@比喻有空子就钻,不放过任何一个机会,多指做坏事。@",
    "迫不得已@出于逼迫,不得不这样。[近】万不得己。【反]心甘情愿。@",
    "参差不齐@原意是长短、高低、大小不一致,形容很不整齐或水平不一。@",
    
    
    "道听途说@指道路上听来又在道路上传播出去：比愉毫无根据的传闻。含贬义；在句中一股作谓语。@@6",
    "稗官野史@称小说为稗官,泛称记载逸闻琐事的文字为稗官野史。@",
    "街谈巷议@意思是大街小巷里人们的议论。指民间的论。也是在街巷中谈说议论,形容议论纷纷@",
    "只言片语@作主语、宾语、定语：指很少的话@",
    "略知一二@略：略微。一二：指少的数量。稍微知道一点儿。多为自谦之语。@",
    "冰山一角@一般指非常大的事物只显露出很小的一部分,既可以作复义,也可以作贬义。@",
    "管中窥豹@比喻只见到事物的一小部分,推测全貌。含贬义。@",
    
    
    "义无反顾@从道义上只有勇往直前,不能犹豫回顾@@6",
    "勇往直前@勇敢地一直向前进。@",
    "责无旁贷@强调在自己的责任不能推卸给别人。@",
    "辉煌灿烂@辉煌灿烂@",
    "无怨无悔@无怨无悔,没有噢恼和怨恨。@",
    "天晴且朗@天晴且朗@",
    "当仁不让@以仁为任,无所谦让；后指遇到应该做的事就积极主动去做,不推让@",
    
    
    "渐行渐远@指由于性格、观念、背景、立场等的不同,导致前进的方向与自标之间发生偏离。@@6",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义。@",
    "相去甚远@互相之间存在很大差异和距离。@",
    "背道而驰@指向着相反的方向奔驰；形容背离正确自标,朝反方向走,一般容2个人。@",
    "貌合神离@表面上关系很密切,实际上是两条心。@",
    "咫尺天涯@比喻距离虽近但很难相见,像在很远的天边一样。@",
    "一去不返@指一去就不再回来了。比喻事情已成为过去,再不能重现。@",
    
    
    "各自为政@指客自在职权范围内按照自己的主张行事,不互相配合；也比愉不考虑全局,搞一套。含贬义；在句中一股作谓语、定语。@@6",
    "一盘散沙@比喻力量分散,没有组织起来。@",
    "群龙无首@比喻一群人中没有领头的人。@",
    "敷衍了事@意思是指办事马马虎虎,只求应付过去就算完事。@",
    "鱼目混珠@拿鱼眼睛冒充珍珠。比喻拿假的冒充真的,感情消极。@",
    "鱼龙混杂@意思是形容好人和坏人混在一起@",
    "形形色色@形容事物种类繁多,各式各样。@",
    
    
    "千篇一律@比喻办事按一个格式,非常机械；泛指事物形式陈旧呆板、呆滞。@@6",
    "一成不变@一经形成,不再改变,常用在否定句中。@",
    "如出一辙@像出自同一个车辙。比喻言论或行动完全一样。@",
    "一模一样@形容完全相同,没有什么两样。@",
    "循规蹈矩@指拘泥于旧的准则,不敢稍做变通。@",
    "按部就班@按照一定的步骤、顺序进行；也指按老规矩办事,缺乏创新精神。@",
    "如法炮制@(炮：烘、炒制中药的一种方法)指依照成法,制作中药；比喻照现成样子办事。在右中一般作谓语、定语、状语。@",
    
    
    "各有千秋@各客有客的存在的价值。比愉在同一层次内客人有客人的长处,各人有各人的特色。@@6",
    "千差万别@思是形容种类多,差别大。@",
    "自成一家@在某一方面的学问或技术有独到的见解或独特的做法,能自成体系。@",
    "并行不悖@同时实行,互相之间不冲突@",
    "别具一格@意思是比喻另有一种独特的风格,形容别致、新颖的样子,多用于艺术创作。@",
    "不遑多让@不追的意思是来不及,没有时间,不遑多让可以理解为来不及谦让,也可以引申为“不比......差”@",
    "旗鼓相当@指古代作战时用于指挥进退转移的军旗和战鼓数量相近；比喻双方实力或者能力不相上下。含毫义；在句中一般作谓语、定语@",
    
    
    "滥竽充数@比喻没有真才实学的人混在内行人之中,或以次充好。有时候也用来表示自谦。@@6",
    "鱼目混珠@拿鱼眼睛冒充珍珠。比喻拿假的冒充真的,感情消极。@",
    "鱼龙混杂@意思是形容好人和坏人混在一起。@",
    "龙蛇混杂@比喻好人和坏人混在一起。@",
    "趁虚而入@趁力量虚弱时侵入。@",
    "大行其道@在某范围内广为流传,盛行一时。@",
    "哗众取宠@用言论行动迎合众人,以博得好感或拥护。@",
    
    
    "谈虎色变@曾经被老虎伤过的人,一谈到老虎,就吓得变了脸色：比愉一提及某事就非常害怕：在句子中可充当谓语、定语、状语；含贬义。@@6",
    "讳莫如深@原意为事件重大,而不言。后指把事情隐满得很紧。@",
    "噤若寒蝉@原义是深秋的蝉那样一声不,比因害有所顾虑而不敢说话；在句子中可充当谓语,定语、状语。@",
    "揣揣不安@形容因害怕或担心而不安,@",
    "避之不及@指某一事物不招人喜欢都怕躲闪他都有点慢了而来不及了。@",
    "望而生畏@意思是一见之下就产生了畏惧心理形容人态度威严或事务艰难令人畏惧,@",
    "避而不谈@指躲避开而不肯说,有意回避事实@",
    
    
    "妄自尊大@总以为自己是对的,认为自己的观点和做法都正确,不接受他人意见,形容主观,不虚心。@@6",
    "随心所欲@指随着自己的意思,想要于什么就于什么。@",
    "各行其是@按照各自认为对的去做,指思想不统一,各人按照目已的意、主张去做,例重强调做法。@",
    "理所当然@道理当然是这样的,意为发生的事情本身合乎道理(非情理),不容怀疑。@",
    "茫然失措@心中迷惑,不知怎么办才好。@",
    "不以为然@不认为是对的。@",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化,暗示为影响看不到,无形,主体一般是事或物。@",
    
    
    "坚不可摧@非常坚固,不可摧毁,意志、精神、力量等。@@6",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@",
    "积重难返@指长期形成的不良的风俗、习惯不易改变。也指长期积累的问题不易解决,@",
    "嗤之以鼻@用鼻子声冷笑,形容对某事物或桌种现象的轻蔓。例重强调看不上、瞧不起、体现出'视'之意。@",
    "随心所欲@指随着自己的意思,想要干什么就干什么。@",
    "坐享其成@坐着不动,享受别人的劳动成果。近不劳而获。「反自食其力。@",
    "随意漫游@随意漫游@",
    
    
    "不约而同@指事先没有约定而相互一致。@@6",
    "不谋而合@强调事先没有商量过,意见或行动却完全一致,。@",
    "殊途同归@比喻采取不同的方法而得到相同的结果。@",
    "约定俗成@指事物的名称或社会习惯往往是由人民群众经过长期社会实践而确定或形成的,@",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而渐发生变化,暗示为影响着不到,无形,主体一般是事或物。@",
    "异曲同工@比喻不同时代、不同人的文章、言论一样精彩,或不同的事情产生相同的效果。原意为不同的曲子有着相同的影响,同样精彩。@",
    "不可或缺@不可缺少,引申为非常重要。@",
    
    
    "耳熟能详@听得多了,能够很清楚、很详细地复述出来@11@6",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面。@31",
    "街谈巷议@意思是大街小巷里人们的议论。指民间的舆论。也是在街巷中谈说议论,形容议论纷纷。@5",
    "如数家珍@好像在数自己家里的珍宝一样。通常用来形容某人对所进的事情十分熟悉,@12",
    "驾轻就熟@驾轻车,走熟路,比喻对事情熟悉做起来轻松便捷@8",
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很广,侧重知名度高。@10",
    "喜闻乐见@意思是喜欢听,乐意看。形容很受欢迎。@14",
    
    
    "一以贯之@信做人做事,按照一个道理,从一而终不会改变,主要指精神、纲领、准则等。@@6",
    "亘古不变@从古到今,没有变化@",
    "始终如一@指自始至终都一样,多用于形容人能坚持,做事从不间断,偏重于“始终不改变”。@",
    "一成不变@一经形成,不再改变,常用在否定句中。@",
    "有条不紊@形容做事、说话有条有理,丝毫不乱@",
    "勇任直前@勇敢地一直向前进@",
    "一如既往@指态度或做法没有任何变化,还是像从前一样。@",
    
    
    "生机勃勃@形容生命力旺盛的样子@@6",
    "紫蕊红葩@指各种色彩艳丽的花@",
    "风光旖旅@风光：景色。旖旅：柔美。形容景色柔和优美。@",
    "媚娜多姿@各种轻盈软美的姿态。形容女性轻盈柔美。@",
    "欣欣向荣@草木长的茂盛,生机勃勃的样子；后用于比喻事业蓬勃发展,侧重繁荣、昌盛的景象,含义。@",
    "生生不息@指不断地生长、繁殖。@",
    "源源不断@形容接连不断、连绵不绝。多用于事物,而少用于人。@",
    
    
    "无所不在@到处都存在,到处都有。@@6",
    "无孔不入@比有空子就钻,不放过任何一个机会,多指做坏事。@",
    "与日俱增@用于人的思想感情,指随着时间的推移而不断增长。@",
    "越来越大@越来越大@",
    "成倍增加@成倍增加@",
    "畅通无阻@畅：顺畅。毫无阻碍地通行或通过。也作'畅行无阻'。@",
    "无远弗届@指不管多远之处,没有达不到的。@",
    
    
    "深入人心@意思是指理论、学说、政策等为人们深切了解和信服。@11@6",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@24",
    "发扬光大@意思是使好的作风、传统等得到发展。@5",
    "博大精深@形容思想和学术广博高深。多用于形容理论、学识、思想、作品等广博丰富,深奥精微其形容对象多为某某内容。@17",
    "源远流长@河流的源头很远,水流很长。常比喻历史悠久,根底深厚。@20",
    "经久不衰@精神饱满的状态,身体健壮的外表；形容某事或某人经历很长时间旧保持较高的旺盛状态。@10",
    "牢不可破@坚固、紧密不能摧毁或拆开,多指抽象事物,如友谊。@2",
    
    
    "厚积薄发@多多积蕾蓄,慢慢放出。形容只有准备充分才能办好事情。@@6",
    "事必躬亲@不论什么事一定要亲自去做,亲自过问。主谓式；作谓语、定语；含優义。@",
    "脚踏实地@比喻做事踏实认真,实事求是而不浮夸。@",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不解,不中断。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    "独领风骚@形容表现特出,超越群伦。@",
    "遍地开花@比喻好的事物到处涌现或普遍发展。@",
    
    
    "众志成城@大家齐心协力,就像城墙一样地牢固,比喻众人团结一致,就能克服困难：在句中常用作谓语、定语：含褒义.@@6",
    "万众一心@千万人一条心,后多用来形容广大人民团结一致。该成语在句中多作谓语、定语,也作状语；含褒义。@",
    "无私无畏@因为不自私而无所畏惧。作谓语、定语；指人公正。@",
    "临危不惧@面对危难,一点也不害怕。@",
    "休戚与共@有幸福共同享受,有祸患共同抵挡。后形容关系紧密,利害相同。@",
    "同舟共济@侧重在困境中同心协力,共同度过难关；多含义。@",
    "唇齿相依@意思是嘴唇和牙齿互相依靠。比喻双方关系密切,相互依存。@",
    
    
    "五彩缤纷@表示颜色繁多,色彩绚丽,十分好看的样子@@6",
    "妙趣横生@层出不穷地表露。美妙的意趣接连不断地表露出来。@",
    "异彩纷呈@比喻突出的成就或表现。@",
    "奇观异彩@奇妙的光亮和色彩。@",
    "美不胜收@美好的东西很多,一时看不过来。@",
    "多姿多彩@指丰富多彩,形容颜色形态多种多样。@",
    "琳琅满目@比喻眼前到处充满了美好的事物。@",
    
    
    "波诡云谲@原形容房屋构造就像云彩、波浪一样于姿百态。后多形容事物变幻莫测,@@6",
    "变幻莫测@事物变化很多不能预料,变化多端难以瑞测。@",
    "错综复杂@头绪多,情况复杂,作谓语、定语；形容斗争、矛盾等@",
    "狼烟四起@四处都是报警的烟火,指边疆不平静。@",
    "今非昔比@指现在不是过去能比得上的,多指形势、自然面貌等发生了巨大的变化。@",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象@",
    
    
    "沧海桑田@是大海变成农田,农田变成大海；比喻世事变化巨大。其本身结构为联合式,在句子中可作谓语、宾语、分句。@@6",
    "跌宕起伏@形容事物多变,不稳定,也比喻音乐声忽大忽小和故事情节的曲折。@",
    "历经坎坷@道路高低不平,事情不顺利或不称心,比喻不得志。@",
    "此消彼长@不要太过于在乎此时的失去,别的方面会有长进。什么事情都有两面或者多面性。@",
    "白衣苍狗@是天上的浮云的形状像白衣裳,刻又变得像灰色的狗,比喻世事变幻无常。也作“日衣苍狗”。@",
    "波澜壮阔@原形容水面辽阔,现比喻声势雄壮或规模宏大。@",
    "气势磅礴@形容气势雄伟壮大。@",
    
    
    "浮想联翩@意思是浮不定的想象,比愉连续不断。指许许多的想象不断涌现出来。多用作贬义,有时也用作褒义,具体视语境而定。@@6",
    "异想天开@比喻荒唐离奇,想象看暂时无法实现的事,还比喻超强的想象力。@",
    "莫衷一是@不能判定哪个对,哪个错,侧重描述思想上。@",
    "因人而异@意思是因人的不同而有所差异。@",
    "众说纷纭@人多嘴杂,各有各的说法,议论纷纷。@",
    "心血来潮@原义是思绪像浪潮般的突起,比喻心重突然产生某种念头,这是一条老成语,过去没有贬义。但是后来使用时,已经略有贬义,指凭一时的冲动办事,未作周密的考虑；常与“忽然”、“一时“连@",
    "突发奇想@基本意思是形容突然想出一个非常奇@",
    
    
    "豁然开朗@指由狭窄幽暗突然变得宽阔明亮的样子。比喻突然领悟了一个道理@@6",
    "柳暗花明@形容柳树成荫,繁花似锦的春天豪象,比喻在曲折艰辛之后,忽然绝处逢生,另有一崔情景；在句中可充当作定语、宾语；含复义@",
    "茅塞顿开@原来心理像被茅草塞住,现在忽然一下子被打开了；后比喻忽然理解、明白了。该成语在句中多作谓语,也作状语、定语；含义。@",
    "喜出望外@指因遇到意外的喜事,心中非常高兴。@",
    "别开生面@比喻另外开创新的风格、形势或局面。突出“生面,表示为新的局面或形式,适用较为广泛。@",
    "心知肚明@心里明白但不说破,形容心中有数。@",
    "恍然大悟@对某一事物突然明白、突然醒悟。@",
    
    
    "异想天开@比喻荒唐离奇,想象看暂时无法实现的事,还比愉超强的想象力。@@5",
    "天马行空@天马奔驰神速：像是腾起在空中飞行一样。多比喻诗文气势豪放,不受拘束。多比喻人浮噪；不踏实。也有说明不切实际之意。@",
    "浮想联翩@意思是飘浮不定的想象,比喻连续不断。指许许多多的想象不断涌现出来。多用作贬义,有时也用作复义,具体视语境而定。@",
    "荒诞不经@意思是少有的,荒唐,不可信之意。形容虚妄离奇,不合情理。@",
    "心血来潮@原义是思绪像浪潮般的突起,比喻心里突然产生某种念头,这是一条老成语,过去没有贬义。但是后来使用时,已经略有贬义,指凭一时的冲动办事,未作周密的考虑；常与“忽然”、'一时'连@",
    "突发奇想@基本意思是形容突然想出一个非常奇怪的想法。@",
    
    
    "巧夺天工@形容人的精巧胜过天然,比技艺高超巧妙。含褒义。@@6",
    "鬼斧神工@是像是鬼神制作出来的。一般形容建筑、雕塑等的技艺精巧。@",
    "名不虚传@传出的名声不是虚的,意名声和实际相符。@",
    "货直价实@货物不是冒牌的,价钱也是实在的。形容实实在在,一点不假,@",
    "名副其实@指名声或名称与实际相符合,含豪义。@",
    "天造地设@事物自然形成,合乎理想,不必再加工。@",
    "精雕细刻@意思是精心细致地雕刻：形容创作艺术品时的苦心刻画；也比喻认真细致地加工。@",
    
    
    "齐心协力@指思想一致,共同努力。也作齐心合力。@@6",
    "万众一心@于万人一条心,后多用来形容广大人民团结一致。该成语在句中多作谓语、定语,也作状语；含褒义。@",
    "因地制宜@根据不同环境的实际情况制定相应的妥善办法。@",
    "正本清源@从根本上整顿,从源头上清理。比喻从根源上加以整顿清理。@",
    "有的放矢@放箭要对准靶子。比喻说话做事有针对性。@",
    "聚集合力@聚集合力@",
    "凝聚共识@凝聚共识@",
    
    
    "独具匠心@多指技术或艺术方面有创造性@@6",
    "自然而然@自由发展,必然这样。指非人力干预而自然如此。@",
    "兢兢业业@形容做事小心谨慎,认真踏实,一般用在工作上。@",
    "无师自通@指没有经过老师或者其他人的传授和指点帮助就能理解、摸透或者通晓某种东西。@",
    "眼花缭乱@眼睛看到复杂纷繁的东西而感到迷刮常塔配“令人”@",
    "应运而生@由于某件事衍生新事物,必然性@",
    "与日俱增@用于人的思想感情,指随着时间的推移而不断增长,@",
    
    
    "绞尽脑汁@形容苦思积虑,费尽脑筋,想尽办法；费尽心思去思考一件事情。@@6",
    "煞费苦心@形容费尽心思、费尽心机；同费尽心机、思苦想词义。@",
    "费尽心机@挖空心思,想尽办法。@",
    "挖空心思@形容费尽心思,想尽一切办法,@",
    "精雕细琢@精雕细刻,比喻做事情精益求精@",
    "处心积虑@形容蕾谋已久。@",
    "弹思竭虑@形容用尽心思。@",
    
    
    "袖手旁观@把手笼在袖子里,在一旁观看。比人置身事外,不帮助别人。多指看到别人有困难,不帮助别人。@@6",
    "独善其身@只顾自已,不管他人的个人主义处事哲学。@",
    "明哲保身@做贬义时指：为了保住个人利益回避原则斗争的庸俗作风：做蔓义时指：处世待人十分明智。@",
    "置身事外@意思是把自己放在事情之外,毫不关心。@",
    "隔岸观火@隔看河看人家看火。比喻对别人的危难不去求助,在一旁看热市。@",
    "逃之夭夭@形容桃花茂盛艳丽。后借用“逃之夭夭表示逃跑,是谐的说法。主谓式；作谓语；含贬义,是逃跑谐的说法。@",
    "一蹴而就@踏一步就成功。形容事情轻而易举,一下子就能完成,侧重强调时间短且十分容易。@",
    
    
    "掷地有声@比喻文章文辞优美,语言有力。现也形容落实力度大。@@6",
    "振聋发聩@声音很大,使耳聋的人也听得见。比喻用语言文字唤醒糊涂麻木的人,使他们清醒过来。@",
    "铿锵有力@形容声音响亮有节奏。指言辞或声音响亮有力。@",
    "气壮山河@形容气势如高山大河般雄壮豪迈。含复义；@",
    "入木三分@形容书法笔力刚劲有力,也比喻对文章或事物见解深刻、透彻。其本身结构为偏正式,在句子中可作谓语、定语、状语、补语,含褒义。@",
    "浓墨重彩@用浓重的墨汁和颜色来描绘,形容着力描写。@",
    "舍我其谁@形容人敢于担当,遇到该做的事,绝不退让。@",
    
    
    "瞻前顾后@原形容做事谨慎,考虑周到。后多形容顾虑过多犹豫不决。@@6",
    "勇往直前@勇敢地一直向前进。@",
    "妄自菲薄@过分看轻自己,形容自卑,含贬义。@",
    "优柔寡断@指做事犹豫,缺乏决断。@",
    "三心二意@意志不坚定,犹豫不决,也指又想这样又想那样,犹豫不定,@",
    "迟疑不决@迟疑：犹豫。心存疑虑而没有作出决定。也作“迟疑未决”。@",
    "忍气吞声@受了气勉强忍耐；把话压在肚子里不敢说出来。「反】扬眉吐气。@",
    
    
    "重中之重@比愉一件事是在一些重要的事中最重要的,形容这件事十分重要@@6",
    "当务之急@当前任务中最急切的要做的事,一般作主语、宾语。@",
    "大势所趋@意思是整个局势发展的趋向。@",
    "首当其冲@比喻最先受到攻击或遇到灾难。@",
    "燃眉之急@火烧眉毛那样紧急。形容事情非常急迫。@",
    "万全之策@意思是极其周到的计谋、办法。@",
    "势不可挡@指来势迅猛,不可抵挡。@",
    
    
    "长盛不衰@长久兴盛而不衰败比喻长时间保持旺盛的势头。一股用来形容文化、节日、传统等。@@4",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在蓬勃的发展,偏向积极方向。@",
    "源远流长@河流的源头很远,水流很长。常比喻历史悠久,根底深厚@",
    "博大精深@形容思想和学术广博高深。多用于形容理论、学识、思想、作品等广博丰富,深奥精微其形容对象多为某某内容。@",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    
    
    "千奇百怪@十分的奇怪,形容各种各样奇怪的事物,@@6",
    "五花八门@比喻事物繁多,变化莫测,体现出变化之意。@",
    "林林总总@形容杂乱众多。形容人或事物众多,只体现“多“之意。@",
    "千姿百态@形容姿态多种多样或种类十分丰富。@",
    "千变万化@比喻变化很多,在句子中一般充当谓语、定语。@",
    "形形色色@形容事物种类繁多,各式各样。@",
    "千差万别@意思是形容种类多,差别大。@",
    
    
    "前无古人@形容表现特出,超越群伦。@@6",
    "独树一帜@比喻与众不同,自成一家,多含复义,除用于艺术创作外,还可用于政治、经济等创业道路。@",
    "如日中天@比事物正发展到最兴盛的阶段。@",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在逢勃的发展,偏向积极方向。@",
    "和而不唱@赞同别人的意见,不坚持自己的说法。@",
    "崭露头角@比喻突出地显示出才能和本领。@",
    "另辟蹊径@另外开辟一条路。比喻另创一种风格或方法。@",
    
    
    "匪夷所思@形容人的思想、言谈、技艺、事情等离奇,超出寻常,指言谈行动离奇古怪,超出常情,不是一般人根据常理所能想象的。@@6",
    "啼笑皆非@形容处境尴尬或既令人难受又令人发笑的行为。@",
    "始料未及@没有想到的,在意料之外的@",
    "痛心疾首@指对人或事的痛恨,也指对自己所犯错误的悔恨；在句子中可充当谓语、状语、补语；也作“疾首痛心”。作谓语、状语、补语。@",
    "天方夜谭@比喻虚诞、离奇的言论@",
    "异想天开@比喻荒唐离奇,想象着暂时无法实现的事,还比喻超强的想象力。@",
    "荒诞不经@意思是少有的,荒唐,不可信之意。形容虚妄离奇,不合情理。@",
    
    
    "休戚相关@彼此的喜悦与忧愁共同承担,形容彼此命运联系在一起,息息相关。@@6",
    "息息相关@意思是彼此呼吸都相互关联,形容关系非常密切。@",
    "休戚与共@有幸福共同享受,有祸患共同抵挡。后形容关系紧密,利害相同。@",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果,@",
    "密不可分@形容十分紧密,不可分割。@",
    "生死攸关@关系到生和死。指生死存亡的关键。@",
    
    
    "坐享其成@坐看不动,享受别人的劳动成果。「近不劳而获。[反]自食其力。@@6",
    "守株待兔@一般比喻死守经验,不知变通。亦用以讽刺妄想不劳而获的幸心理；在句子中一般用作宾语、定语,多含贬义@",
    "得过且过@只要能够过得去,就这样过下去。形容胸无大志,没有长远打算；也指做事马马虎虎,敷衍了事。含贬义。@",
    "拈轻怕重@掠轻的,怕重的。形容工作上怕挑重担子。@",
    "坐收渔利@比喻利用别人的矛盾而从中获利@",
    "以一奉百@比喻劳动生产的人少,而享受、消费的人却很多。@",
    "坚不可摧@非常坚固,不可摧毁,意志、精神力量等。@",
    
    
    "合情合理@符合情理。@@6",
    "无可厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非。@",
    "顺理成章@写文章、做事情顺着条理就能做好比愉随看某种情况的发展而自然产生的结果@",
    "天经地义@指天地间理所当然而不能改变的道理；也指理所当然,不容置疑的问题；含义@",
    "水到渠成@比喻条件成熟,事情就会自然成功侧重强调条件成熟。含义；@",
    "顺其自然@意思是顺着事物本来的性质自然发展。@",
    "言之有理@说话有道理。@",
    
    
    "置身事外@意思是把自己放在事情之外,毫不关心@@6",
    "独善其身@只顾自己,不管他人的个人主义处事哲学。@",
    "明哲保身@做贬义时指：为了保住个人利益回避原则斗争的庸俗作风；做复义时指：处世待人十分明智。@",
    "袖手旁观@把手笼在袖子里,在一旁观看。比喻人置身事外、不帮助别人。多指看到别人有床难,不帮助别人。@",
    "抽身其外@抽身其外@",
    "置之度外@置：搁,放。度：考虑,打算。把它放在考虑之外。指不把它放在心上。@",
    "置之不理@放在一边：不予理踩,形容对某人某事十分冷淡。@",
    
    
    "虚无缥缈@形容空虚渺茫。指看不见,摸不看的虚幻,就像人的思想境界一样,没有实体感。固定搭配虚无缥缈形容隐隐约约、若有若无的样子与“海市屋楼“常见搭配。@@6",
    "扑朔迷离@形容事物错综复杂,不容易看清真相。@",
    "遥不可及@非常遥远而不可到达,意指非常遥远、难以得到的东西。@",
    "形势险峻@形势险峻@",
    "凶多吉少@指估计事态的发展趋势不妙,害多,吉利少。@",
    "一厢情愿@指只是单方面的愿望,没有考虑对方是否同意,或客观条件是否具备。@",
    "孜孜以求@不知疲倦地探求。@",
    
    
    "只言片语@作主语、宾语、定语：指很少的话@@6",
    "细枝末节@比喻事情或问题的细小而无关紧要的部分。@",
    "道听途说@指道路上听来又在道路上传播出去：比愉量无根据的传闻。含炫义：在句中一般作谓语。@",
    "一语双关@一句话包含两入意思,即表面上一入意思,而暗中却藏看另一人意思,@",
    "三言两语@几句话,形容话很少。@",
    "寥寥数语@非常简括地说。@",
    "刀光剑影@隐约显现出刀的闪光和剑的影子,形容环境充满了凶险的气氛,@",
    
    
    "行之有效@意思是实行起来有成效：指桌种方法或措施已经实行过,证明很有效用。@@6",
    "立竿见影@指在阳光下竖起竹竿,立刻就看到了竹竿的影子。词意比愉行事能马上看到效果或付出能马上得到收获。常与效应搭配@",
    "卓有成效@有卓著的成绩和效果。@",
    "一劳永逸@辛苦一次,把事情办好,以后就可以不再费力了。@",
    "轻而易举@强调事情容易做,不费力,与时间无关。@",
    "顺理成章@写文章、做事情顺着条理就能做好。比喻随着某种情况的发展而自然产生的结果。@",
    "四海皆准@比喻具有普遍性的真理到处都适用。@",
    
    
    "异曲同工@比喻不同时代、不同人的文章、言论一样精彩,或不同的事情产生相同的效果。原意为不同的曲子有看相同的影响,同样精彩@@6",
    "不谋而合@强调事先没有商量过,意见或行动却完全一致,。@",
    "殊途同归@比喻采取不同的方法而得到相同的结果。@",
    "一脉相承@从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系。@",
    "大同小异@指大体相同,略有差异。@",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同,不同之处很多。@",
    "如出一辙@像出自同一个车辙。比喻言论或行动完全一样。@",
    
    
    "一枝独秀@其他花都没有开放,只有这一枝在开看。比愉技高一筹,优势明显。@@6",
    "崭露头角@比喻突出地显示出才能和本领@",
    "脱颖而出@比喻有才能的人得到机会,即本领全部显现出来。其本身结构为偏正式,在句子中可充当谓语、宾语、定语,含優义。@",
    "名列前茅@比喻名次列在前面。@",
    "牛刀小试@是比喻有大本领的人,先在小事情上略展才能。也比喻有能力的人刚开始工作就表现出彩。@",
    "欣欣向荣@草木长的茂盛,生机勃勃的样子：后用于比喻事业蓬勃发展,侧重繁荣、昌盛的景象,含复义。@",
    "独树一帜@比喻与众不同,自成一家,多含褒义,除用于艺术创作外,还可用于政治、经济等创业道路。@",
    
    
    "费尽心机@挖空心思,想尽办法。@@6",
    "处心积虑@形容蕾谋已久。@",
    "绞尽脑汁@形容苦思积虑,费尽脑筋,想尽力法；费尽心思去思考一件事情。@",
    "挖空心思@形容费尽心思,想尽一切办法。@",
    "精雕细琢@精雕细刻,比喻做事情精益求精。@",
    "千方百计@释义是想尽种种办法；用出种种计谋。@",
    "殚精竭虑@形容用尽精力、费尽心思,一般偏重脑力劳动。@",
    
    
    "蜂拥而至@像一窝蜂似地拥来,形容很多人乱哄哄地朝一个地方聚拢。@@6",
    "趋之若鹜@像鸭子一样成群跑过去,比喻许多人争着去追逐。@",
    "纷至沓来@形容连续不断地到来。@",
    "争先恐后@指竞相抢先而不肯落后：多用于形容人的动作等：在句子中可充当谓语、状语：也作“恐后争先”,常与趋之若鹜一起连用@",
    "一掷千金@原指赌博时一注就扔下千金。现形容花钱没有节制,任意挥霍。也作“千金一掷”。@",
    "如影随形@的是好像影子老是跟看身体。比两人事物关系密切或两人人关系密切不能分离。@",
    "近水楼台@近水楼台指靠近水边的楼台：比喻由于接近某人或者事物,而抢先得到某种利益或便利。含贬义；@",
    
    
    "举世瞩目@全世界的人都注意看。@@6",
    "无与伦比@意思是指事物非常完美,没有能够与它相比的同类的东西。@",
    "世人皆知@指很多人都知道@",
    "空前绝后@意思是从前没有过,今后也不会再有；夸张性地形容独一无二。在句中作定语,@",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举足：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "无人不晓@没有人不知道。形容很有名气。@",
    "引人注目@形容人或事物很具特色,引起人们的注意。@",
    
    
    "始终如一@指自始至终都一样,多用于形容人能坚持,做事从不间断,偏重于“始终不改变”。(感情色彩)褒义@@6",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@",
    "积重难返@指长期形成的不良的风俗、习惯不易改变。也指长期积累的问题不易解决,@",
    "与生俱来@一生下来就是如此。@",
    "一以贯之@做人做事,按照一入道理,从一而终不会改变,主要指精神、纲领、准则等。@",
    "一如既往@指态度或做法没有任何变化,还是像从前一样。@",
    "独一无二@没有相同的或没有可以相比的,形容十分稀少。@",
    
    
    "特立独行@形容人的志行高洁,不同流俗。@@6",
    "曲高和寡@比喻言论或作品不通俗,能了解的人很少,用于消极语气。@",
    "随波逐流@自己没有立场和主见,只是随着潮流走,含贬义。@",
    "垂头丧气@形容因失败或不顺利而情绪低落、菱靡不振的样子。@",
    "日渐消沉@形容心情一天比一天低落,心里面总有一块压不下去的石头,就好像是一块心病,搞得自己心情烦噪不安情绪容易失控@",
    "故步自封@指把自己限制在原来的地方：比喻因循守旧,安于现状,不求创新进取。含贬义；在句中一般作谓语、定语。@",
    "一成不变@一经形成,不再改变,常用在否定句中。@",
    
    
    "百折不挠@指虽然受到很多挫折,但仍不动摇、退缩或屈服。形容意志坚强。含褒义；作谓语、定语、状语。@@6",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    "视死如归@原义是把把死看得像回家一样平常：形容人勇敢不怕死；在句子中可充当作谓语、定语状语。@",
    "不屈不挠@比喻在压力和困难面前不屈服,表现十分顾强。作谓语、定语、状语。@",
    "勇往直前@剪敢地一直向前进@",
    "坚定不移@意思是稳定坚强,毫不动摇：不放弃,不改变自己的想法。@",
    "坚韧不拔@形容信念坚定,意志顽强,不可动摇。@",
    
    
    "炉火纯青@比功夫达到了纯熟完美的境界,不仅可形容技艺等,还可用在学术修养方面,@@6",
    "登峰造极@登上顶峰,指到达最高点；比学问、技艺等已达到最高的境界。@",
    "白璧无瑕@原义是洁白的美玉上面没有一点小斑,比喻人或事物十全十美。@",
    "挥洒自如@写文章、写字或绘画得心应手,随意运笔,不受拘束。@",
    "出神入化@形容文学艺术或技艺高超达到了绝划的境界,还形容超脱了神通达到了自由国度的境界。@",
    "融会贯通@指各方面的知识或道理融合贯穿起来,从而得到系统透彻的理解。@",
    "尽善尽美@意思是指极其完善,极其美好：形容事物完美到没有一点缺点,也作“尽美尽善”。在句中作谓语、宾语、定语。@",
    
    
    "不堪一击@表示形容力量薄弱,经不起一击的意思。也形容论点不严密,经不起反驳的意思。@@6",
    "烟消云散@像烟云消散一样。比喻事物消失得干干净净。@",
    "明日黄花@过时或无意义的事物。@",
    "败走麦城@比喻陷入绝境,形容事事能成功的人也有失败的时候。@",
    "娇生惯养@指小受到太多的娇宠和溺爱,以至养成脆弱、凡事缺乏毅力的脾性；含贬义@",
    "弱不禁风@形容人身体娇弱,莲风吹都经受不起。@",
    "节节败退@形容接连失败退缩。@",
    
    
    "稍纵即逝@稍微一放松就消失了。形容时间或机会等很容易过去。@@6",
    "昙花一现@比喻美好的事物或景象出现了一下很快就消失。@",
    "天马行空@天马奔驰神速；像是腾起在空中飞行一样。多比喻诗文气势豪放,不受拘束。多比喻人浮躁；不踏实。也有说明不切实际之意。@",
    "自由自在@没有拘束、安闲舒适的样子。@",
    "标新立异@故意提出新奇的见解,表示自己与众不同,看重体现在显示特点@",
    "鱼目混珠@拿鱼眼晴冒充珍珠。比喻拿假的冒充真的,感情消极。@",
    "粗制滥造@意思是写文章或做东西马虎草率,只求数量,不顾质量。@",
    
    
    "分崩离析@形容国家或集团四分五裂,不可收拾。@@6",
    "一蹶不振@一跌倒就再也爬不起来,比遭受一次挫折以后就再也振作不起来。@",
    "误入歧途@指由于受煽感而走上了错误的道路@",
    "盛极而衰@一个事物如果强盛到了极点那么他离衰落的时间就不远了。@",
    "人人自危@人人都感到自己处境有危险。指局势或气氛十分紧张。@",
    "如履薄冰@好像走在薄冰上,比喻随时都会发生危险,做事极为小心谨慎,侧重在主观心态上。@",
    "难以为继@难以继续下去。@",
    
    
    "大有禅益@形容益处很大。@@6",
    "不可或缺@不可缺少,引申为非常重要@",
    "大有可为@比喻指前途极有希望,值得去做。@",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举足：抬脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "至关重要@相当地重要,要紧关头是不可缺少,词意比举足轻重来的重。@",
    "情有可原@按情理,有可原谅的地方。@",
    "无可厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非。@",
    
    
    "街谈巷议@意思是大街小巷里人们的议论。指民间的舆论。也是在街巷中谈说议论,形容议论纷纷。@@6",
    "耳熟能详@听得多了,能够很清楚、很详细地复述出来。@",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面语,@",
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很广,侧重知名度高。@",
    "耳口相传@口说耳听地往下传授@",
    "道听途说@指道路上听来又在道路上传播出去：比喻毫无根据的传闻。含贬义：在句中一般作谓语@",
    "如数家珍@好像在数自己家里的珍宝一样。通常用来形容某人对所讲的事情十分熟悉。@",
    
    
    "一往无前@意思是一直往前,无所阻挡。形容勇猛无畏地前进。@@6",
    "重中之重@比喻一件事是在一些重要的事中最重要的,形容这件事十分重要。@",
    "势不可挡@指来势迅猛,不可抵挡。@",
    "大势所趋@意思是整个局势发展的趋向。@",
    "披荆斩棘@指的是保护某事物能让其能正常发展。@",
    "紧锣密鼓@锣鼓点敲得很密,比喻公开活动前的紧张气氛和舆论准备,@",
    "乘风破浪@指船只乘着风势破浪前进(乘：趁看、借看；破：冲开),形容发展迅猛,也比喻志趣远大,勇往直前；在句中一般作谓语；多含复义@",
    
    
    "见贤思齐@指见到有才德的人就想看与他齐平：在句子中可充当谓语、宾语、定语；也作“见德思齐”。@@6",
    "集思广益@集中群众的智慧,广泛吸收有益的意见。该成语构词方式是联合式；在句中作谓语、定语、状语。@",
    "博采众长@从多方面吸取各家的长处。@",
    "兼收并蓄@指把不同内容、不同性质的东西收下来,保存起来。@",
    "反躬自省@指回过头来检查自己已的过错。含义；在句中一般作谓语、定语、状语。@",
    "洗心革面@比喻彻底悔改。[近］脱胎换骨。@",
    "兼听则明@听取多方面意见,就能明辨是非,做出正确判断。@",
    
    
    "驾轻就熟@驾轻车,走熟路,比愉对事情熟悉,做起来轻松便捷。@@6",
    "耳熟能详@听得多了,能够很清楚、很详细地复述出来。@",
    "游刃有余@形容技艺熟练,做事轻松利落。含复义；在句中一般作谓语、宾语。@",
    "独当一面@指单独承当一方面的工作或使命；在句子中可充当作谓语、定语、状语；含侵义。@",
    "轻车熟路@赶着装载很轻的车子走熟悉的路,比喻事情又熟悉又容易。@",
    "得心应手@心里怎么想,手就能怎么做,比喻技艺纯熟或做事情非常质利。基本身结构为连动式,在句子中可作宾语、定语、状语,含义@",
    "肩负重任@担当重要工作或任务。@",
    
    
    "知难而退@原义指作战时相机行事,遇到不利情况应及时退避；中性。后指碰到困难就退缩；含贬义。该成语在句中-般作谓语,也作宾语。@@6",
    "望而生畏@意思是一见之下就产生了畏惧心理。形容人态度威严或事务艰难令人畏惧@",
    "望洋兴叹@原指在伟大的事物面前感叹自己的微小,后比喻因眼界大开而惊奇赞叹或因能力不及而感到无可奈何,含贬义。@",
    "畏缩不前@畏惧退缩,不敢向前。也作畏蕙不前。@",
    "望而却步@指看到了危险或力不能及的事而往后退缩。@",
    "束手就擒@捆起手来让人捉住。指毫不抵抗,乘乖地让人捉住。@",
    "自暴自弃@自己甘心落后,不求上进。@",
    
    
    "于事无补@指对事情没有什么益处。常用来表示所做之事对真正需要完成的事情没有帮助。@@6",
    "无力回天@形容事态的发展,已经到了无法挽回的地步或者比喻局势或病情严重,已无法挽救。@",
    "收效甚微@指付出的努力基本没什么效果。@",
    "事倍功半@形容做事的方法费力大,收效小。@",
    "无计可施@没有办法可用。@",
    "无从下手@指没有任何途径没法着手去办。@",
    "不了了之@指把未做完的事情放在一边不管,就算完事。@",
    
    
    "引人入胜@指十分吸引人的,使人沉醉的优美的境界。多指山水风景或文艺作品吸引人。@11@6",
    "妙趣横生@层出不穷地表露。美妙的意趣接连不断地表露出来。@9",
    "令人惊诧@让人感到惊讶。@1",
    "咂舌攒眉@)形容人吃酸物的表情或惊的神情。@1",
    "蔚为壮观@形容事物美好繁多,形成盛大壮观的景象。@1",
    "为之兴奋@为之兴奋@1",
    "令人向往@使人热爱、羡幕某种事物或境界而希望得到或达到。@1",
    
    
    "格格不入@形容彼此思想不协调,想法不相容,不体现对立关系。@@6",
    "背道而驰@指尚看相反的方向奔驰；形容背离正确目标,朝反方向走,一般形容2个人。@",
    "大相径庭@强调两入事物相差很远、彼此有亲盾,大不相同,不同之处很多。@",
    "分道扬镳@多比喻志趣、且的不同,各走各的路。@",
    "分崩离析@形容国家或集团四分五裂,不可收拾。@",
    "俗不可耐@俗得让人无法忍受。@",
    "不合时宜@指不符合当时的需要或情况@",
    
    
    "大有可为@比愉指前途极有希望,值得去做,@@6",
    "举足轻重@一起脚就可以改变两边的重量,使之失去平衡与均势(举足：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "不可或缺@不可缺少,引申为非常重要@",
    "大有裨益@形容益处很大。@",
    "至关重要@相当地重要要紧关头是不可缺少,词意比举足轻重来的重。@",
    "不容置喙@指不允许别人插嘴说话@",
    "不容置疑@不允许有什么怀疑,表示论证严密无可怀疑。@",
    
    
    "不离不弃@永远在身边,永不分离,永不抛弃。@@6",
    "锲而不舍@比喻有恒心,有毅力；含复义。@",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不解,不中断。@",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    "渐入佳境@比喻兴趣逐渐浓厚或境况逐渐好转。@",
    "声名鹊起@形容名声突然大振,知名度迅速提高。@",
    "绵绵不绝@形容多,连续不断。@",
    
    
    "势如破竹@指形势如同劈竹子一样,劈开上头几节,下面各节就顺看力口裂开了。后比喻节节胜利,毫无阻碍。@@6",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易,@",
    "所向披靡@指力量所到之处,一切障碍全被扫除。此语常用于形容军事或体育竞技中绝无对手的常胜劲旅。@",
    "势不可挡@指来势迅猛,不可抵挡。@",
    "势在必行@不能躲开或回避；从事情发展的趋势看,必须采取行动。@",
    "势如累卵@累：堆积。形势就像堆积的蛋,马上就要塌下来。形容事态非常危险,@",
    "立竿见影@指在阳光下竖起竹竿,立刻就看到了竹竿的影子。词意比喻行事能马上看到效果或付出能马上得到收获。常与“效应搭配。@",
    
    
    "束之高阁@捆起来以后放在高高的架子上,比愉放看着不用、丢在一旁不管,也比喻把桌事或桌种主张、意见、建议等搁置起来,不予理躲和办理,@@6",
    "阳春白雪@原指战国时代楚国的较高雅的歌曲后比喻高深的不通俗的文学艺术@",
    "漠然置之@很冷淡地把它搁在一边。指对人或事态度冷淡,放在一边不理。@",
    "置之脑后@放在一边不再想起。形容极不重视。@",
    "改头换面@指人的容貌发生了改变。现多比喻只改外表和形式,内容实质不变。@",
    "弃如敝屣@敝：破日。屣：鞋子。像抛弃破鞋子一样扔掉。比喻毫不可惜地抛弃掉。@",
    "与世隔绝@指与文明社会上的人们隔离,断绝来往；形容隐居或人迹罕至的极偏僻地方。@",
    
    
    "俯拾皆是@只要低下头来捡取,到处都是,形容多而易得,对象一般食物。@@6",
    "不计其数@是没办法计算数目,形容极多@",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。「近司空见惯。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@",
    "多如生毛@像牛身上的毛那样多：形容极多。@",
    
    
    "哗众取宠@用言论行动迎合众人,以博得好感或拥护。@@6",
    "鱼目混珠@拿鱼眼睛冒充珍珠。比喻拿假的冒充真的,感情消极。@",
    "鱼龙混杂@意思是形容好人和坏人混在一起。@",
    "泥沙俱下@指在江河的急流中泥土和沙子随着水一起冲下。比好坏性质不同的人或者事物混杂在一起。@",
    "五花八门@比喻事物繁多,变化莫测,体现出变化之意。@",
    "杂乱无章@形容乱七八糟,没有条理。@",
    "断章取义@指不顾全篇文章或谈话的内容,只根据需要孤立地取其中一段或一句的意思,@",
    
    
    "心不在焉@思想、精神不集中@@6",
    "心猿意马@比喻人的心思流荡散乱,如猿马难以控制。@",
    "不求甚解@只求懂得大概,不求深入了解@",
    "味同嚼蜡@像吃蜡一样,没有一点儿味。形容语言或文章枯燥无味。@",
    "兴味索然@索然：没兴致的样子。形容一点兴趣也没有。也作“兴致索然”。@",
    "心神不定@指心里烦躁,精神不安。@",
    "心驰神往@形容思想集中在追求和向往的事情或地方上,一心向往。@",
    
    
    "蔚为大观@形容丰富多彩的景色；雄伟的景象。形容事物美好而繁多,给人一种盛大的印象。多指文物、盛大的景象等。@@6",
    "汗牛充栋@指用生运书,要累得出汗：用屋子放书,要放满整个屋子。形容藏书很多。@",
    "蔚然成风@事物盛极一时,成为风气(多指好的)。@",
    "高山仰止@意思是比喻高尚的品德。比喻对高尚的品德的仰幕。@",
    "风靡一时@形容一个事物在一个时期非常盛行像风吹倒草木一样。@",
    "脱颖而出@比喻有才能的人得到机会,即本领全部显现出来。基本身结构为偏正式,在句子中可充当谓语、宾语、定语,含义。@",
    "应运而生@由于某件事衍生新事物,必然性。@",
    
    
    "敬而远之@表示尊敬却有所顾虑不愿接近。@@6",
    "深恶痛绝@指对某人或对某事物厌恶、痛恨到极点,指痛恨的思想感情。@",
    "望而生畏@意思是一见之下就产生了畏惧心理形容人态度威严或事务艰难令人畏惧@",
    "爱屋及乌@指因为爱一个人而连带爱他屋上的乌鸦,比喻爱一个人而连带地关心到与他有关的人或物;@",
    "不屑一顾@意思是认为不值得一看。形容极端轻视。@",
    "心猿意马@比喻人的心思流荡散乱,如猿马难以控制。@",
    "审时度势@仔细研究并估计时势的特点和变化。@",
    
    
    "感同身受@原意是心里很感激,现在多指就像自己亲身领受到一样。@@6",
    "设身处地@意思是设想自己处在别人的境地。指站在别人的处境替别人看想。@",
    "由己及人@用自已的心意去推想别人的心意,指设身处地替别人看想。@",
    "将心比心@设身处地地为别人着想@",
    "情真意切@指情意十分真切@",
    "细致入微@比喻看问题非常全面。对人体贴关心无微不至。@",
    "惺惺相惜@指性格、志趣、境遇相同的人互相爱护、同情、支持。@",
    
    
    "柳暗花明@形容柳树成荫,繁花似锦的春天景象,比喻在曲折艰辛之后,忽然绝处逢生,另有一崔情景；在句中可充当作定语、宾语；含褒义。@@6",
    "豁然开朗@指由狭窄幽暗突然变得宽明亮的样子。比喻突然领悟了一人道理,@",
    "喜出望外@指因遇到意外的喜事,心中非常高兴。@",
    "别开生面@比喻另外开创新的风格、形势或局面。突出“生面”,表示为新的局面或形式,适用较为广泛。@",
    "薪尽火传@柴虽燃尽,火种仍能留传。比喻思想体系、学问或技艺代代相传。@",
    "重振旗鼓@比喻失败后,重新整顿再起。@",
    "涅槃重生@凤凰经历烈火的煎熬和痛苦的考验获得重生,并在重生中达到升华。@",
    
    
    "支离破碎@意思是形容事物零散破碎,不成整体@@6",
    "面目全非@指面孔变得完全不是原来的样子,也形容事物变化很大。多为贬义。@",
    "元气大伤@本源之气(身体内部)受到严重的伤害,难以复原。比喻人或国家、社会团体的生命力受到了致命的打击。@",
    "体无完肤@全身的皮肤没有一块好的。形容遍体都是伤。也比喻理由全部被驳倒,或被批评、责骂得很厉害。@",
    "不伦不类@指的是不像这一类,也不像那一类形容不正派或不规范,也指将互不相关的事物掌来作比拟。在句子中一般做谓语、定语、补语,是一个贬义词@",
    "名存实亡@意思是名义上还存在,实际上已消亡。@",
    "艰深晦涩@寓意难以理解的文章。@",
    
    
    "归根结底@是归结到根本上。@@6",
    "重中之重@喻一件事是在一些重要的事中最重要的,形容这件事十分重要。@",
    "首当其冲@比喻最先受到攻击或遇到灾难@",
    "千方百计@释义是想尽种种办法；用出种种计谋。@",
    "追根溯源@指追溯事物发生的根源。@",
    "说千道万@道：说。指各种各样的说法。后用来形容话说的很多。亦作“说一干道一方”。@",
    "千头万绪@比喻事情的开端,头绪非常多。也形容事情复杂纷乱@",
    
    
    "适可而止@指做到适当程度就停下来,不要过头；常用于比喻做事恰到好处。含义；在句中一般作谓语、宾语。@@6",
    "恰如其分@一指说话办事不过分；二指办事或说话十分恰当合适@",
    "适逢其时@恰巧碰上那个机会或时机。@",
    "及锋而试@原义是趁著军队士气旺盛时使用军队,原指乘士气高涨的时候使用军队,后比喻乘有利的时机行动。@",
    "因人而异@意思是因人的不同而有所差异@",
    "张弛有道@比喻治国要宽严相济。@",
    "循序渐进@指按照一定的步骤或程序逐渐推进或提高,常用于学习、工作中以及处理事情时,含堡义。@",
    
    
    "猝不及防@形容事情来得突然,来不及防备,@@6",
    "出其不意@指在别人意想不到的时候行动。后泛指出乎对方的意料之外@",
    "措手不及@指事情突然出意外,一时无法对付。@",
    "突如其来@意思是出乎意料地突然发生。@",
    "惊天动地@使天地惊动。形容某个事件的声势或意义极大。@",
    "惊涛拍崖@惊涛骇浪猛烈地拍打着对岸。@",
    "防不胜防@形容想防备但防备不过来。@",
    
    
    "邯郸学步@比愉一味地模仿别人,不仅没学到本事,反而把原来的本事也去了。@@6",
    "亦步亦趋@指学生紧紧追随老师：比喻没有主见,处处追随模仿的意思。含贬义@",
    "刻丹求剑@一般比喻死守教条,拘泥成法,固执不变通的人。在句子中多作谓语、定语或状语,多含义。@",
    "买椟还珠@指买了装了珍珠的木匣退还了珍珠：比喻取舍不当,次要的东西比主要的还要好。在句中作谓语、宾语、定语；@",
    "如法炮制@(炮：烘、炒制中药的一种方法)指依照成法,制作中药；比喻照现成样子办事。在句中一般作谓语、定语、状语。@",
    "生搬硬套@指不顾实际情况,机械地运用别人的经验,照抄别人的办法。@",
    "傍人门户@傍：依傍,依靠。比喻不能自立,依附于他人。@",
    
    
    "一板一眼@比愉行为有条理,合规矩,不马虎。「近1一丝不苟。[反]］敷衍了事。@@6",
    "循规蹈矩@指拘泥于旧的准则,不敢稍做变通@",
    "原汁原味@释义食物原有的味道和汤汁。比喻事物本来的,没有受到外来影响的风格,特性等,@",
    "原封不动@意思是指原来贴的封口没有动过。比愉保持原来的样子,一点不加变动。@",
    "一字不差@是一个字也没有更改的意思@",
    "一劳永逸@辛苦一次,把事情办好,以后就可以不再费力了。@",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易。@",
    
    
    "无懈可击@意思是没有可以被人攻击或挑剔的缝隙,形容非常严密。@@6",
    "尽善尽美@意思是指极其完善,极其美好：形容事物完美到没有一点缺点,也作“尽美尽善”。在句中作谓语、宾语、定语@",
    "毋庸置疑@事实明显或理由充分,根本就没有怀疑的余地。@",
    "无可非议@没有什么可以指责的,表示言行合乎情理。可用来形容人、事、思想、行动、品质等。@",
    "天衣无缝@比喻事物没有一点儿破绽。【反]破绽百出。@",
    "自圆其说@是指使自己的说法前后一致,没有自相矛盾的地方。@",
    "无可争辩@意思是指没有什么可争辩的；表示确信无疑。@",
    
    
    "推心置腹@原义是把赤诚的心交给人家,比愉真心诚意的待人；含褒义。@@6",
    "开诚布公@诚意待人,坦白无私。@",
    "毫不犹豫@形容人在处理事情上非常果断,没有片刻迟疑。@",
    "光明磊落@偏重指人的精神品质,指胸襟坦荡@",
    "肝胆相照@比喻真心诚意、以真心相见、互相坦诚交往共事。@",
    "坦怀相待@比喻以至诚待人肝胆相照肝与胆关系密切,互相照应。比喻互相之间坦诚交往共事所特知已肝胆相照.临书不婵倾倒。@",
    "和风细雨@比耐心地和颜悦色地批评或劝说@",
    
    
    "千丝万缕@形容一根又一根,数也数不清。现多形容相互之间种种密切而复杂的联系。@@6",
    "千头万绪@比喻事情的开端,头绪非常多。也形容事情复杂纷乱。@",
    "唇齿相依@思是嘴唇和牙齿互相依靠。比喻双方关系密切,相互依存@",
    "密不可分@形容十分紧密,不可分割。@",
    "盘根错节@原义是树木根干盘曲,枝节交错。比喻事物的关系错综复杂,很难处理。该成语在句中多作谓语、定语,也作状语、补语。也说“错节盘根”。@",
    "如影随形@指的是好像影子老是跟着身体。比喻两人事物关系密切或两人关系密切不能分离。@",
    "不可替代@指某人或某物是不能够用他人或他物来进行代替的,@",
    
    
    "阳春白雪@原指战国时代楚国的较高雅的歌曲,后比喻高深的不通俗的文学艺术。@@6",
    "曲高和寡@比喻言论或作品不通俗,能了解的人很少,用于消极语气。@",
    "孤芳自赏@指自命清高,自我欣赏的人。也指脱离群众,自以为了不起@",
    "束之高阁@捆起来以后放在高高的架子上,比放看不用、丢在一旁不管,也比把某事或某种主张、意见、建议等搁置起来,不予理踩和办理。@",
    "标新立异@故意提出新奇的见解,表示自己与众不同,看重体现在显示特点。@",
    "盛气凌人@原义是以骄横的气势压人：形容傲慢自大,气势逼人；在句子中可充当谓语、宾语、定语、状语：含贬义@",
    "完美无缺@完善美好,没有缺点。@",
    
    
    "登峰造极@重登上质峰,指到达最高点：比愉学问、技艺等已达到最高的境界。@@6",
    "炉火纯青@比喻功夫达到了纯熟完美的境界,不仅可形容技艺等,还可用在学术修养方面@",
    "叹为观止@用来赞叹所见的事物尽善尽美,好到了极点。@",
    "白璧无瑕@原义是洁白的美玉上面没有一点小斑,比喻人或事物十全十美@",
    "挥洒自如@写文章、写字或绘画得心应手,随意运笔,不受拘束。@",
    "目无全牛@眼中没有完整的牛,只有牛的筋骨结构。形容技艺达到极纯熟的境界。@",
    "登堂入室@登上厅堂,进入内室。比喻学问或技能从浅到深,达到很高的水平。@",
    
    
    "不可多得@形容非常稀少,很难得到(多指人才或稀有物品)。@@6",
    "难能可贵@做到了难做之事,十分可贵。@",
    "不可或缺@不可缺少,引申为非常重要。@",
    "绝无仅有@意思是只有一个,再没有别的。形容非常少有。@",
    "得天独厚@具有特殊优越的条件。多指人的资质或自然环境而言。@",
    "稀松平常@很平常,没什么特别的,对某事的发生毫不奇怪。@",
    "信手粘来@随手拿来。多形容写文章时词汇或材料丰富,不费思索,就能写出来,@",
    
    
    "绘声绘色@指以可见或可理解的形式来描绘或概括。形容描写或叙述一段事情很逼真。@@6",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真生动形象。@",
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作“活龙活现”。@",
    "有声有色@既有声音,又有色彩。形容说话、写作或表演等十分具体形象,精彩动人。@",
    "呼之欲出@叫一声就像会出来似的。形容画像十分逼真。兼语式；作谓语、定语,@",
    "能言善辩@能：善于。善于言谈和辩论。形容口才好。@",
    "口若悬河@意为说话滔滔不绝,形容口才好。@",
    
    
    "急于求成@形容急看要取得成功@@6",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。又指文章言论的肤浅,无真知实学。@",
    "急功近利@指急于追求成效,贪图眼前利益。含贬义；@",
    "走马观花@现比喻观察事物不深,常与风景、旅行等搭配。@",
    "白往黑归@比喻只看表面不看本质@",
    "分庭抗礼@客人与主人分立在庭的两侧,以平等的地位相对行礼。后用来比喻彼此地位或势力相等平起平坐或互相对立。该成语在句中多作谓语,也作定语。@",
    "投闲置散@指不被重视或不被任用。@",
    
    
    "多姿多彩@指丰富多彩,形容颜色形态多种多样,@@6",
    "琳琅满目@喻眼前到处充满了美好的事物@",
    "五光士色@形容色泽艳丽,花样繁多。[近］五彩缤纷。@",
    "绵延不绝@连续不断,一直延续,形容相同的自然景观一个接一个不间断地出现。@",
    "源远流长@河流的源头很远,水流很长。常比喻历史悠久,根底深厚。@",
    "千姿百态@形容姿态多种多样或种类十分丰富。@",
    "美不胜收@美好的东西很多,一时看不过来。@",
    
    
    "相提并论@把不同的人或不同的事物混在一起谈论或看待,侧重强调共同谈论的事物差别大或不同。@@6",
    "等量齐观@指对有差别的事物同等看待。@",
    "同日而语@放在同一时间谈论,指相提并论。@",
    "混为一谈@把本质不同的事物混在一起,当作同样的事物谈论。@",
    "同舟共济@侧重在困境中同心协力,共同度过难关；多含复义。@",
    "一视同仁@表示对人同等看待,不分厚薄。@",
    "衡短论长@比较、评定事物的优劣。@",
    
    
    "发扬光大@意思是使好的作风、传统等得到发展@@6",
    "深入人心@意思是指理论、学说、政策等为人们深切了解和信服。@",
    "画龙点睛@比喻写文章或讲进话时,在关键处用几句话点明实质,使内容更加生动有力。该成语在句中一般充当作谓语、定语、状语；含侵义。@",
    "锦上添花@指在有彩色花纹的丝织品上再绣上花朵。比喻美上加美,喜上加喜。在句中作谓语、宾语、补语；含复义。@",
    "拾遗补缺@捡取遗漏,弥补缺失。@",
    "家喻户晓@家家户户都知道。形容人所共知,侧重流传的广。@",
    "博大精深@形容思想和学术广博高深。多用于形容理论、学识、思想、作品等广博丰富,深奥精微其形容对象多为某某内容。@",
    
    
    "鬼斧神工@是像是鬼神制作出来的。一般形容建筑、雕塑等的技艺精巧。(固定搭配)'鬼斧神工'形容艺术技巧高超,不像是人力所能达到的,与大自然为固定搭配。@@6",
    "匠心独运@独创性地运用精巧的心思,强调在文学、艺术等方面。@",
    "天造地设@事物自然形成,合平理想,不必再加工。@",
    "巧夺天工@形容人的精巧胜过天然,比喻技艺高超巧妙。@",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真生动形象。@",
    "妙笔生花@比喻出众的写作才能。也作'生花妙笔'。@",
    "入木二分@形容书法笔力刚劲有力,也比喻对文章或事物见解深刻、透彻。其本身结构为偏正式,在句子中可作谓语、定语、状语、补语。@",
    
    
    "销声匿迹@不再公开讲话,不再出头露面,形容隐藏起来不出声不露面。不可作“消声匿迹”。@@6",
    "形同虚设@形式上虽有,却不起作用@",
    "无影无踪@没有一点踪影。形容完全消失,不知去向。@",
    "烟消云散@像烟云消散一样。比喻事物消失得干干净净。@",
    "迎刃而解@指竹子劈开口后,下面一段竹子就迎看刀刃裂开；比喻处理事情,解决问题非常顺利。含义；在句中一般作谓语、定语、宾语@",
    "荡然无存@形容东西完全失去,一点没有留下。@",
    "不名一钱@指一个钱也没有：形容贫穷到了极点。@",
    
    
    "轻描淡写@原指描绘时用浅淡的颜色轻轻地看笔,现多指说话与文章把重要问题轻轻带过,不加重视,也比愉做事不费力。@@6",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。文指文章言论的肤浅,无真知实学。@",
    "语焉不详@指虽然提到了,但说得不详细@",
    "穿凿附会@是把讲不通的或不相于的道理、事情硬扯在一起进行解释@",
    "浅尝辄止@略微尝试一下就停下来,重点强调研究/学习不钻研。偏重于浅,不深入。@",
    "意犹未尽@形容一些小型活动的感想,比如旅行、读书、吃饭等,形容该活动给人的感觉很好,结束之后还没有尽兴。@",
    "囫囵吞枣@原指把枣整个咽下去,不加咀嚼,不辨滋味；比喻对事物不加分析思考。含义@",
    
    
    "一鼓作气@指作战开始时鼓足剪气。现在比劲头大时,一口气完成。@@6",
    "一气呵成@①形容文章的气势首尾贯通。②形容完成整个工作的过程中不间断,不松解@",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易,@",
    "文不加点@文章一气呵成,无须修改。形容文思敏捷,写作技巧纯熟。含褒义。@",
    "一步到位@形容办事情讲究于净利落,不拖泥带水,一下子就做到事情所要求的结果,达到极高的境界和某种程度@",
    "趁热打铁@比喻做事抓紧时机,加速进行。[近]一鼓作气。@",
    "连成一气@比喻站在同一阵线,互通声息,互相回护@",
    
    
    "胸有成竹@指画竹前竹子的完美形象已在胸中；比喻处理事情之前已有完整的谋划打算；在句中一般作谓语、定语、状语。@@6",
    "毫无顾忌@对违反道德的行为丝毫没有反感或犹豫,或不考虑对人对事情的利害关系,没有顾虑。@",
    "大言不惭@衡：差愧。说大话不感到羞愧@",
    "疾言厉色@意思是说话急躁,脸色严厉。形容对人发怒说话时的神情@",
    "卓有成效@有卓著的成绩和效果@",
    "立竿见影@指在阳光下竖起竹竿,立刻就看到了竹竿的影子。词意比喻行能马上看到效果或付出能马上得到收获。常与效应搭配@",
    "行之有效@意思是实行起来有成效；指某种方法或措施已经实行过,证明很有效用@",
    
    
    "荒诞不经@意思是少有的,荒唐,不可信之意。形容虚离奇,不合情理@@6",
    "光怪陆离@形容奇形怪状,五颜六色。@",
    "天方夜谭@比喻虚诞、离奇的言论@",
    "异想天开@比喻荒唐离奇,想象着暂时无法实现的事,还比喻超强的想象力。@",
    "无稽之谈@毫无根据的说法。@",
    "子虚乌有@表示为假设而非实有的事物,含贬义,在句子中可充当谓语、定语。@",
    "一纸空文@只是写在纸上没有兑现或不能兑现的东西。@",
    
    
    "登堂入室@登上厅堂,进入内室。比学问或技能从浅到深达到很高的水平。@@6",
    "升堂入室@本义是先进门,次升堂,后入室,后比喻学习所达到的境地有程度深浅的差别,多用以赞扬人在学问或技能方面有高深的造：含爆义@",
    "捷足先登@原义是脚步快捷者最先登上高峰,比愉行事捷速能先人一步获得所求：在句子中可充当谓语、定语@",
    "繁荣昌盛@指国家兴旺发达,欣欣向荣。@",
    "一步登天@一步跨上青天,比喻一下子就达到很高的境界或程度,有时也用来比喻人突然得志,爬上高位。@",
    "后来居上@原指资历浅的反而位在资历长的之上；现在多用来比愉后来的人和事,进步很快,赶上或超过了先前的：主谓式结构；在句中一般作谓语、定语。@",
    "反客为主@指客人反过来成为主人。比喻变被动@",
    
    
    "多如牛毛@像牛身上的毛那样多：形容极多。@@6",
    "如数家珍@好像在数自已家里的珍宝一样。通常用来形容某人对所讲的事情十分熟悉@",
    "汗牛充栋@指用牛运书,生要累得出汗：用屋子放书,要放满整个屋子。形容藏书很多@",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面语@",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。「近司空见惯。@",
    "俯拾皆是@只要低下头来捡取,到处都是,形容多而易得,对象一般食物。@",
    
    
    "言之凿凿@)形容说话有真凭实据,而不是空泛的用语,@@6",
    "盖棺定论@指一个人的是非功过到死后才能做出结论。同“盖棺论定”。@",
    "铁证如山@形容证据确凿,象山一样不能动摇。@",
    "无口厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非。@",
    "规行矩步@指严格按照规矩办事,毫不苟且；也指办事死板,不灵活@",
    "有章可循@有章法可以依照。@",
    "按图索骥@按照图像寻找好马,比喻按线索寻找,也比喻办事机械、死板@",
    
    
    "锋芒毕露@锐气和才华全都显露出来。多指人好表现自己,也有骄傲自负的意思。@@6",
    "崭露头角@比喻突出地显示出才能和本领@",
    "如日中天@比喻事物正发展到最兴盛的阶段。@",
    "沸反盈天@声音像水开锅一样沸腾翻滚,充满了空间。形容人声喧。@",
    "初露锋芒@比喻刚开始显示出力量或才能@",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补语；含义。@",
    "毛遂自荐@指毛遂自我推荐跟随平原君前往楚国游说。后比喻自告奋勇或自己推荐自己担负重任做事情。含复义；@",
    
    
    "难能可贵@做到了难做之事,十分可贵。@@6",
    "不可多得@形容非常稀少,很难得到(多指人才或稀有物品)。@",
    "来之不易@得到它不容易：表示财物的取得或事物的成功是不容易的。@",
    "缺一不可@少一样也不行,往往搭配多项内容。@",
    "供不应求@供应的东西不能够满足需要,@",
    "千金难买@形容某物的珍贵,不能用金钱买到。@",
    "千锤百炼@原意指铸剑需要干百次的锤打和冶炼。比喻文章多次润饰,人生历经磨炼。@",
    
    
    "继往开来@继承前人的事业,开辟未来的道路,@@6",
    "薪火相传@意思是比喻学问和技艺代代相传。@",
    "承前启后@继承前代并启发后代,多用去学习、事业等方面。@",
    "风雨兼程@形容在风雨中仍然不停地赶路,有一种不避困难勇往直前的精神；指预先约好的事情,一定按期进行。@",
    "去粗取精@除去杂质,留取精华。@",
    "洋为中用@指批判地吸收外国文化中一切有益的东西,为我所用,@",
    "推陈出新@去掉旧事物的糟,取其精华,并使它向新的方向发展,侧重强调文化的去取精。@",
    
    
    "有备无患@事先有准备,就可以避免祸惠(患惠：祸患,灾难)；在句子中一股充当谓语、定语。@@6",
    "未雨绸缪@意思是趁着天没下雨,先修房屋门窗。比喻事先做好准备工作,预防意外的事情发生重在准备,侧重已经开始做了,有具体行动@",
    "居安思危@指处在安定的环境中,也要想到可能产生的危难和祸害。仅停留在思想层面,没有具体行动。@",
    "防患未然@意思是指在祸患发生之前就加以预防,重在预防。@",
    "常备不懈@时刻准备看,从不松解。@",
    "临阵磨枪@到阵前要作战时才磨枪,比喻事到临头才做准备。@",
    "脑有成竹@指画竹前竹子的完美形象已在胸中比喻处理事情之前已有完终的谋划打算；在句中一般作谓语、定语、状语。@",
    
    
    "众口一词@所有的人都说同样的话。@@6",
    "异口同声@不同的嘴说同样的话。形容大家说的完全一致。@",
    "莫衷一是@不能判定哪个对,哪个错,侧重描述思想上。@",
    "鞭辟入里@形容做学问切实。今多形容说明问题透彻,切中要害。@",
    "如出一撤@像出自同一个车辙。比喻言论或行动完全一样。@",
    "人云亦云@别人说什么,自己也跟着说什么。形容没有主见,随声附和,含贬义色彩,通常搭配人。@",
    "大同小异@指大体相同,略有差异。@",
    
    
    "形形色色@形容事物种类繁多,各式各样@11@6",
    "五花八门@比喻事物繁多,变化莫测,体现出变化之意。@16",
    "林林总总@形容杂乱众多。形容人或事物众多,只体现“多“之意。@12",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面语。@31",
    "应有尽有@意思是应该有的都有。形容十分齐备。@5",
    "千奇白怪@十分的奇怪,形容各种各样奇怪的事物。@11",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。「近司空见惯@20",
    
    
    "坚持不懈@形容做事持之以恒,比愉有恒心,有毅力。@@6",
    "锲而不舍@比喻有恒心,有毅力；含义。@",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不解,不中断。@",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重@",
    "有条不紊@形容做事、说话有条有理,丝毫不乱@",
    "始终不渝@从开始到最后,一直不改变。也作始终不移。@",
    "一如既往@指态度或做法没有任何变化,还是像从前一样。@",
    
    
    "反复无常@是经常变化没有稳定状态,侧重体现是表现上的变化无常。@@6",
    "变幻莫测@事物变化很多不能预料,变化多端难以瑞测。@",
    "出人意料@事物的好坏、情况的变化、数量的大小等出乎人们的意料；在人们的意料之外。@",
    "不可思议@原为佛教用语,指思想言语所不能达到的境界。后来形容无法想象,很难理解,@",
    "变幻无常@变化多端,令人难以预料。@",
    "福祸无常@祸与福没有固定不变的常规。@",
    "治忽无常@治忽无常形今古无常势。必有非常人以制非常世。@",
    
    
    "添砖加瓦@原来指建房屋时给不断地添砖块加瓦片。后比做些工作,尽一点力量。@@6",
    "锦上添花@指在有彩色花纹的丝织品上再绣上花朵。比喻美上加美,喜上加喜。在句中作谓语、宾语、补语@",
    "大兴土木@大规模地盖房子。@",
    "聚沙成塔@把沙子堆成宝塔,比喻积少成多。@",
    "遮风挡雨@比喻起保护作用。@",
    "保驾护航@保护某事物能让其能正常发展。@",
    "披荆斩棘@指的是保护某事物能让其能正常发展。@",
    
    
    "出乎意料@超出人们的料想之外。@@6",
    "突如其来@意思是出乎意料地突然发生。@",
    "猝不及防@形容事情来得突然,来不及防备。@",
    "无孔不入@比喻有空子就钻,不放过任何一个机会,多指做坏事。@",
    "料想不到@想象不到。@",
    "始料不及@已经准备好了,但是面对时却发生了意料之外的事情,令人措手不及。指事势的变化发展,是起初意想不到的,没料到的。@",
    "难以想象@无法想象。@",
    
    
    "鞭辟入里@形容做学问切实。今多形容说明问题透彻,切中要害。@@6",
    "恰如其分@一指说话办事不过分：二指办事或说话十分恰当合适。@",
    "一针见血@比喻说话直截了当,切中要害。@",
    "高屋建瓴@在很高的屋顶上把水瓶单的水倒下来,比喻居高临下,势不可当。在现代汉语中指对事物把握全面,了解透彻。该成语结构为偏正式；在句中作谓语、定语。@",
    "众口一词@所有的人都说同样的话@",
    "莫衷一是@不能判定哪个对,哪个错,侧重描述思想上。@",
    "异口同声@不同的嘴说同样的话。形容大家说的完全一致。@",
    
    
    "嗤之以鼻@用鼻子声冷笑,形容对某事物或某种现象的轻。侧重强调看不上、瞧不起、体现出“视“之意。@@6",
    "不屑一顾@意思是认为不值得一看。形容极端轻视。@",
    "坚不可摧@非常坚固,不可摧毁,意志、精神力量等。@",
    "积重难返@指长期形成的不良的风俗、习惯不易改变。也指长期积累的问题不易解决。@",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@",
    "不足挂齿@表示不值得一提@",
    "颇有微词@有很多(隐嗨的)批评和不满的话语,表示对某人某事不满。@",
    
    
    "面目全非@指面孔变得完全不是原来的样子,也形容事物变化很大。多为贬义。@@5",
    "支离破碎@意思是形容事物零散破碎,不成整体。@",
    "不伦不类@指的是不像这一类,也不像那一类；形容不正派或不规范,也指将互不相关的事物拿来作比拟。在句子中一般做谓语、定语、补语,是一人贬义词@",
    "元气大伤@本源之气(身体内部)受到严重的伤害,难以复原。比喻人或国家、社会团体的生命力受到了致命的打击,@",
    "体无完肤@全身的皮肤没有一块好的。形容遍体都是伤。也比喻理由全部被驳倒,或被批评、责骂得很厉害。@",
    "脱胎换骨@道教徒认为人在苦修得道之后,就能脱下胎,换上骨。现在常用来比喻痛改前非,重新做@",
    
    
    "赏心悦自@因看到好的事物而心情欢畅@@6",
    "心旷神怡@心情愉快,精神舒畅。@",
    "美不胜收@美好的东西很多,一时看不过来。@",
    "眼花缭乱@眼睛晴看到复杂纷繁的东西而感到迷乱,常搭配“令人”。@",
    "唏嘘不已@伤心地哭泣难以自止。@",
    "大开眼界@广泛地开阔了视野,增长了见识。@",
    "美轮美奂@用于形容建筑物雄伟壮观,富丽堂皇；也用来形容雕刻或建筑艺术的精美效果。[3]在句中一般作谓语、定语,@",
    
    
    "量力而行@指按照自己能力大小去做事,在句子中可充当谓语,也作“量力而为”@@6",
    "量体裁衣@指按照身材裁剪衣服：比喻按照实际情况办事。含义；在句中一般作谓语、宾语、分句。@",
    "随机应变@随着情况的变化灵活机动地应付,形容临事能妥善变通处置。含复义。@",
    "随遇而安@指处于各种环境都能安心自在@",
    "自强不息@指自已努力上进,永不解急：形容一种积极的人生态度。含义；在句中一般作谓语、宾语、状语。@",
    "逆流而上@即逆水前进。比喻迎着困难而上@",
    "一鼓作气@指作战开始时鼓足勇气。现在比喻劲头大时,一口气完成@",
    
    
    "炙手可热@指手一靠近就觉得热；比喻气焰权势之盛。含贬义：在句中一般作谓语、定语(感情色彩)贬义@@6",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在蓬勃的发展,偏向积极方向。@",
    "家喻户晓@家家户户都知道。形容人所共知,侧重流传的广。@",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补语；含义。@",
    "应运而生@由于某件事衍生新事物,必然性。@",
    "长盛不衰@长久兴盛而不衰败,比喻长时间保持旺盛的势头。一般用来形容文化、节日、传统等。@",
    "蓬勃发展@发展的势态很迅速,很积极,很向上。@",
    
    
    "双管齐下@比喻做一件事两个方面同时进行或两种方法同时使用。在句中一股作谓语、宾语。@@6",
    "并行不悖@同时实行,互相之间不冲突。@",
    "齐头并进@多方面同时前进。多形容几件事情或几项工作同时进行。@",
    "不相上下@分不出高低、好坏、胜负。形容程度相等。@",
    "大同小异@指大体相同,略有差异。@",
    "得而兼之@得：得到：兼：兼顾；同时涉及几种事物,几入方面.也指同时占有或具有几种事物.更侧重一个事务的两个方面。@",
    "两全其美@指做一件事顾全到双方,使两方面都得到好处。@",
    
    
    "毫无二致@意思是丝毫没有什么两样,指完全一样。@@6",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同,不同之处很多。@",
    "云泥之别@像天上的云和地上的泥那样高下不同。比喻地位的高下相差极大。@",
    "异曲同工@比喻不同时代、不同人的文章、言论一样精彩,或不同的事情产生相同的效果。原意为不同的曲子有着相同的影响,同样精彩@",
    "水到渠成@比条件成熟,事情就会自然成功侧重强调条件成熟。含复义；@",
    "迥然不同@意思是形容差别很大,一点儿也不相同。@",
    "天壤之别@天和地,一极在上,一极在下。比喻差别极大。@",
    
    
    "亡羊补牢@指羊逃跑了再去修补羊圈,还不算晚。比喻出了问题以后想办法补救,免得以后继续受损失：在句子中一般作主语、谓语、宾语。@@5",
    "未雨绸缪@意思是趁着天没下雨,先修房屋门窗。比喻事先做好准备工作,预防意外的事情发生,重在准备,例重已经开始做了,有具体行动。@",
    "见招拆招@遇到什么问题就用什么方法应付的意思。@",
    "兵来将挡@比喻不管对方使用什么手段,总有相应的对付方法。也比喻对待不同情况采取不同的对策。@",
    "矫杠过正@指矫柱弯曲的东西超过了限度,使其又弯向另一边；比喻纠正事物的偏失、错误过了头,而陷入另一种偏失、错误之中。含贬义@",
    "因嘻废食@因为有人吃饭嚏死了,就想让天下人都不吃饭。后比喻要做的事情由于出了点小毛病或怕出问题就索性不去于：含贬义@",
    
    
    "粉墨登场@原指演员化妆上台演戏。现比愉坏人经过一番打扮,登上政治舞合。(感情色彩)贬义@@6",
    "横空出世@优秀的人或事物突然出现,或比喻卓尔不群。@",
    "应运而生@由于某件事衍生新事物,必然性。@",
    "初露头角@刚开始展露技艺或才能。@",
    "迫在眉睫@事情十分紧急,已到眼前@",
    "指日可待@形容不久就可以实现。@",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补语；含义。@",
    
    
    "触类旁通@指掌握了某一事物的知识或规律,进而推知同类事物的知识或规律：常用于学习方面。侧重于掌握知识和技能。@@6",
    "举一反三@举一例便能够推知其他的,侧重于理解知识。@",
    "删繁就简@意思是去掉删除繁杂部分,使它趋于简明。@",
    "出神入化@形容文学艺术或技艺高超达到了绝划的境界,还形容超脱了神通达到了自由国度的境界。@",
    "见微知著@指见到事情的苗头,就能知道它的实质和发展趋势。比喻小中见大、以小见大。@",
    "当机立断@在紧要时刻立即做出决断。@",
    "反躬自省@指回过头来检查自己的过错。含复义；在句中一般作谓语、定语、状语。@",
    
    
    "鱼目混珠@拿鱼眼睛冒充珍珠。比愉拿假的冒充真的,感情消极。@11@6",
    "鱼龙混杂@意思是形容好人和坏人混在一起@15",
    "良莠不齐@旧版只能指人,现在可以指好的坏的事物混杂在一起。@16",
    "泥沙俱下@指在江河的急流中泥土和沙子随着水一起冲下。比喻好坏性质不同的人或者事物混杂在一起。@14",
    "滥竿充数@比喻没有真才实学的人混在内行人之中,或以次充好。有时候也用来表示自谦@5",
    "稍纵即逝@稍微一放松就消失了。形容时间或机会等很容易过去。@7",
    "粗制滥造@意思是写文章或做东西马虎草率,只求数量,不顾质量。@6",
    
    
    "一败涂地@一旦失败就肝脑涂染遍地,形容惨败；后用于溃败的不可收拾。含贬义；在句中一股作谓语、定语、补语。@@6",
    "折戟沉沙@折断了的戟沉没在泥沙里。形容失败惨重。@",
    "一蹶不振@跌倒就再也爬不起来,比喻遭受一次挫折以后就再也振作不起来。@",
    "一事无成@形容毫无成就。@",
    "适得其反@恰恰得到与预期相反的结果。@",
    "事与愿违@事情的发展与愿望相反,指事情没能按照预想的方向发展,@",
    "南辕北撤@该成语比喻行动和自的正好相反。强调方向不对,一般是一个人,含贬义。@",
    
    
    "瞬息万变@指在极短的时间内变化快而多@@6",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "一日千里@形容马跑得很快,偏重于前进得快。@",
    "风起云涌@形容雄浑磅磺之势：也比喻事物迅速发展,声势浩大。@",
    "错综复杂@头绪多,情况复杂,作谓语、定语形容斗争、矛盾等。@",
    "变幻莫测@事物变化很多不能预料,变化多端难以瑞测。@",
    "白驹过隙@原义是像白色的骏马在缝隙前飞快地越过,比喻时间过得很快,光阴易逝；在句子中可充当宾语。@",
    
    
    "包罗万象@形容内容丰富,无所不有。@11@6",
    "汗牛充栋@指用牛运书,牛要累得出汗：用屋子放书,要放满整个屋子。形容藏书很多。@18",
    "死而不僵@即使死了也不僵硬。形容坏势力等不容易被清除。@1",
    "一成不变@一经形成,不再改变,常用在否定句中。@22",
    "老而常新@指事物或者话题已经存在时间很长.依旧经常被提及和讨论,@1",
    "一网打尽@全部捉在网中,一个也不漏；比喻一个不漏的全部浙住或彻底清剿。@2",
    "贯通古今@形容学识渊博的人。@1",
    
    
    "生生不息@指不断地生长、繁殖@@6",
    "薪火相传@意思是比喻学问和技艺代代相传。@",
    "生机勃勃@形容生命力旺盛的样子。@",
    "源源不断@形容接连不断、连绵不绝。多用于事物,而少用于人。@",
    "蒸蒸日上@意为一天天地向上发展。形容发展速度快。多指生活和生意。@",
    "一脉相承@从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系,@",
    "周而复始@转了一圈又一圈,不断循环,从起点开始又回到起点,不断重复。@",
    
    
    "夜郎自大@原指国土很小的夜郎国土自以为大,比愉人不自量力,妄自尊大；在句中作谓语、定语,含贬义。@@6",
    "因循守旧@死守老一套,缺乏创新的精神@",
    "目空一切@形容妄自尊大,一切都不放在眼里。@",
    "自暴自弃@自已甘心落后,不求上进。@",
    "妄自菲薄@过分看轻自己,形容自卑,含贬义。@",
    "谨小慎微@意思是过分小心谨慎,缩手缩脚,不敢放手去做。@",
    "裹足不前@停步不前,好像脚被缠住了一样,比愉有所顾忌,不愿去做；在句子中可充当谓语、定语、状语。@",
    
    
    "异彩纷呈@比愉突出的成就或表现。@11@6",
    "百花齐放@形容百花盛开,丰富多彩。比喻各种不同形式和风格的艺术自由发展。也形容艺术界的繁荣景象。@4",
    "源远流长@河流的源头很远,水流很长。常比喻历史悠久,根底深厚。@20",
    "美轮美奂@用于形容建筑物雄伟壮观,富丽堂皇,也用来形容雕刻或建筑艺术的精美效果。「31在句中一般作谓语、定语。@12",
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@22",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@28",
    "别具一格@意思是比喻另有一种独特的风格,形容别致、新颖的样子,多用于艺术创作@14",
    
    
    "风生水起@风从水面吹过,水面起波澜。形容事情做得有生气,蓬勃兴旺。@@6",
    "声名鹊起@形容名声突然大振,知名度迅速提高。@",
    "刻不容缓@指形势紧迫,一刻也不允许拖延@",
    "势在必行@不能躲开或回避；从事情发展的趋势看,必须采取行动@",
    "众望所归@用于形容某人威望很高,受到大家敬仰和信赖。@",
    "势不可挡@指来势迅猛,不可抵挡。@",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    
    
    "不可替代@指某人或某物是不能够用他人或他物来进行代替的。@@6",
    "独一无二@没有相同的或没有可以相比的,形容十分稀少。@",
    "无与伦比@意思是指事物非常完美,没有能够与它相比的同类的东西。@",
    "必不可少@是绝对需要的或者不达到某种目的就不能做成某种事情的意思。近义词为不可或缺和至关重要。@",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举足：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "独具一格@拥有与众不同的风格,重点突出“格”,风格、样式与众不同,一般用于文艺创作和某些事物。@",
    "众所周知@意思是大家都知道的,侧重于普遍性。@",
    
    
    "一意孤行@不听劝告,固执地照自己的意思行事。「反】从善如流。@@6",
    "穷途末路@形容面临绝境,无路可走。@",
    "固执己见@顽固地坚持自己的意见,不肯改变@",
    "不知悔改@不知道悔过改正。@",
    "怙恶不悛@指坚持作恶,不肯悔改。含贬义：在句中一般作宾语。@",
    "泥足深陷@解释是脚深深陷入淤泥里,比喻陷入麻烦的境地却无法轻易脱离或陷于某件事(通常为不好的事)已不能自拨。@",
    "闭门造车@关上门造车,比喻只凭主观办事,不管客观实际。@",
    
    
    "生搬硬套@指不顾实际情况,机械地运用别人的经验,照抄别人的办法。@@6",
    "亦步亦趋@指学生紧紧追随老师：比喻没有主见,处处追随模仿的意思。含贬义@",
    "削足适履@指把脚削去一块来凑合鞋的大小；比不合理地迁就合或不顾具体条件,生搬硬套。含贬义；@",
    "囫囵吞枣@原指把枣整个咽下去,不加咀嚼,不瓣滋味；比喻对事物不加分析思考。含贬义。@",
    "如法炮制@(炮：烘、炒制中药的一种方法)指依照成法,制作中药；比喻照现成样子办事。在句中一般作谓语、定语、状语。@",
    "邯郸学步@比喻一味地模仿别人,不仅没学到本事,反而把原来的本事也去了。@",
    "移花接木@指把一种花木的枝条或嫩芽嫁接在另一种花木上,比喻暗中用手段更换人或事物来欺骗别人。@",
    
    
    "不偏不倚@原指儒家的中属之道,现指不信祖任何一方。@@6",
    "不徇私情@指不曲从私人交情,比喻为人公正秉公处事。@",
    "一丝不苟@形容办事认真；连最细微的地方也不马虎。@",
    "无处不在@无论什么地方都有.形容数量之多.和存在的范围极大。@",
    "恰如其分@一指说话办事不过分：二指办事或说话十分恰当合适。@",
    "条分缕析@有条有理地细细分析。@",
    "鞭辟入里@形容做学问切实。今多形容说明问题透彻,切中要害。@",
    
    
    "顶礼膜拜@指崇拜之意。@@6",
    "奉为圭臬@比喻把某些言论或事当成自己的准则。@",
    "毕恭毕敬@形容态度十分恭敬,后来也形容十分端庄和有礼貌。含复义；在句中一般作谓语、状语、定语。@",
    "阳奉阴违@指玩弄两面派手法,表面上遵丛,暗地里违背(当众同意背后反对)。@",
    "醍醐灌顶@醍醐由生乳精制孟成.最益人体。醍酷灌顶,即将牛奶中精炼出来的乳酪浇到头上。佛家以此比灌输智慧,使人得到启发,彻底醒悟,也比喻听了高明的意见便人受到很大后发。也形容清凉舒@",
    "耳提面命@'耳提'提着耳朵叮嘱'面命'当面指教形容教海段切。多指(长辈对晚辈、上级对下级)切地教导。@",
    "肃然起敬@形容对某人或某件事产生了敬佩之@",
    
    
    "密不可分@形容十分紧密,不可分割。@@6",
    "息息相关@意思是彼此呼吸都相互关联,形容关系非常密切。@",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@",
    "休戚与共@有幸福共同享受,有祸患共同抵挡后形容关系紧密,利害相同。@",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "休戚相关@彼此的喜悦与忧愁同承担,形容彼此命运联条在一起,息息相关。@",
    "千头万绪@比喻事情的开端,头绪非常多。也形容事情复杂纷乱@",
    
    
    "浮光掠影@像水面的光和掠过的影子一样,一鼻就消逝,形容印象不深刻。又指文章言论的肤浅,无真知实学,@23@6",
    "走马观花@现比喻观察事物不深,常与风景旅行等搭配。@20",
    "浅尝辄止@略微尝试一下就停下来,重点强调研究/学习不钻研。偏重于浅,不深入。@12",
    "蜻蜓点水@蜻蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入；也形容轻轻一吻。@10",
    "轻描淡写@原指描绘时用浅淡的颜色轻轻地着笔,现多指说话写文章把重要问题轻轻带过,不加重视,也比喻做事不费力。@9",
    "囫囵吞枣@原指把枣整个咽下去,不加咀嚼,不辨滋味；比喻对事物不加分析思考。含贬义。@14",
    "言谈举止@指人的言语、举动、行为。@2",
    

    "唾手可得@指动手就可以取得,比愉极容易得到@15@6",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易。@35",
    "近在咫尺@形容距离很近。@8",
    "信手拈来@随手拿来。多形容写文章时词汇或材料丰富,不费思索,就能写出来。@13",
    "轻而易举@强调事情容易做,不费力,与时间无关。@19",
    "手到擒来@指作战一下子就能把敌人捉掌过来后比做事有把握,不费力就做好了。@4",
    "一帆风顺@比喻境遇顺利或办事容易。@1",
    
    
    "天马行空@天马奔驰神速；像是腾起在空中飞行一样。多比喻诗文气势豪放,不受拘束。多比喻人浮躁；不踏实。也有说明不切实际之意。@15@6",
    "异想天开@比喻荒唐离奇,想象着暂时无法实现的事,还比喻超强的想象力。@9",
    "不可思议@原为佛教用语,指思想言语所不能达到的境界。后来形容无法想象,很难理解。@14",
    "稍纵即逝@稍微一放松就消失了。形容时间或机会等很容易过去@7",
    "自由自在@没有拘束、安闲舒适的样子。@2",
    "标新立异@故意提出新奇的见解,表示自己与众不同,看重体现在显示特点@17",
    "无拘无束@不受任何约束,形容自由自在。@4",
    
    
    "如出一辙@像出自同一个车。比言论或行动完全一样@15@6",
    "一脉相承@从同一而统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系,@16",
    "不谋而合@强调事先没有商量过,意见或行动却完全一致,。@15",
    "大同小异@指大体相同,略有差异。@10",
    "千篇一律@比喻办事按一个格式,非常机械：泛指事物形式陈旧呆板、呆滞。@9",
    "殊途同归@比喻采取不同的方法而得到相同的结果。@11",
    "一成不变@一经形成,不再改变,常用在否定句中。@22",
    
    
    "突飞猛进@侧重强调进步、进展非常快,@@6",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "一日千里@形容马跑得很快,偏重于前进得快。@",
    "与日俱增@用于人的思想感情,指随着时间的推移而不断增长。@",
    "如日中天@比喻事物正发展到最兴盛的阶段。@",
    "江河日下@指江河的水一天天地向下流,现比喻情况一天天地坏下去。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    
    
    "竭泽而渔@指把池塘里的水抽十了捉鱼；比愉做事只顾眼前的利益,丝毫不为以后打算。含贬义；在句中一般作谓语、宾语、定语。@@6",
    "杀鸡取卵@意思是为了要得到鸡蛋,不惜把鸡杀了。比喻资图眼前利益而不顾长远利益。@",
    "饮鸩止渴@比喻用错误的办法来解决眼前的困难而制造出更严重麻烦。@",
    "不留余地@不留一点空余之地,多指言语行动没有留下回旋的地步。@",
    "愈演愈烈@意思为指事情、情况等越加恶化、严重。@",
    "参差不齐@旧版只能指人,现在可以指好的坏的事物混杂在一起。@",
    "变本加厉@意思是指比原来更加发展。现指情况变得比本来更加严重。@",
    
    
    "千头万绪@比喻事情的开端,头绪非常多。也形容事情复杂纷乱。@@6",
    "千丝万缕@形容一根又一根,数也数不清。现多形容相互之间种种密切而复杂的联系,@",
    "唇齿相依@意思是嘴唇和牙齿互相依靠。比喻双方关系密切,相互依存。@",
    "密不可分@形容十分紧密,不可分割。@",
    "追根溯源@指追溯事物发生的根源。@",
    "归根结底@是归结到根本上。@",
    "说千道万@道：说。指各种各样的说法。后用来形容话说的很多。亦作“说一千道一万”@",
    
    
    "石破天惊@使人震惊之意,也形容文章议论新奇惊人。@@6",
    "惊天动地@使天地惊动。形容某个事件的声势或意义极大。@",
    "千难万险@意思是形容困难和危险极多。@",
    "山河破碎@形容国土失陷分割,破败残缺。@",
    "有惊有险@感觉形容肉跳心惊,步步惊心@",
    "震天动地@震动了天地。形容声势浩大或气势雄伟。@",
    "震天撼地@震动了天地。形容某一事件令人惊孩。也形容声势浩大或气概雄伟,@",
    
    
    "遍地开花@比愉好的事物到处涌现或普遍发展@@6",
    "随处可见@是到处可以看见,指事情非常普通常见。@",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。「近司空见惯。@",
    "细大不捐@小的大的都不抛弃。@",
    "俯拾皆是@只要低下头来捡取,到处都是,形容多而易得,对象一股食物。@",
    
    
    "万众一心@千万人一条心,后多用来形容广大人民团结一致。该成语在句中多作谓语、定语,也作状语；含义。@@6",
    "众志成城@大家齐心协力,就像城墙一样地牢固,比喻众人团结一致,就能克服困难；在句中常用作谓语、定语；含义。@",
    "无私无畏@因为不自私而无所畏惧。作谓语、定语；指人公正。@",
    "临危不惧@面对危难,一点也不害怕。@",
    "齐心协力@指思想一致,共同努力。也作齐心合力。@",
    "聚集合力@汇聚高质量发展强大合力@",
    "凝聚共识@聚集不同的观点,通过民主协商,尊重差异、包容多样,在主要方面形成共同的认识。@",
    
    
    "呼之欲出@叫一声就像会出来似的。形容画像十分逼真。兼语式；作谓语、定语。@@6",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真,生动形象。@",
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作活龙活现。@",
    "绘声绘色@指以可见或可理解的形式来描绘或概括。形容描写或叙述一段事情很逼真。@",
    "可想而知@想：推想。可以通过推想而知道@",
    "不言而喻@指不用说就可以明日。形容道理很浅显。@",
    "有目共睹@形容人人都可以看到,极其明显。@",
    
    
    "轻车熟路@赶着装载很轻的车子走熟悉的路,比愉事情又熟悉又容易。@@6",
    "驾轻就熟@驾轻车,走熟路,比喻对事情熟悉做起来轻松便捷@",
    "信手拈来@随手拿来。多形容写文章时词汇或材料丰富,不费思索,就能写出来@",
    "一帆风顺@比喻境遇顺利或办事容易@",
    "唾手可得@指动手就可以取得,比喻极容易得到。@",
    "囫囵吞枣@原指把枣整个咽下去,不加咀嚼,不辨滋味；比喻对事物不加分析思考。含贬义。@",
    "饥不择食@不管什么都吃,比喻需要急迫,顾不得选择。@",
    
    
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@22@6",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真,生动形象。@19",
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作“活龙活现”。@12",
    "出神入化@形容文学艺术或技艺高超达到了绝的境界,还形容超脱了神通达到了自由国度的境界。@10",
    "近在咫尺@形容距离很近。@8",
    "触手可及@指近在手边,一伸手就可以接触到。形容距离极近。@6",
    "精美绝伦@精致美妙得没有东西可以比得上。@3",
    
    
    "迫在眉睫@事情十分紧急,已到眼前。@21@6",
    "刻不容缓@指形势紧迫,一刻也不允许拖延@13",
    "十万火急@形容事情紧急到了极点(多用于公文、电报等)。@4",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举足：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@30",
    "急如星火@像流星的光从空中急闪而过。形容非常急促紧迫。@3",
    "势在必行@不能躲开或回避：从事情发展的趋势看,必须采取行动。@14",
    "至关重要@相当地重要要紧关头是不可缺少,词意比举足轻重来的重。@14",
    
    
    "走马观花@现比愉观察事物不深,常与风景、旅行等搭配@20@6",
    "浮光掠影@像水面的光和掠过的影子一样,一显就消逝,形容印象不深刻。又指文章言论的肤浅无真知实学。@23",
    "晴蜓点水@蜻蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入；也形容轻轻一吻。@10",
    "浅尝辄止@略微尝试一下就停下来,重点强调研究/学习不钻研。偏重于浅,不深入。@12",
    "囫囵吞枣@原指把枣整个咽下去,不加咀嚼,不辨滋味；比喻对事物不加分析思考。含贬义。@14",
    "言谈举止@指人的言语、举动、行为。@2",
    "粗枝大叶@绘画,画树木粗枝大叶,不用工笔比喻工作粗糙,不认真细致,马虎大意。@3",
    
    
    "无与伦比@意思是指事物非常完美,没有能够与它相比的同类的东西。@20@6",
    "独一无二@没有相同的或没有可以相比的,形容十分稀少。@19",
    "独树一帜@比喻与众不同,自成一家,多含褒义,除用于艺术创作外,还可用于政治、经济等创业道路。@28",
    "无可厚非@意为不可过分指责,表示虽有缺点,但是可以理解或原谅。也说未可厚非。@22",
    "不可替代@指某人或某物是不能够用他人或他物来进行代替的。@9",
    "叹为观止@用来赞叹所见的事物尽善尽美,好到了极点。@12",
    "得天独厚@具有特殊优越的条件。多指人的资质或自然环境而言。@12",
    
    
    "源远流长@河流的源头很远,水流很长。常比愉历史悠久,根底深厚。(固定搭配)形容历史悠久,通常搭配“文化”@20@6",
    "博大精深@形容思想和学术广博高深。多用于形容理论、学识、思想、作品等广博丰富,深奥精微其形容对象多为某某内容。@17",
    "历史悠久@指记载和解释作为一系列人类进程历史事件很久远。@3",
    "异彩纷呈@比喻突出的成就或表现。@11",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@24",
    "长盛不衰@长久兴盛而不衰败.比喻长时间保持旺盛的势头。一般用来形容文化、节日、传统等@7",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在蓬勃的发展,偏向积极方向。@24",
    
    
    "惟妙惟肖@意思是形容描写或模仿得非常逼真,生动形象@19@6",
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@22",
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作“活龙活现”@12",
    "绘声绘色@指以可见或可理解的形式来描绘或概括。形容描写或叙述一段事情很逼真。@8",
    "呼之欲出@叫一声就像会出来似的。形容画像十分逼真。兼语式；作谓语、定语。@5",
    "有声有色@既有声音,又有色彩。形容说话、写作或表演等十分具体形象,精彩动人。@3",
    "妙笔生花@比喻出众的写作才能。也作生花妙笔。@4",
    
    
    "崭露头角@比喻突出地显示出才能和本领。@19@6",
    "脱颖而出@比喻有才能的人得到机会,即本领全部显现出来。其本身结构为偏正式,在句子中可充当谓语、宾语、定语,含褒义。@19",
    "锋芒毕露@锐气和才华全都显露出来。多指人好表现自己,也有骄傲自负的意思@5",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补语；含义。@12",
    "牛刀小试@是比喻有大本领的人,先在小事情上略展才能。也比喻有能力的人刚开始工作就表现出彩。@3",
    "一枝独秀@其他花都没有开放,只有这一枝在开看。比喻技高一筹,优势明显。@9",
    "出人头地@指高人一等,超出一般人；形容德才超众或成就突出比其他人优秀。含复义；在句中一般作谓语、宾语、定语@4",
    
    
    "纷至沓来@形容连续不断地到来。@19@6",
    "络绎不绝@形容行人车马来往,接连不断。@13",
    "车水马龙@车如流水,马如游龙一般,形容热匝繁华的景象。基结构为联合式,在句子中可作谓语定语。@9",
    "接踵而至@指人们前脚跟着后脚,接连不断地来,形容人接连而来或事情持续发生。@12",
    "层出不穷@比喻事物或言论接连不断地出现,尚未究尽,数量多@34",
    "源源不断@形容接连不断、连绵不绝。多用于事物,而少用于人。@10",
    "客似云来@比喻客人像云一样来得络绎不绝,生意非常兴旺。@2",
    
    
    "脱颖而出@比喻有才能的人得到机会,即本领全部显现出来。其本身结构为偏正式,在包子中可充当谓语、宾语、定语含义。@19@6",
    "崭露头角@比喻突出地显示出才能和本领。@19",
    "一鸣惊人@一叫就使人震惊。比喻平时不被人注意的人,突然做出惊人的成绩。@9",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补；含侵义。@12",
    "出类拔萃@比喻超过聚在一起的同类人或物,多用于形容才德超出众人之上的人。含優义@8",
    "出人头地@指高人一等,超出一般人：形容德才超众或成就突出比其基他人优秀。含义；在句中一般作谓语、宾语、定语@4",
    "应运而生@由于某件事衍生新事物,必然性@16",
    
    
    "亦步亦趋@指学生紧紧追随老师；比喻没有主见,处处追随模仿的意思。含贬义；@15@6",
    "如法炮制@(炮：烘、炒制中药的一种方法)指依照成法,制作中药；比喻照现成样子办事。在右中一般作谓语、定语、状语。@4",
    "邯郸学步@比喻一味地模仿别人,不仅没学到本事,反而把原来的本事也去了。@8",
    "随波逐流@自己没有立场和主见,只是随着潮流走,含贬义。@14",
    "生搬硬套@指不顾实际情况,机械地运用别人的经验,照抄别人的办法。@5",
    "按部就班@按照一定的步骤、顺序进行：也指按老规矩办事,缺乏创新精神。@18",
    "心安理得@比喻自以为做的事情合乎道理,心里很坦然。@4",
    
    
    "千姿百态@形容姿态多种多样或种类十分丰富。@15@6",
    "千变万化@比喻变化很多,在句子中一般充当谓语、定语。@11",
    "千奇百怪@十分的奇怪,形容各种各样奇怪的事物。@11",
    "姹紫嫣红@指各种色彩艳丽的花@6",
    "千娇百媚@形容女子姿态神情极为美丽动人。@3",
    "气象万千@指事物壮丽,形容景色和事物多种多样,壮丽而多变化。@4",
    "千差万别@意思是形容种类多,差别大。@7",
    
    
    "息息相关@意思是彼此呼吸都相互关联,形容关系非常密切@15@6",
    "休戚与共@有幸福共同享受,有祸患共同抵挡后形容关系紧密,利害相同。@19",
    "休戚相关@彼此的喜悦与忧愁共同承担,形容彼此命运联系在一起,息息相关。@7",
    "密不可分@形容十分紧密,不可分割。@7",
    "紧密相连@形容彼此的关系非常密切。@2",
    "一脉相承@从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系,@16",
    "不相上下@分不出高低、好坏、胜负。形容程度相等。@6",
    
    
    "迎刃而解@指竹子劈开口后,下面一段竹子就迎着刀刃裂开；比处理事情,解决问题非常顺利。含褒义；：在句中一般股作谓语、定语、宾语。(固定搭配)难题'迎刃而解'是常见搭配。@14@6",
    "不攻自破@不用攻击就自动破灭,形容情节、论点虚谬,经不起反驳、攻击。@5",
    "水到渠成@比喻条件成熟,事情就会自然成功则重强调条件成熟。含义；@25",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易@35",
    "举一反三@举一例便能够推知其他的,侧重于理解知识。@13",
    "拨云见日@比喻冲破黑暗见到光明。也比喻疑团消除,心里顿时明日。@5",
    "昭然若揭@形容真相毕露,所有一切都已显现了出来。@5",
    
    
    "耳濡目染@指经常听到看到,不知不觉地受到影响,多用于人,用于好的方面,侧重指技能方面。@14@6",
    "潜移默化@)修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化,暗示为影响看不到,无形,主体一般是事或物@27",
    "润物无声@指有大胸怀者,做了贡献而不张扬默默奉献。@11",
    "日积月累@一天一月地积累起来,形容长时间积累。[近」积少成多。@8",
    "春风化雨@指适宜草木生长的风雨,多用在人或事,比喻良好的熏陶和教育@7",
    "不知不觉@没有意识到,没有觉察到。@2",
    "耳闻眼睹@亲耳听到,亲眼看见。@4",
    
    
    "别具一格@意思是比另有一种独特的风格,形容别致、新赖的样子,多用于艺术创作。@14@6",
    "独树一帜@比喻与众不同,自成一家,多含褒义,除用于艺术创作外,还可用于政治、经济等创业道路。@28",
    "别具匠心@具有与众不同的巧妙构思,多用于写文章、绘画、工程设计等@4",
    "匠心独运@独创性地运用精巧的心思,强调在文学、艺术等方面。@8",
    "别开生面@比喻另外开创新的风格、形势或局面。突出“生面,表示为新的局面或形式,适用较为广泛。@4",
    "毫不逊色@指一点儿没有不及之处@3",
    "青出于蓝@指青从蓝草中提炼出来,但颜色比蓝更深；后比喻学生超过老师或后人胜过前人；含么义。@1",
    
    
    "泥沙俱下@指在江河的急流中泥士和沙子随着水一起冲下。比喻好坏性质不同的人或者事物混杂在一起@14@6",
    "良莠不齐@版只能指人,现在可以指好的坏的事物混杂在一起。@16",
    "鱼龙混杂@意思是形容好人和坏人混在一起。@15",
    "鱼目混珠@拿鱼眼睛冒充珍珠。比喻拿假的冒充真的,感情消极。@11",
    "参差不齐@原意是长短、高低、大小不一致,形容很不整齐或水平不一。@8",
    "杂乱无章@形容乱七八糟,没有条理。@5",
    "粗制滥造@意思是写文章或做东西马虎草率,只求数量,不顾质量@6",
    
    
    "囫囵吞枣@原指把零整人咽下去,不加咀嚼,不辨滋味；比对事物不加分析思考。含贬义。@14@6",
    "走马观花@现比喻观察事物不深,常与风景、旅行等搭配。@20",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。又指文章言论的肤浅,无真知实学。@23",
    "蜻蜓点水@蜻蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入；也形容轻轻一吻。@10",
    "生搬硬套@指不顾实际情况,机械地运用别人的经验,照抄别人的办法。@5",
    "食古不化@读书、作画一味学习古人,拘泥陈法,不善于灵活运用。指对所学的古代知识理解得不透,不善于按现在的情况来运用。@2",
    "生吞活剥@强调对别人的理论、经验、方法等生硬地接受或机械地搬用；含贬义。@2",
    
    
    "泾渭分明@泾河水清,渭河水浑,泾河的水流入渭河时,清浊不混。比喻界限清楚或是非分明。@14@6",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同,不同之处很多。@28",
    "天差地别@容两种或多种事物之间的差距很大,就像天和地之间的距离一样。@5",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义@29",
    "毫厘之差@比喻开始相差很小,结果造成很大差距。@22",
    "非此即彼@不是这一个,就是那一个,常用于表示两者之间必取其一的选择。@3",
    "迥然不同@意思是形容差别很大,一点儿也不相同。@7",
    
    
    "心旷神怡@心情愉快,精神舒畅。@@6",
    "赏心悦目@因看到好的事物而心情欢畅@",
    "沁人心脾@原指芳香凉爽的空气、饮料或花香使人感到舒适。也形容诗歌和文章优美动人,给人清新爽朗的感觉。@",
    "神清气爽@形容人头脑清醒,心情畅快@",
    "心领神会@心里知道(对方未明说的意思),一般指一方。@",
    "心荡神迷@心神摇荡。指神魂颠倒,不能自持。也作“心荡神摇”@",
    "心驰神往@形容思想集中在追求和向往的事情或地方上,一心向往。@",
    
    
    "千变万化@比喻变化很多,在句子中一般充当请语、定语,@@6",
    "千姿百态@形容姿态多种多样或种类十分丰富@",
    "千差万别@意思是形容种类多,差别大,@",
    "千奇百怪@十分的奇怪,形容各种各样奇怪的事物。@",
    "姹紫嫣红@指各种色彩艳丽的花,@",
    "千娇百媚@形容女子姿态神情极为美丽动人。@",
    "变幻莫测@事物变化很多不能预料,变化多端难以瑞测。@",
    
    
    "势不可挡@指来势迅猛,不可抵挡,@@6",
    "大势所趋@意思是整个局势发展的趋向。@",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在逢勃的发展,偏向积极方向。@",
    "势在必行@不能躲开或回避；从事情发展的趋势看,必须采取行动。@",
    "重中之重@比喻一件事是在一些重要的事中最重要的,形容这件事十分重要。@",
    "一往无前@意思是一直往前,无所阻挡。形容勇猛无畏地前进。@",
    "有目共睹@形容人人都可以看到,极其明显。@",
    
    
    "目不暇接@东西太多,眼睛看不过来。@@6",
    "眼花缭乱@眼睛看到复杂纷繁的东西而感到迷乱,常搭配“令人”@",
    "叹为观止@用来赞叹所见的事物尽善尽美,好到了极点。@",
    "琳琅满目@比喻眼前到处充满了美好的事物。@",
    "心潮澎湃@意思是心里像浪潮翻腾。形容心情十分激动,不能平静。@",
    "流连忘返@常形容对美好景致或事物的留恋。@",
    "如影随形@指的是好像影子老是跟着身体。比喻两人事物关系密切或两人人关系密切不能分离,@",
    
    
    "润物无声@指有大胸怀者,做了贡献而不张扬,默默奉献,@@6",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化,暗示为影响看不到,无形,主体一般是事或物。@",
    "春风化雨@指适宜草木生长的风雨,多用在人或事,比喻良好的熏陶和教育。@",
    "耳濡目染@指经常听到看到,不知不觉地受到影响,多用于人,用于好的方面,侧重指技能方面,@",
    "循序渐进@指按照一定的步骤或程序逐渐推进或提高,常用于学习、工作中以及处理事情时,含宴义。@",
    "万古长青@比喻崇高的精神或深厚的友谊永远不会消失。@",
    "万紫千红@形容百花齐放,色彩艳丽：多指繁盛的春色,也比喻事物丰富多彩@",
    
    
    "刻舟求剑@一般比喻死守教条,拘泥成法,固执不变通的人。在句子中多作谓语、定语或状语,多含贬义。@@6",
    "缘木求鱼@比喻行事的方向、方法不对,必将劳而无功,含贬义。@",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义。@",
    "邯郸学步@比喻一味地模仿别人,不仅没学到本事,反而把原来的本事也去了。@",
    "削足适履@指把脚削去一块来凑合鞋的大小；比不合理地迁就合或不顾具体条件,生搬硬套。含贬义；@",
    "画地为牢@在地上画一个圈当做监狱,比喻只许在指定的范围内活动。在句子中可作谓语、宾语。@",
    "闭门造车@关上门造车,比喻只凭主观办事,不管客观实际。@",
    
    
    "熟视无睹@强调看惯了却像没看见一样。形容对事物漫不经心或不重视。@@6",
    "置若罔闻@放在一边,好像没有听见似的。指不去过问或不予关心,强调不重视,不关心,侧重于听。@",
    "视而不见@指不注意,不重视,静着眼却没看见。@",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面语,@",
    "浮想联翩@意思是飘浮不定的想象,比喻连续不断。指许许多多的想象不断通现出来。多用作贬义有时也用作侵义,其体视语境而定@",
    "走马观花@现比喻观察事物不深,常与风景、旅行等搭配。@",
    "无动于衷@心里一点儿也没有触动。指对应该关心、注意的事情毫不关心,置之不理,@",
    
    
    "蜻蜓点水@蜻蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入：也形容轻轻一吻。@@6",
    "走马观花@现比喻观察事物不深,常与风景、旅行等搭配。@",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。又指文章言论的肤浅,无真知实学。@",
    "浅尝辄止@略微尝试一下就停下来,重点强调研究/学习不钻研。偏重于浅,不深入。@",
    "囫囵吞枣@原指把枣整个咽下去,不加咀嚼,不辨滋味；比喻对事物不加分析思考。含义。@",
    "下马看花@比喻停下来,深入实际,认真调查研究。@",
    "心无旁骛@意思是心中没有另外的追求。形容心思集中,专心致志。@",
    
    
    "深入浅出@指言论或文章的观点主题意义深刻,但在语言文字的表达方式上却浅显易懂。@@6",
    "条分缕析@有条有理地细细分析。@",
    "事无巨细@指事情不分大小,不分主次。形容什么事都管。@",
    "知无不言@只要知道,就没有不说出来的@",
    "大道至简@意思大道理是极其简单的,简单到一两句话就能说明日。@",
    "通俗易懂@广大人民群众都能懂得。@",
    "不愠不火@不冷淡也不火爆,形容平淡适中。@",
    
    
    "开天辟地@第一种意思是指开辟天地,艰苦创业,多形容创造了空前宏伟的事业；第二种意思是指以前从未有过,有史以来第一次。在句中作谓语、定语。@@6",
    "筚路蓝缕@指驾着简陋的柴车,穿着破烂的衣服去开辟山林道路。形容创业的艰苦,@",
    "来之不易@得到它不容易；表示财物的取得或事物的成功是不容易的。@",
    "翻天覆地@形容变化巨大而彻底,也指闹得很凶。@",
    "开拓进取@努力想办法创新向前立志有所作为。@",
    "拨云见日@拨开云雾,见到太阳。比喻黑暗已经过去,光明已经到来。也比喻误会消除,@",
    "开疆拓士@开拓疆域,扩展领土。@",
    
    
    "相映成趣@相互衬托看,显得很有趣味,很有意思,@@6",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果,@",
    "交相辉映@意指各种光亮、色彩等互相映照。多用于形容美好的景象,@",
    "旗鼓相当@指古代作战时用于指挥进退转移的军旗和战鼓数量相近；比愉双方实力或者能力不相上下。含复义；在句中一般作谓语、定语@",
    "求同存异@意思是找出共同点,保留不同意见@",
    "一脉相连@血统或派别的承继上前后接连、不曾中断。@",
    
    
    "参差不齐@原意是长短、高低、大小不一致,形容很不整齐或水平不一。@@6",
    "良莠不齐@旧版只能指人,现在可以指好的坏的事物混杂在一起@",
    "泥沙俱下@指在江河的急流中泥土和沙子随着水一起冲下。比好坏性质不同的人或者事物混杂在一起。@",
    "错落有致@形容事物的布局虽然参差不齐,但却极有情趣,使人看了有好感。@",
    "鳞次栉比@像鱼鳞和梳子齿那样有次序地排列看,多用来形容房屋或船只等排列得很密很整齐。@",
    "鱼目混珠@拿鱼眼睛冒充珍珠。比喻拿假的冒充真的,感情消极。@",
    "翻天覆地@形容变化巨大而彻底,也指闹得很凶。@",
    
    
    "无处不在@无论什么地方都有,形容数量之多,和存在的范围极大。@@6",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@",
    "不偏不倚@原指儒家的中庸之道,现指不偏祖任何一方。@",
    "不徇私情@指不曲从私人交情,比喻为人公正秉公处事@",
    "一丝不苟@形容办事认真；连最细微的地方也不马虎。@",
    "如影随形@指的是好像影子老是跟着身体。比喻两人事物关系密切或两个人关系密切不能分离,@",
    "俯拾皆是@只要低下头来捡取,到处都是,形容多而易得,对象一般食物。@",
    
    
    "肆无忌惮@指恣意妄行,毫无顾忌。@@6",
    "无所顾忌@没有什么顾虑和惧怕@",
    "为虎作伥@被老虎吃掉的人变成鬼,专门给老虎带路去吃别人。用来比喻做恶人的帮凶,@",
    "以身试法@用自己的性命去触犯法律。@",
    "群起效尤@意思是大家一起向坏的学习。@",
    "随心所欲@指随着自己的意思,想要干什么就干什么。@",
    "为鬼为蜮@像鬼域一样阴险狠毒,在暗地里害人的人。@",
    
    
    "惊天动地@使天地惊动。形容集个事件的声势或意义极大,@@6",
    "石破天惊@使人震惊之意,也形容文章议论新奇惊人。@",
    "惊涛拍崖@惊涛骇浪猛烈地拍打着对岸。@",
    "猝不及防@形容事情来得突然,来不及防备。@",
    "防不胜防@形容想防备但防备不过来。@",
    "震烁古今@为形容事业或功绩非常伟大。@",
    "天昏地暗@天地昏黑无光,形容刮大风时漫天沙土的景象,也比喻政治腐败,社会黑暗,@",
    
    
    "波澜壮阔@原形容水面辽阔,现比愉声势雄壮或规模宏大,(固定搭配)'波澜壮活'形容历史也是较为常见的固定搭配。@@6",
    "气势磅礴@形容气势雄伟壮大。@",
    "浩浩荡荡@形容人多声势广大的样子,后来形容事物的广阔壮大或前进的人流声势浩大。@",
    "沧海桑田@是大海变成农田,农田变成大海；比世事变化巨大。其本身结构为联合式,在句子中可作谓语、宾语、分句。@",
    "雄心勃勃@形容理想和抱负非常远大。@",
    "焕然一新@形容呈现出薪新的面貌。@",
    "意气风发@形容精神振奋,气概豪迈。@",
    
    
    "入木三分@形容书法笔力刚劲有力,也比愉对文章或事物见解深刻、透彻。其本身结构为偏正式,在句子中可作谓语、定语、状语、补语,含义。(固定搭配))“刻画得入木三分为常见搭配@@6",
    "浓墨重彩@用浓重的墨汁和颜色来描绘,形容着力描写。@",
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作“活龙活现”。@",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真生动形象。@",
    "妙笔生花@比喻出众的写作才能。也作'生花划笔'。@",
    "鬼斧神工@是像是鬼神制作出来的。一般形容建筑、雕塑等的技艺精巧,@",
    "不遗余力@不遗余力指把所有的力量都使出来一点也不保留。@",
    
    
    "惊心动魄@原指文辞优美,意境深远,使人感受极深,震动极大。后常形容使人惊骇紧张到极点。@@6",
    "震撼人心@指某件事对人内心震动很大。@",
    "触目惊心@看见某种严重情况而内心震惊,形容事态严重,引起轰动,也写作术自惊心@",
    "眼花缭乱@眼睛看到复杂纷繁的东西而感到迷乱常搭配“令人”@",
    "一成不变@一经形成,不再改变,常用在否定句中。@",
    "扑朔迷离@形容事物错综复杂,不容易看清真相。@",
    "不可思议@原为佛教用语,指思想言语所不能达到的境界。后来形容无法想象,很难理解。@",
    
    
    "讳莫如深@原意为事件重大,违而不言。后指把事情隐满得很紧。@@6",
    "谈虎色变@曾经被老虎伤过的人,一谈到老虎就叭得变了脸色；比喻一提及某事就非常害怕；在句子中可充当谓语、定语、状语；含贬义。@",
    "避之不及@指某一事物不招人喜欢.都怕躲闪他都有点慢了而来不及了。@",
    "望而生畏@意思是一见之下就产生了畏惧心理。形容人态度威严或事务艰难令人畏惧。@",
    "隐而不发@把事情藏在心里不说,有隐忍的意思。@",
    "秘而不宣@把知道的消息、情况隐秘起来,不告诉别人。@",
    "秘不示人@保藏起来不给人看。@",
    
    
    "专心致志@形容一心一意,精神高度集中地做事。也作专心一志@@6",
    "聚精会神@形容专心致志,注意力高度集中的样子。@",
    "心无旁骛@意思是心中没有另外的追求。形容心思集中,专心致志。@",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不懈解,不中断。@",
    "屏气凝神@形容注意力高度集中。@",
    "目不转睛@看东西时眼珠一点都不转动。形容注意力很集中,看得出神,@",
    
    
    "左支右绌@原指弯弓射箭的姿势,左手支持,右手屈曲。指力量不足,应付了这方面,那方面又出了问题。@@6",
    "捉襟见肘@指整理一下衣襟,就露出了胳膊肘形容衣服破烂,生活困；也比顾此失彼,穷于应付。@",
    "相形见绌@意为和同类的事物相比较显得不足。@",
    "爱莫能助@指虽然心中关切同情,却没有力量帮助；在句子中一般作谓语、定语,@",
    "供不应求@供应的东西不能够满足需要@",
    "山穷水尽@山和水都到了尽头,比喻无路可走陷入绝境。@",
    "危在旦夕@形容处境十分危险。侧重强调时间短,危险近在眼前。@",
    
    
    "见微知著@指见到事情的苗头,就能知道它的实质和发展趋势。比喻小中见大、以小见大。@@6",
    "大而化之@原指大行其道,使天下化之。后形容做事情不够谨慎,疏忽大意。@",
    "当机立断@在紧要时刻立即做出决断。@",
    "反躬自省@指回过头来检查自己的过错。含义；在句中一般作谓语、定语、状语。@",
    "触类旁通@指掌握了某一事物的知识或规律,进而推知同类事物的知识或规律；常用于学习方面。侧重于掌握知识和技能。@",
    "鉴往知来@根据以往的情形便知道以后怎样发生变化。@",
    "见始知终@谓看见事物的开始阶段就能预见到它的最终结果。@",
    
    
    "一视同仁@表示对人同等看待,不分厚薄@@6",
    "如出一辙@像出自同一个车辙。比喻言论或行动完全一样。@",
    "大同小异@指大体相同,略有差异。@",
    "概莫能外@一概不能超出这个范围；一概不能例外。指都在所指范围之内。@",
    "同日而语@放在同一时间谈论,指相提并论。@",
    "相提并论@把不同的人或不同的事物混在一起谈论或看待,侧重强调共同谈论的事物差别大或不同。@",
    "同舟共济@侧重在困境中同心协力,共同度过难关；多含复义。@",
    
    
    "披沙拣金@指拨开沙子来挑选金子,比从大量的东西中选取精华。@@6",
    "慧眼识珠@聪慧的双眼能识别珍珠。比喻有特别的眼力能识别人或物@",
    "大浪淘沙@意思是在大浪中洗净沙石。比喻在激烈的斗争中经受考验、筛选。@",
    "按图索骥@按照图像寻找好马,比按线索寻找,也比喻办事机械、死板。@",
    "人云亦云@别人说什么,自己也跟着说什么。形容没有主见,随声附和,含贬义色彩,通常搭配人。@",
    "短中取长@指于一般中选择比较好的。@",
    "去粗取精@除去杂质,留取精华@",
    
    
    "漫不经心@随随便便的,不放在心上。「反】专心致志@@6",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面语。@",
    "微不足道@指意义、价值等小得不值得一提。@",
    "随处可见@是到处可以看见,指事情非常普通常见。@",
    "心不在焉@思想、精神不集中。@",
    "尾大不掉@比部下势力太大,不易指挥调度或因事物轻重关系倒置,形成难以驾驭的局面,@",
    "掉以轻心@指以轻心摆弄他；形容对事情采取轻率的、漫不经心的态度。含贬义；在句中一般作谓语、宾语。@",
    
    
    "天方夜谭@比愉虚诞、离奇的言论。@@6",
    "无稽之谈@毫无根据的说法。@",
    "荒诞不经@意思是少有的,荒唐,不可信之意。形容虚妄离奇,不合情理。@",
    "鞭长莫及@指虽然鞭子很长,但总不能打到马肚子上,比喻距离太远而无能为力。@",
    "好高骛远@脱离实际地追求不可能实现的过高、过远的目标。@",
    "痴人说梦@比喻根本办不到的荒唐话。@",
    "荒谬之词@意思是极端荒唐,非常不合情理。@",
    
    
    "天花乱坠@原义是传说佛祖讲经说法,感动了天神,天上各色香花从空中纷纷落下：后用以形容说话言词巧妙,有声有色,非常动听；多指弯大而不切实际；在句子中可充当状语、补语；含贬义。@@6",
    "天衣无缝@比喻事物没有一点儿破绽。【反]破绽百出。@",
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很广,侧重知名度高@",
    "登峰造极@登上顶峰,指到达最高点；比喻学问、技艺等已达到最高的境界。@",
    "如痴如醉@形容神态失常,失去自制。@",
    "天方夜谭@比喻虚诞、离奇的言论@",
    "天马行空@天马奔驰神速：像是腾起在空中飞行一样。多比喻诗文气势豪放,不受拘束。多比喻人浮噪；不踏实。也有说明不切实际之意。@",
    
    
    "唯我独尊@形容极端自高自大,自尊大,自空一切。@@6",
    "风靡全球@形容一个事物全球范围内非常盛行,像风吹倒草木一样。@",
    "大行其道@在某范围内广为流传,盛行一时。@",
    "势不可挡@指来势迅猛,不可抵挡。@",
    "非我莫属@指除我以外不能属于任何人。@",
    "我行我素@指不受外界影响,按自己向来的行事方式去做。@",
    "舍我其谁@形容人敢于担当,遇到该做的事,绝不退让。@",
    
    
    "自怨自艾@是悔恨自己的错误,自己改止。现在只指悔恨自口的错误。@@6",
    "怨天尤人@指遇到挫折或出了问题,一味报天,责怪别人。含贬义；在句中一般作谓语、定语。@",
    "捶脑顿足@用拳敲打胸部,踏着双脚。形容非常悲痛或噢悔的样子。也作顿足捶胸。@",
    "扼腕叹息@用一只手握住另一只手的手腕,表示振奋或激惯的情绪。@",
    "后悔莫及@事后噢悔已经来不及了。也作“后悔不及”、“后无及”。@",
    "自找麻烦@自己给自己找麻烦事。@",
    "庸人自扰@指平庸的人无事生事,自找麻烦,自讨烦恼：多用于讽刺惠味或神经过敏的人；主谓式结构；含有贬义：主要用作谓语、宾语等。@",
    
    
    "争先恐后@指竞相抢先而不肯落后：多用于形容人的动作等：在句子中可充当谓语、状语；也作“恐后争先”,常与“趋之若鹜“一起连用。@@6",
    "跃跃欲试@意思是形容心里急切地想试试@",
    "蜂拥而至@像一窝蜂以地拥来,形容很多人乱哄哄地朝一个地方聚拢,@",
    "马不停蹄@马不停止地急促向前跑。比喻不间断地进行。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    "络绎不绝@形容行人车马来往,接连不断。@",
    "摩拳擦掌@形容战斗或劳动之前,人们精神振奋,跃跃欲试的样子。@",
    
    
    "委曲求全@指曲意迁就,以求事成。含煲义@@6",
    "削足适履@指把脚削去一块来凑合鞋的大小：比喻不合理地迁就凑合或不顾具体条件,生搬硬套。含贬义；@",
    "改弦更张@指换掉旧的琴弦,再安上新的。比喻去旧更新,改变制度或做法等。@",
    "心猿意马@比喻人的心思流荡散乱,如猿马难以控制。@",
    "无所适从@指不知依从谁才好,也指不知道怎么办才好；在句子中可充当谓语、宾语、定语。@",
    "生搬硬套@指不顾实际情况,机械地运用别人的经验,照抄别人的办法。@",
    "低声下气@形容说话时态度卑微恭顺的样子。@",
    
    
    "不期而遇@没有约定而遇见。指意外碰见,@@6",
    "不期而至@指事先没有约定而意外到来,没有预料的到来。这里要特别注意,该词语不带有主观感情色彩。@",
    "蜂拥而至@像一窝蜂似地拥来,形容很多人乱哄哄地朝一个地方聚拢,@",
    "近水楼台@近水楼台指靠近水边的楼台：比喻由于接近某人或者事物,而抢先得到某种利益或便利。含贬义；@",
    "摩拳擦掌@形容战斗或劳动之前,人们精神振奋,跃跃欲试的样子。@",
    "不可或缺@不可缺少,引申为非常重要@",
    "不约而同@指事先没有约定而相互一致@",
    
    
    "从容不迫@指镇定沉看,形容遇事镇定自若,不慌不忙。含褒义；在句中一股作谓语、定语、状语。@@6",
    "见多识广@形容阅历深,经验多,知识广博,一般为口语。@",
    "有备而来@参与某个事情以前,事先有充分的准备。@",
    "不露声色@心里的打算不在说话和脸色上显露出来。@",
    "不以为然@不认为是对的。@",
    "不以为意@不把它放在心上。表示对人或事抱轻视态度。@",
    "兴味索然@索然：没兴致的样子。形容一点兴趣也没有。也作“兴致索然”。@",
    
    
    "口耳相传@口说耳听地往下传授。@@6",
    "街谈巷议@意思是大街小巷里人们的议论。指民间的舆论。也是在街巷中谈说议论,形容议论纷纷@",
    "口传心授@指师徒间口头传授,内心领会。作谓语、定语、宾语。@",
    "耳熟能详@听得多了,能够很清楚、很详细地复述出来。@",
    "如数家珍@好像在数自己家里的珍宝一样。通常用来形容某人对所讲的事情十分熟悉。@",
    "红口白牙@见红口白舌同赤口白舌形容言语恶毒,出口伤人。@",
    "道听途说@指道路上听来又在道路上传播出去：比喻毫无根据的传闻。含贬义；在句中一般作谓语@",
    
    
    "过犹不及@形容事情要适得其中：在句子中可充当谓语、宾语、定语。@@6",
    "矫枉过正@指矫柱弯曲的东西超过了限度,使其又弯向另一边；比愉纠正事物的偏失、错误过了头,而陷入另一种偏失、错误之中。含贬义；@",
    "适得其反@恰恰得到与预期相反的结果@",
    "画蛇添足@比喻做了多余的事,非但无益,反而不合适,也比喻虚构事实,无中生有,多此一举。在句子中一般用作宾语；含贬义。@",
    "事与愿违@事情的发展与愿望相反,指事情没能按照预想的方向发展。@",
    "物极必反@事物发展到极端,会向相反方向转化。@",
    "适可而止@指做到适当程度就停下来,不要过头；常用于比喻做事恰到好处。含义；在句中一般作谓语、宾语。@",
    
    
    "别出心裁@表示与众不同的新观念或办法。用来形容诗文、美术、建筑等的构思设想独具一格,与众不同。@@6",
    "推陈出新@去掉旧事物的糟,取其精华,并使它向新的方向发展,侧重强调文化的去取精,@",
    "标新立异@故意提出新奇的见解,表示自己与众不同,着重体现在显示特点。@",
    "独树一帜@比喻与众不同,自成一家,多含义,除用于艺术创作外,还可用于政治、经济等创业道路。@",
    "雄心勃勃@形容理想和抱负非常远大。@",
    "引人注目@形容人或事物很具特色,引起人们的注意。@",
    "广为人知@流传很广,大家都知道@",
    
    
    "所向披靡@指力量所到之处,一切障碍全被扫除。此语常用于形容军事或体育竞技中绝无对手的常胜劲旅,@@6",
    "来势凶凶@形容事物或动作到来的气势盛大。@",
    "势如破竹@指形势如同劈竹子一样,劈开上头几节,下面节就质看力口裂开了。后比愉节节胜利毫无阻碍。@",
    "克敌制胜@)指制服敌人,取得胜利。@",
    "攻无不克@指没有攻占不下来的,形容力量无比强大；也比愉做任么事情都能成功,白战自胜,@",
    "攻坚克难@常常用来形容或鼓励人们克服各种艰难险阻,圆满的完成任务。@",
    "步步为营@是指军队每向前推进一步就设下一道营垒。形容进车谨慎。也比喻行动,办事谨慎。@",
    
    
    "一蹶不振@一跌倒就再也爬不起来,比喻遭受一次挫折以后就再也振作不起来。@@6",
    "一败涂地@一旦失败就肝脑涂染遍地,形容惨败；后用于溃败的不可收拾。含贬义；在句中一般作谓语、定语、补语。@",
    "误入歧途@指由于受煽惑而走上了错误的道路。@",
    "分崩离析@形容国家或集团四分五裂,不可收拾。@",
    "盛极而衰@一个事物如果强盛到了极点那么他离衰落的时间就不远了。@",
    "妄自菲薄@过分看轻自己,形容自卑,含贬义。@",
    "自怨自艾@是悔恨自己的错误,自己改正。现在只指悔恨自己的错误。@",
    
    
    "生机盎然@充满生机和活力的,形容生命力旺盛的样子。一般比喻花草树木生机盆然。@@6",
    "生龙活虎@像很有生气的蛟龙和富有活力的猛虎。比喻活泼矫健、生气勃勃@",
    "枝繁叶茂@繁：繁密。茂：茂盛。树木的枝叶繁密茂盛。比喻子孙满堂@",
    "繁花似锦@许多色彩纷繁的鲜花,好像富丽多彩的锦缎。形容美好的景色和美好的事物。@",
    "春色满园@整个园子里一片春天的景色。比喻到处是欣欣向荣的景象。也作“满园看色”。@",
    "千奇百态@形容姿态多种多样@",
    "奇趣蛊然@蛊然：形容气氛和趣味十分洋溢。@",
    
    
    "横空出世@优秀的人或事物突然出现,或比愉卓尔不群@@6",
    "一鸣惊人@一叫就使人震惊。比喻平时不被人注意的人,突然做出惊人的成绩。@",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补语；含义。@",
    "粉墨登场@原指演员化妆上台演戏。现比坏人经过一番打扮,登上政治舞台。@",
    "毫不逊色@指一点儿没有不及之处。@",
    "青出于蓝@指青从蓝草中提炼出来,但颜色比蓝更深；后比喻学生超过老师或后人胜过前人；含复义。@",
    "别具一格@意思是比喻另有一种独特的风格,形容别致、新颖的样子,多用于艺术创作@",
    
    
    "应有尽有@意思是应该有的都有。形容十分齐备@@6",
    "形形色色@形容事物种类繁多,各式各样。@",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@",
    "五花八门@比喻事物繁多,变化莫测,体现出“变化之意。@",
    "源源不断@形容接不断、连绵不绝。多用于事物,而少用于人@",
    "数不胜数@数都数不过来。形容数量极多,很难计算。@",
    "天造地设@事物自然形成,合乎理想,不必再加I.@",
    
    
    "不攻自破@不用攻击就自动破火,形容情节、论点虚,经不起反驳、攻击。@@6",
    "迎刃而解@指竹子劈开口后,下面一段竹子就迎看刀刃裂开；比喻处理事情,解决问题非常顺利。含侵义；在句中一股作谓语、定语、宾语。@",
    "形同虚设@形式上虽有,却不起作用,@",
    "势如破竹@指形势如同劈竹子一样,劈开上头几节,下面各节就顺看力口裂升开了。后比愉节节胜利毫无阻碍。@",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易。@",
    "烟消云散@像烟云消散一样。比喻事物消失得于干净净。@",
    "销声匿迹@不再公开讲话,不再出头露面,形容隐藏起来不出声不露面。不可作“消声匿迹”。@",
    
    
    "皓首穷经@指一直到年老头白之时还在深入钻研经书和古籍,@@6",
    "学富五车@意思是形容学问渊博@",
    "沙里淘金@从沙里淘出黄金,比喻好东西不易得,也比喻做事费力大而收效少,也比从大量的材料里选择精华。@",
    "苦心钻研@指对某件事用心,到了别人所达不到的地步。也指为寻求解决问题的办法而煞费苦心。@",
    "夙兴夜寐@早起晚睡,形容非常勤奋。@",
    "青灯黄卷@青灯,青荧的灯光。青灯黄卷比喻读书的生活。@",
    "呕心沥血@形容苦思寞想,费尽心血,为事业工作、文艺创作用心的艰苦,含义@",
    
    
    "扬汤止沸@把开水留出来再倒回去,使锅中的水暂时不沸腾比喻办法不彻底,只能暂时解救急难,不能从根本上解决问题。@@5",
    "削足适履@指把脚削去一块来凑合鞋的大小：比不合理地迁就合或不顾具体条件,生搬硬套。含贬义：@",
    "矫枉过正@指矫柱弯曲的东西超过了限度,使其又弯向另一边；比喻纠正事物的偏失、错误过了头而陷入另一种偏失、错误之中。含贬义；@",
    "舍本逐末@放弃根本的而追求枝节的,后用以比愉轻重主次颠倒,强调去掉主要的,抓住次要的。@",
    "饮鸠止渴@比喻用错误的办法来解决眼前的困难而制造出更严重麻烦。@",
    "临渴掘井@原义是到口渴时才去挖井,比喻事先没有准备,临时才想办法；在句中一般充当谓语、定语；含贬义。@",
    
    
    "深恶痛绝@指对某人或对某事物厌恶、痛恨到极点,指痛恨的思想感情。@@6",
    "敬而远之@表示尊敬却有所顾虑不愿接近@",
    "嗤之以鼻@用鼻子声冷笑,形容对某事物或桌种现象的轻麗。侧重强调看不上、瞧不起、体现出视之意。@",
    "莫衷一是@不能判定哪个对,哪个错,侧重描述思想上。@",
    "不屑一顾@意思是认为不值得一看。形容极端轻视。@",
    "避之不及@指某一事物不招人喜欢,都怕躲闪他都有点慢了而来不及了。@",
    "讳莫如深@原意为事件重大,违而不言。后指把事情隐满得很紧。@",
    
    
    "千钧一发@原义是千钧的重量系在一根头发上,形容情况极其危急。在句中一股作谓语、定语。@@6",
    "迫在眉睫@事情十分紧急,已到眼前。@",
    "雷霆万钧@形容威力极大,无法阻挡@",
    "时不我待@时间不会等待我们,指要珍惜并充分利用时间。@",
    "十万火急@形容事情紧急到了极点(多用于公文、电报等)。@",
    "千载难逢@本义是一千年也难碰到一次,后比喻机会非常难得；在句子中一般充当谓语、定语、分句；含复义。@",
    "近在咫尺@形容距离很近。@",
    
    "供不应求@供应的东西不能够满足需要1、今年以来,他们厂的产品远销国外,供不应求。@@6",
    "应运而生@由于某件事衍生新事物,必然性。@",
    "应接不暇@原形容景物繁多,来不及观赏。后多形容来人或事情太多,应付不过来@",
    "琳琅满目@比喻眼前到处充满了美好的事物,@",
    "山穷水尽@山和水都到了尽头,比喻无路可走陷入绝境。@",
    "左支右出@原指弯弓射箭的姿势,左手支持,右手屈曲。指力量不定,应付了这方面,那方面又出了问题。@",
    "危在旦夕@形容处境十分危险。侧重强调时间短,危险近在眼前。@",
    
    
    "心甘情愿@心里完全愿意,没有勉强。多指自愿做出某种牲。@@6",
    "心悦诚服@诚心诚意地服从或佩服。[近]五体投地。「反满腹狐疑。@",
    "随机应变@随着情况的变化灵活机动地应付,形容临事能妥善变通处置。含蔓义@",
    "入乡随俗@到了一个地方,就遵从那里的风俗习惯。常用以形容随遇而安。@",
    "顺势而为@做事要顺应潮流,不要逆势而行。@",
    "乐比不疲@乐于做某件事而不感觉疲倦。@",
    "毫不犹豫@形容人在处理事情上非常果断,没有片刻迟疑。@",
    
    
    "徒有虚名@空有名声,名与实不相符合：在句子中可充当作谓语、宾语、定语；含贬义。@@6",
    "好高骛远@脱离实际地追求不可能实现的过高、过远的目标。@",
    "天马行空@天马奔驰神速；像是腾起在空中飞行一样。多比喻诗文气势豪放,不受拘束。多比喻人浮躁；不踏实。也有说明不切实际之意。@",
    "不切实际@不符合现实状况或需要@",
    "藏污纳垢@污、垢：航脏的东西。比喻隐藏或包容坏人坏事。@",
    "乌烟瘴气@形容环境噜杂、秩序混乱或社会上歪风邪气盛行。@",
    "破烂肮脏@形容衣服破烂。比喻破旧。泛指破烂的衣服。@",
    
    
    "无师自通@指没有经过老师或者其他人的传授和指点帮助就能理解、摸透或者通晓某种东西,@@6",
    "独具匠心@多指技术或艺术方面有创造性@",
    "自然而然@自由发展,必然这样。指非人力干预而自然如此。@",
    "兢兢业业@形容做事小心谨慎,认真踏实,一般用在工作上。@",
    "喜出望外@指因遇到意外的喜事,心中非常高兴。@",
    "恍然大悟@对某一事物突然明白、突然醒悟@",
    "爱不释手@喜欢得舍不得放手。该成语构词方式是补充式；在句中作谓语、状语、宾语。@",
    
    
    "一知半解@形容知道得少,理解得也不深。@@6",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。又指文章言论的肤浅无真知实学。@",
    "知之甚少@对某方面知道的太少。@",
    "走马观花@现比喻观察事物不深,常与风景、旅行等搭配。@",
    "粗枝大叶@绘画,画树木粗枝大叶,不用工笔,比喻工作粗糙,不认真细致,马虎大意。@",
    "茫然不解@茫然：无所知的样子。解：理解。一无所知,不理解。@",
    "不求甚解@只求懂得大概,不求深入了解。@",
    
    
    "精挑细选@仔细的选择。@@6",
    "沙里淘金@从沙里淘出黄金,比喻好东西不易得,也比喻做事费力大而收效少,也比丛大量的材料里选择精华。@",
    "百里挑一@一百个当中就挑出这一个来。形容人才出众,不可多得。@",
    "优中选优@优秀中选优秀的。@",
    "精雕细琢@精雕细刻,比喻做事情精益求精。@",
    "精益求精@形容追求好上加好,永无止境@",
    "精妙绝伦@意思是精美巧妙到了极点。@",
    
    
    "自强不息@指自已努力上进,永不解急；形容一种积极的人生态度。含褒义；在句中一股作谓语、宾语、状语。@@6",
    "奋发有为@振作精神,有所作为。@",
    "攻坚克难@常常用来形容或鼓励人们克服各种艰难险阻,圆满的完成任务。@",
    "奋发图强@意思是振作精神,以求强盛@",
    "坚强不屈@坚韧、刚毅,毫不屈服。@",
    "生生不息@指不断地生长、繁殖。@",
    "源远流长@河流的源头很远,水流很长。常比喻历史悠久,根底深厚。@",
    
    
    "海市蜃楼@比愉实际不存在的虚无缥缈缈的事物,@@6",
    "空中楼阁@指在半空中的阁楼,比喻虚幻的事物或脱离实际的空想。该成语构词方式是偏正式；在句中作主语、宾语。@",
    "镜花水月@原指诗中灵活而不可捉摸的空灵的意境,后比喻虚幻的景象,@",
    "浮语虚辞@指大话、空话。@",
    "昙花一现@比美好的事物或景象出现了一下,很快就消失。@",
    "望梅止渴@眼望梅林,流出口水而解渴,比喻从不切实际的空想中来宽慰自己；@",
    "画饼充饥@比凭空想出来的眼前急需的事物来安慰自己；：主要作主语、谓语、宾语@",
    
    
    "得过且过@只要能够过得去,就这样过下去。形容胸无大志没有长远打算；也指做事马马虎虎,敷衍了事。含贬义。@@6",
    "坐享其成@坐着不动,享受别人的劳动成果。[近」不劳而获。【反」自食其力。@",
    "拈轻怕重@轻的,怕重的。形容工作上怕挑重担子。@",
    "苟且偷安@形容得过且过,只顾眼前的安逸,不顾将来,强调偏重眼前安逸。@",
    "自暴自弃@自己已甘心落后,不求上进。@",
    "自甘随落@不知自重自爱,甘心落后和腐败。@",
    "好逸恶劳@喜欢安逸,讨厌劳动,用来形容人生活习性懒情,图清闲安逸。@",
    
    
    "后继无人@意思是没有后人来继承前人的事业@@6",
    "难以为继@难以继续下去。@",
    "凤毛麟角@比喻难得而宝贵的人或事物@",
    "捉襟见肘@指整理一下衣襟,就露出了胳博肘形容衣服破烂,生活窘困；也比喻顾此失彼,穷于应付。@",
    "少之又少@很少很少几乎没有的意思。@",
    "寥寥无几@形容数量很少,没有几个。@",
    "后继乏人@指缺乏后人来继承前人的事业,形容事业缺少接班人。@",
    
    
    "运筹帷幄@指在帐幕中谋划军机,拟定作战策略。含褒义；在句中一般作谓语、定语。@@6",
    "殚精竭虑@形容用尽精力、费尽心思,一般偏重脑力劳动。@",
    "有条不紊@形容做事、说话有条有理,丝毫不乱@",
    "指点迷津@针对事物的困难处,提供解决的方向、办法或途径。@",
    "建言献策@陈述主张或意见,通过口头或文章提出的有益的意见,出谋划策,进献计策,@",
    "出谋划策@意思是制定计谋策略。多指为人出主意。@",
    "未雨绸缪@意思是趁天没下雨,先修鳝房屋门窗。比事先做好准备工作,预防意外的事情发生重在准备,侧重已经开始做了,有具体行动@",
    
    
    "天壤之别@指高天和平地的区别。极言差别之大。@@6",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同,不同之处很多。@",
    "相去甚远@互相之间存在很大差异和距离。@",
    "截然不同@指两种事物毫无共同之处,@",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义。@",
    "背道而驰@指尚看相反的方向奔驰；形容背离正确目标,朝反方向走,一般形容2个人。@",
    "千差万别@意思是形容种类多,差别大。@",
    
    
    "小题大做@比愉人将小事视为大事办理,有故意夸张的意思：在句子中可充当谓语、宾语：常用在否定句、反语句里；含贬义。@@6",
    "断章取义@指不顾全篇文章或谈话的内容,只根据需要孤立地取其中一段或一句的意思,@",
    "喧宾夺主@指客人的声音压倒了主人的声音。比喻外来的或次要的事物占据了原有的或主要的事物的位置。@",
    "大惊小怪@形容对没有什么了不起的事情过分惊诉。@",
    "雕虫小技@比喻微不足道的技能。多指文字技巧。@",
    "家长里短@指家庭日常生活琐事。@",
    "大材小用@大的材料用在小处。多指人事安排上不恰当,屈才。@",
    
    
    "目空一切@形容家自尊大,一切都不放在眼里@@6",
    "狂妄自大@胆大妄为,自以为是。@",
    "盛气凌人@原义是以骄横的气势压人；形容傲慢自大,气势逼人；在句子中可充当谓语、宾语、定语、状语；含贬义@",
    "仗势欺人@依仗某种权势欺压人。@",
    "颐指气使@指不说话,只用面部表情来示意。形容有权势者指挥别人时的傲慢神气。@",
    "恃才傲物@指自特才高,傲视他人；多用于形容仗着自已有才能,看不起人。含贬义@",
    "视如草芥@看作象泥土,小草一般轻贱；比喻极端轻视。@",
    
    
    "分庭抗礼@客人与主人分立在庭的两侧,以平等的地位相对行礼。后用来比喻彼此地位或势力相等,平起平坐或互相对立。该成语在句中多作谓语,也作定语。@@6",
    "分道扬镳@多比志趣、目的不同,各走各的路。@",
    "投闲置散@指不被重视或不被任用。@",
    "贪大求快@过分地贪图规模大并且要求速度快@",
    "急于求成@形容急着要取得成功。@",
    "特立独行@形容人的志行高洁,不同流俗。@",
    "自成一体@在书法、绘画等方面具有独创风格能自成体系。@",
    
    
    "无功而返@指没有任何成效而回来,@@6",
    "功亏一篑@后多用于比喻做一件事只差最后一点努力未能完成,多含婉惜之意。@",
    "知错就改@知错就改比喻人知道了错误就改正@",
    "偃旗息鼓@原意是放倒军旗,停止播鼓,秘密行军,不暴露自标。后比休战或无声无息地停止活动。[21在句中可作谓语、定语、宾语@",
    "改弦易辙@本义是乐器更换弦,车子改变道路(改弦：更换琴弦。易：改变。撤：车轮压过的痕迹,指道路)；比喻改变方向或态度。@",
    "失之交臂@形容当面错过。@",
    "错失良机@错过或失去了良好的机会。错失：错过、失去。@",
    
    
    "设身处地@意思是设想自己处在别人的境地。指站在别人的处境替别人着想。@@6",
    "感同身受@原意是心里很感激,现在多指就像自已亲身领受到一样。@",
    "身临其境@指亲身面临那种境地：也作身历其境。@",
    "由己及人@用自己的心意去推想别人的心意,指设身处地替别人看想。@",
    "将心比心@设身处地地为别人着想@",
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@",
    "如梦似幻@像是作梦幻想般。比喻极不真实的@",
    
    
    "卷土重来@人马奔跑时扬起尘土,重新猛扑过来；比喻失败之后,重新恢复势力；含贬义。@@6",
    "死灰复燃@原比喻失势的人重新得势,现常比喻崭露头角已经消失了的恶势力又重新活动起来；含贬义；在右子一般股作谓语、宾语。@",
    "跃跃欲试@意思是形容心里急切地想试试@",
    "摩拳擦掌@形容战斗或劳动之前,人们精神振奋,跃跃欲试的样子。@",
    "兴致高昂@兴趣浓厚的意思。@",
    "甚嚣尘上@原形容军中准备作战的情况。后形容议论纷纷或消息盛传。现在多指某种错误或反动言论十分墨张。@",
    "兴风作浪@原指神话小说中妖魔鬼怪施展法术起风浪。后多比喻煽动情绪,挑起事端@",
    
    
    "绵延不绝@连续不断,一直延续,形容相同的自然景观一个接一个不间断地出现。@@6",
    "源远流长@河流的源头很远,水流很长。常比喻历史悠久,根底深厚。@",
    "生生不息@指不断地生长、繁殖。@",
    "经久不息@很长时间不停止。多用于形容掌声欢呼声等。@",
    "络绎不绝@形容行人车马来往,接连不断。@",
    "沉潜深远@在水里潜伏；沉没。思想感情深沉,不外露@",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    
    
    "如火如荼@比喻军容之盛,现用来形容大规模的行动气势旺盛,气氛热烈。含褒义@18@6",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在蓬勃的发展,偏向积极方向。@24",
    "风起云涌@形容雄浑磅之势：也比喻事物迅速发展,声势浩大。@12",
    "如日中天@比喻事物正发展到最兴盛的阶段。@7",
    "此起彼伏@意思是这里起来,那里下去；形容接连不断。@15",
    "轰轰烈烈@形容事业的兴旺。也形容声势浩大气魄宏伟。@7",
    "热火朝天@形容群众性的活动情绪热烈,气氛高涨,就像炽热的火焰照天燃烧一样。@3",
    
    
    "汗牛充栋@指用牛运书,牛要累得出汗；用屋子放书,要放满整人屋子。形容藏书很多@18@6",
    "浩如烟海@形容典籍、图书等极为丰富。@13",
    "蔚为大观@形容丰富多彩的景色；雄伟的景象。形容事物美好而繁多,给人一种盈大的印象。多指文物、盛大的景象等。@5",
    "多如牛毛@像牛身上的毛那样多：形容极多。@7",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@17",
    "数不胜数@数都数不过来。形容数量极多,很难计算。@13",
    "层出不穷@比事物或言论接连不断地出现,尚未穷尽,数量多。@34",
    
    
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@17@6",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@20",
    "五花八门@比喻事物繁多,变化莫测,体现出变化之意。@16",
    "不一而足@指同类的事物不止一个而是很多,无法列举齐全。@6",
    "数不胜数@数都数不过来。形容数量极多,很难计算。@13",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。[近]］司空见惯@20",
    "不计其数@是没办法计算数目,形容极多。@9",
    
    
    "琳琅满目@比眼前到处充满了美好的事物,@17@6",
    "目不暇接@东西太多,眼睛看不过来。@11",
    "林林总总@形容杂乱众多。形容人或事物众多,只体现“多“之意。@12",
    "纷繁芜杂@形容文章内容芜杂,没有条理,或者是事情杂乱无章,没有头绪。@5",
    "美不胜收@美好的东西很多,一时看不过来。@7",
    "眼花缭乱@眼睛看到复杂纷繁的东西而感到迷乱,常搭配“令人”@17",
    "硕果累累@结的大果实非常多。比喻取得的巨大成绩相当多。@3",
    
    
    "博大精深@形容思想和学术广博高深。多用于形容理论、学识、思想、作品等广博丰富,深奥精微,其容对象多为桌某内容。@17@6",
    "源远流长@河流的源头很远,水流很长。常比喻历史悠久,根底深厚。@20",
    "丰富多彩@形容内容丰富,花色繁多。@7",
    "学富五车@意思是形容学问渊博。@4",
    "深入人心@意思是指理论、学说、政策等为人价深切了解和信服。@11",
    "长盛不衰@长久兴盛而不衰败.比喻长时间保持旺盟的势头。一般股用来形容文化、节日、传统等@7",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在蓬勃的发展,偏向积极方向。@24",
    
    
    "一脉相承@从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系。@16@6",
    "不谋而合@强调事先没有商量过,意见或行动却完全一致,。@15",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@32",
    "如出一辙@像出自同一个车撤。比言论或行动完全一样。@15",
    "异曲同工@比喻不同时代、不同人的文章、言论一样精彩,或不同的事情产生相同的效果。原意为不同的曲子有看相同的影响,同样精彩@9",
    "薪火相传@意思是比喻学问和技艺代代相传。@12",
    "息息相关@意思是彼此呼吸都相互关联,形容关系非常密切。@15",
    
    
    "良莠不齐@日版只能指人,现在可以指好的坏的事物混杂在一起。@16@6",
    "泥沙俱下@指在江河的急流中泥土和沙子随着水一起冲下。比喻好坏性质不同的人或者事物混杂在一起。@14",
    "鱼龙混杂@意思是形容好人和坏人混在一起。@15",
    "鱼目混珠@拿鱼眼睛冒充珍珠。比喻拿假的冒充真的,感情消极。@11",
    "粗制滥造@意思是写文章或做东西马虎草率,只求数量,不顾质量。@6",
    "参差不齐@原意是长短、高低、大小不一致,形容很不整齐或水平不一。@8",
    "五花八门@比喻事物繁多,变化莫测,体现出变化之意。@16",
    
    
    "五花八门@比喻事物繁多,变化莫测,体现出变化之意@16@6",
    "形形色色@形容事物种类繁多,各式各样。@11",
    "林林总总@形容杂乱众多。形容人或事物众多只体现“多“之意。@12",
    "千奇百怪@十分的奇怪,形容各种各样奇怪的事物。@11",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@17",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@20",
    "良莠不齐@旧版只能指人,现在可以指好的坏的事物混杂在一起。@16",
    
    
    "习以为常@身在其中某种事情经常去做,或某种现象经常看到,也就觉得很平常了,偏向于主观判断,夹杂有个人感情色彩,即认为这个事已经让人感到习惯,认为很止常,多用于口语。@16@6",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面语@31",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。「近司空见惯。@20",
    "见怪不怪@看到怪异的现象不要大惊小怪；指遇到不常见的事物或意外情况,要沉看镇静。该成语构词方式是主式：在句中作宾语、状。@3",
    "理所当然@道理当然是这样的,意为发生的事情本身合乎道理(非情理),不容怀疑。@27",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般股适用于较消极的语境。@24",
    "家常便饭@指家中日常的饭食,比喻极为平常的@2",
    
    
    "凤毛麟角@)比难得而宝贵的人或事物,@16@6",
    "寥寥无几@形容数量很少,没有几个。@13",
    "屈指可数@形容数目很少。【反]不计其数。@12",
    "后继无人@意思是没有后人来继承前人的事业。@5",
    "廖若星辰@稀疏@4",
    "硕果仅存@唯一留存下来的大果子：比喻由于时间的推移,留存下来仅存的人或事物,@2",
    "出类拔萃@比喻超过聚在一起的同类人或物,多用于形容才德超出众人之上的人。含侵义@8",
    
    
    "锲而不舍@比愉有恒心,有毅力；含褒义。@16@6",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不解,不中断。@20",
    "坚持不懈@形容做事持之以恒,比喻有恒心,有毅力。@8",
    "不离不弃@永远在身边,永不分离,永不抛弃。@7",
    "百舸争流@上百条船争着在水上疾驰。形容很多人都在奋勇前进。@2",
    "树高叶茂@树很高,叶子很茂盛。@1",
    "天道酬勤@上天会公平地回报付出辛劳的人。指只要辛勤地劳作,就会有所收获。@1",
    
    
    "积重难返@指长期形成的不良的风俗、习惯不易改变。也指长期积累的问题不易解决。@15@6",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@24",
    "坚不可摧@非常坚固,不可摧毁,意志、精神、力量等。@8",
    "与生俱来@一生下来就是如此。@13",
    "始终如一@指自始至终都一样,多用于形容人能坚持,做事从不间断,偏重于“始终不改变”。@9",
    "固若金汤@坚固得像金城汤池。形容防御工事非常坚固,难以攻破。@4",
    "坚如磐石@坚固得像大石头。形容非常坚固,不可动摇。@2",
    
    
    "鱼龙混杂@意思是形容好人和坏人混在一起。@15@6",
    "鱼目混珠@拿鱼眼冒充珍珠。比喻拿假的冒充真的,感情消极。@11",
    "泥沙俱下@指在江河的急流中泥土和沙子随着水一起冲下。比喻好坏性质不同的人或者事物混杂在一起。@14",
    "良莠不齐@旧版只能指人,现在可以指好的坏的事物混杂在一起。@16",
    "真假难辨@真假难以分辨清楚。@2",
    "粗制滥造@意思是写文章或做东西马虎草率,只求数量,不顾质量。@6",
    "尔虞我诈@比喻互相欺骗,互不信任。其结构为联合式,在句子中可作谓语、定语,含贬义,@2",
    
    
    "家喻户晓@家家户户都知道。形容人所共知,侧重流传的广。@15@6",
    "脍炙人口@美味人人爱吃,比喻好的诗文受到人们的称赞和传颂,描述对象通常是诗文。在句中可充当谓语、定语；含义。@12",
    "享誉全球@世界的范围里很有名气、誉满天下。形容在世界上很有名。@3",
    "世界知名@很有名气@3",
    "闻名中外@中国及外国都知道听到,形容名声传播得极远。@3",
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很厂,侧重知名度高。@10",
    "众所周知@意思是大家都知道的,侧重于普遍性。@13",
    
    
    "此起彼伏@意思是这里起来,那里下去；形容接连不断。@15@6",
    "此消彼长@不要太过于在乎此时的失去,别的方面会有长进。什么事情都有两面或者多面性。@19",
    "如火如荼@比喻军容之盛,现用来形容大规模的行动气势旺盛,气氛热烈。含义@18",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@34",
    "余音绕梁@歌唱停止后,余音好像还在屋梁上回旋,形容歌声或音乐优美,耐人回味@3",
    "刀光剑影@隐约显现出刀的闪光和剑的影子,形容环境充满了区险的气氛。@4",
    "危机四伏@四面都有埋伏,强调到处都是危险。@4",
    
    
    "与时俱进@行动和时代一起进步。@14@6",
    "推陈出新@去掉旧事物的糟,取其精华,并使它向新的方向发展,侧重强调文化的去粘取精。@24",
    "精益求精@形容追求好上加好,永无止境。@15",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@24",
    "标新立异@故意提出新奇的见解,表示自己与众不同,看重体现在显示特点。@17",
    "破旧立新@为破除旧的,建立新的,@2",
    "优胜劣汰@意思是优胜劣败。指生物在生存竞争中适应力强的保存下来,适应力差的被淘汰。@5",
    
    
    "不可思议@原为佛教用语,指思想言语所不能达到的境界。后来形容无法想象,很难理解。@14@6",
    "变幻莫测@事物变化很多不能预料,变化多端难以瑞测。@14",
    "出人意料@事物的好坏、情况的变化、数量的大小等出平人们的意料：在人们的意料之外@4",
    "反复无常@释义是经常变化没有稳定状态,侧重体现是表现上的变化无常。@5",
    "天马行空@天马奔驰神速；像是腾起在空中飞行一样。多比喻诗文气势豪放,不受拘束。多比喻人浮躁；不踏实。也有说明不切实际之意。@15",
    "有目共睹@形容人人都可以看到,极其明显。@23",
    "众所周知@意思是大家都知道的,侧重于普遍性。@13",
    
    
    "因噎废食@国因为有人吃饭噎死了,就想让天下人都不吃饭。后比愉要做的事情由于出了点小毛病或怕出问题就索性不去干；含贬义。@14@6",
    "矫枉过正@指矫杆弯曲的东西超过了限度,使其又弯向另一边；比喻纠正事物的偏失、错误过了头,而陷入另一种偏失、错误之中。含贬义@10",
    "因小失大@为了小的利益而失去大的利益@5",
    "削足适履@指把脚削去一块来凑合鞋的大小：比不合理地迁就合或不顾具体条件,生搬硬套。含贬义；@16",
    "舍本逐末@放弃根本的而追求枝节的,后用以比愉轻重主次颠倒,强调去掉主要的,抓任次要的@15",
    "因循守旧@死守老一套,缺乏创新的精神。@11",
    "缘木求鱼@比喻行事的方向、方法不对,必将劳而无功,含贬义。@21",
    
    
    "顺理成章@写文章、做事情顺看条理就能做好。比喻随看某种情况的发展而自然产生的结果(感情色彩)褒义@13@6",
    "水到渠成@比喻条件成熟,事情就会自然成功侧重强调条件成熟。含义；@25",
    "理所当然@道理当然是这样的,意为发生的事情本身合乎道理(非情理),不容怀疑。@27",
    "无可厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非。@22",
    "顺其自然@意思是顺着事物本来的性质自然发展。@6",
    "合情合理@符合情理。@7",
    "习以为常@身在其中某种事情经常去做,或某种现象经常看到,也就觉得很平常了,偏向于主观判断,夹杂有个人感情色彩,即认为这个事已经让人感到习惯,认为很正常,多用于口语@16",
    
    
    "寥寥无几@形容数量很少,没有儿个。@13@6",
    "凤毛麟角@比喻难得而宝贵的人或事物@16",
    "屈指可数@形容数目很少。【反】不计其数。@12",
    "廖若星辰@稀疏。@4",
    "差强人意@形容某人某事还不错,大体上还能使人满意。含复义；：在句中一般作谓语、定语。@6",
    "捉襟见肘@指整理一下衣襟,就露出了胳博肘形容衣服破烂,生活窘困；也比喻顾此失彼,穷于应付。@17",
    "不堪重负@承受不了繁重的负荷,不能担当重任,指在经济上或别的方面无法承受。@6",
    
    
    "刻不容缓@指形势紧迫,一刻也不充许拖延@13@6",
    "迫在眉睫@事情十分紧急,已到眼前。@21",
    "急如星火@像流星的光从空中急闪而过。形容非常急促紧迫。@3",
    "十万火急@形容事情紧急到了极点(多用于公文、电报等)。@4",
    "势在必行@不能躲开或回避；从事情发展的趋势看,必须采取行动。@14",
    "责无旁贷@强调在自己的责任不能推卸给别人。@12",
    "正当其时@恰巧碰上那个机会,时机。@3",
    
    
    "与生俱来@一生下来就是如此。@13@6",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@24",
    "积重难返@指长期形成的不良的风俗、习惯不易改变。也指长期积累的问题不易解决。@15",
    "得天独厚@具有特殊优越的条件。多指人的资质或自然环境而言。@12",
    "始终如一@指自始至终都一样,多用于形容人能坚持,做事从不间断,偏重于“始终不改变”。@9",
    "不可或缺@不可缺少,引申为非常重要。@25",
    "刻骨铭心@铭刻在心灵深处；形容记忆深刻,难以忘却。@6",
    
    
    "举一反三@举一例便能够推知其他的,侧重于理解知识@13@6",
    "触类旁通@指掌握了某一事物的知识或规律,进而推知同类事物的知识或规律；常用于学习方面。侧重于掌握知识和技能@6",
    "迎刃而解@指竹子劈开口后,下面一段竹子就迎看力刃裂开；比处理事情,解决问题非常顺利。含侵义；在句中一般作谓语、定语、宾语。@14",
    "拨云见日@比喻冲破黑暗见到光明。也比喻疑团消除,心里顿时明日。@5",
    "昭然若揭@形容真相毕露,所有一切都已显现了出来。@5",
    "事半功倍@意思是只用一半的力气,而收到加倍的功效。形容用力小而收效大。@10",
    "融会贯通@指各方面的知识或道理融合贯穿起来,从而得到系统透彻的理解。@13",
    
    
    "众所周知@意思是大家都知道的,侧重于普遍性,@13@6",
    "有目共睹@形容人人都可以看到,极其明显。@23",
    "显而易见@事情或道理很明显,极容易看清@21",
    "家喻户晓@家家户户都知道。形容人所共知,侧重流传的广。@15",
    "不言而喻@指不用说就可以明白。形容道理很浅显。@25",
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很广,侧重知名度高。@10",
    "鲜为人知@意思是很少有人知道。@5",
    
    
    "居安思危@指处在安定的环境中,也要想到可能产生的危难和祸害。仅仪停留在思想层面,没有具体行动,@13@6",
    "未雨绸缪@意思是趁看天没下雨,先修房屋门窗。比喻事先做好准备工作,预防意外的事情发生,重在准备,侧重已经并开始做了,有具体行动。@27",
    "有备无患@事先有准备,就可以避免祸患(患祸患,灾难)；在句子中一般充当谓语、定语@7",
    "防患末然@意思是指在祸患发生之前就加以预防,重在预防。@7",
    "常备不懈@时刻准备着,从不松懈解@3",
    "高瞻远瞩@站得高,看得远。比喻眼光远大。@10",
    "载舟覆舟@水可以承载船,也可以倾覆船。比喻民心向背,决定政权的存亡。@1",
    
    
    "如影随形@指的是好像影子老是跟看身体。比愉两入事物关系密切或两个人关系密切不能分离。@13@6",
    "并行不悖@同时实行,互相之间不冲突。@12",
    "唇齿相依@意思是嘴唇和牙齿互相依靠。比喻双方关系密切,相互依存。@9",
    "水涨船高@水位升高,船身也随之浮起。比喻事物随看它所凭借的基础的提高而增长提高,@8",
    "相形见绌@意为和同类的事物相比较显得不足。@11",
    "随波逐流@自己没有立场和主见,只是随着潮流走,含贬义。@14",
    "风流云散@像风和云那样流动散开,比喻在一起的人分散到四面八方,@1",
    
    
    "络绎不绝@形容行人车马来往,接连不断@13@6",
    "纷至沓来@形容连续不断地到来。@19",
    "车水马龙@车如流水,马如游龙一般,形容热繁华的景象。其结构为联合式,在句子中可作谓语,定语。@9",
    "源源不断@形容接连不断、连绵不绝。多用于事物,而少用于人。@10",
    "接踵而至@指人们前脚跟着后脚,接连不断地来,形容人接连而来或事情持续发生。@12",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@34",
    "川流不息@指事物像水流一样连续不断。@5",
    
    
    "浩如烟海@形容典籍、图书等极为丰富,@13@6",
    "汗牛充栋@指用牛运书,生要累得出汗：用屋子放书,要放满整个屋子。形容藏书很多。@18",
    "鳞次栉比@像鱼鳞和梳子齿那样有次序地排列看,多用来形容房屋或船只等排列得很密很整齐。@10",
    "星罗棋布@像天空中的星星和棋盘上的棋子一样罗列、分布着。形容数量众多,散布的范围很广。@10",
    "卷帙浩繁@形容书籍很多或一部书的篇幅很长。@2",
    "廖若星辰@稀疏。@4",
    "不计其数@是没办法计算数目,形容极多。@9",
    
    
    "数不胜数@数都数不过来。形容数量极多,很难计算。@13@6",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@34",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@20",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@17",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。[近]］司空见惯。@20",
    "汗牛充栋@指用牛运书,牛要累得出汗：用屋子放书,要放满整人屋子。形容藏书很多@18",
    "不一而足@指同类的事物不止一个而是很多,无法列举齐全。@6",
    
    
    "趋之若鹜@像鸭子一样成群跑过去,比喻许多人争看去追逐@13@6",
    "蜂拥而至@像一窝蜂似地拥来,形容很多人乱哄哄地朝一个地方聚拢。@7",
    "乐此不疲@乐于做某件事而不感觉疲倦。@10",
    "津津乐道@意思是很有兴趣地说个不停。@14",
    "络绎不绝@形容行人车马来往,接连不断。@13",
    "接踵而至@指人们前脚跟看后脚,接连不断地来,形容人接连而来或事情持续发生。@12",
    "纷至沓来@形容连续不断地到来。@19",
    
    
    "无孔不入@比愉有空子就钻,不放过任何一入机会,多指做坏事。(感情色彩)贬义@12@6",
    "无所不在@到处都存在,到处都有。@5",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化,暗示为影响着不到,无形,主体一般是事或物。@27",
    "泛滥成灾@江河湖泊的水溢出,造成灾害；比喻一件事物,多到了影响正常生活的情况。@2",
    "前所未有@从来没有过的。@11",
    "迫不得已@出于逼迫,不得不这样。【近】万不得己。【反］心甘情愿。@2",
    "始料未及@没有想到的,在意料之外的。@4",
    
    
    "条分缕析@有条有理地细细分析。@12@6",
    "深入浅出@指言论或文章的观点主题意义深刻但在语言文字的表达方式上却浅显易懂。@10",
    "恰如其分@一指说话办事不过分：二指办事或说话十分恰当合适。@9",
    "一丝不苟@形容办事认真；连最细微的地方也不马虎。@13",
    "抽丝剥茧@意思是丝得一根一根地抽,茧得一层一层地剥；形容分析事物极为细致,而且一步一步很有层次。@5",
    "分门别类@把一些事物按照特性和特征分别归入各种门类。@3",
    "追根究底@指追问事情的缘由。也说寻根究底,@2",
    
    
    "同舟共济@侧重在困境中同心协力,共同度过难关：多含褒义。@12@6",
    "休戚与共@有幸福共同享受,有祸患共同抵挡。后形容关系紧密,利害相同。@19",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@32",
    "众志成城@大家齐心协力,就像城墙一样地牢固,比喻众人团结一致,就能克服困难；在句中常用作谓语、定语；含優义。@6",
    "同心协力@为了共同的自的或为取得一致的效集而统一思想、共同努力。@2",
    "水乳交融@是像水和乳汁那样融合在一起,比喻关系非常融洽或结合得很紧密@7",
    "同甘共苦@共同享受欢乐幸福,共同承担祸惠苦难(甘：甜)；在句中可充当谓语、定语、状语；含褒义。@4",
    
    
    "曲高和寡@比愉言论或作品不通俗,能了解的人很少,用于消极语气。@12@6",
    "阳春白雪@原指战国时代楚国的较高雅的歌曲后比喻高深的不通俗的文学艺术。@8",
    "特立独行@形容人的志行高洁,不同流俗。@17",
    "标新立异@故意提出新奇的见解,表示自己与众不同,着重体现在显示特点。@7",
    "盛气凌人@原义是以骄横的气势压人：形容傲慢自大,气势逼人；在句子中可充当谓语、宾语、定语、状语；含贬义@5",
    "故步自封@指把自己限制在原来的地方：比喻因循守日,安于现状,不求创新进取。含贬义；在右中一般作谓语、定语。@2",
    "一成不变@一经形成,不再改变,常用在否定右中。@2",
    
    
    "交相辉映@意指各种光亮、色彩等互相映照。多用于形容美好的景象。@12@6",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@27",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果@32",
    "珠联壁合@珍珠联串在一起,美玉结合在一块比喻杰出的人才或美好的事物聚集在一起的美好样子,色彩偏积极。@12",
    "遥相呼应@远远地互相联系,互相配合。@3",
    "相映成趣@相互衬托着,显得很有趣味,很有意思。@8",
    "同放异彩@展现了自己于众不同的地方@2",
    
    
    "得天独厚@具有特殊优越的条件。多指人的资质或自然环境而言。@12@6",
    "独一无二@没有相同的或没有可以相比的,形容十分稀少。@19",
    "绝无仅有@意思是只有一个,再没有别的。形容非常少有。@10",
    "与生俱来@一生下来就是如此。@13",
    "无可比拟@没有可以相比的。@5",
    "不可多得@形容非常稀少,很难得到(多指人才或稀有物品)。@9",
    "与众不同@表示与其它人不一样。@10",
    
    
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作“活龙活现”。@12@6",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真,生动形象。@19",
    "绘声绘色@指以可见或可理解的形式来描绘或概括。形容描写或叙述一段事情很逼真@8",
    "栩栩如生@喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@22",
    "入木二分@形容书法笔力刚劲有力,也比喻对文章或事物见解深刻、透彻。其本身结构为偏正式,在句子中可作谓语、定语、状语、补语,含义。@8",
    "有声有色@既有声音,又有色彩。形容说话、写作或表演等十分具体形象,精彩动人。@3",
    "不遗余力@不遗余力指把所有的力量都使出来,一点也不保留。@13",
    
    
    "风起云涌@形容雄浑磅樽之势：也比事物迅速发展,声势浩崭露头角大。@12@6",
    "如火如荼@比喻军容之盛,现用来形容大规模的行动气势旺盛,气氛热烈。含侵义@18",
    "独占鳌头@原指科举时代考试中了状元。现泛指占首位或第一名。@10",
    "方兴未艾@事物正在蓬勃发展,不会很快终止。强调新事物初级阶段正在逢勃的发展,偏向积极方向。@24",
    "应运而生@由于某件事衍生新事物,必然性。@16",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补语；含义。@12",
    "声势浩大@声威和气势非常盛大。@4",
    
    
    "大张旗鼓@形容进攻的声势和规模很大,也形容群众活动声势和规模很大。@12@6",
    "大行其道@在某范围内广为流传,盛行一时。@12",
    "风靡一时@形容一个事物在一个时期非常盛行像风吹倒草木一样。@10",
    "蔚然成风@事物盛极一时,成为风气(多指好的)。@10",
    "声势浩大@声威和气势非常盛大。@4",
    "排山倒海@把高山推开,把大海翻过来。形容力量很大,声势雄壮,@2",
    "雷厉风行@比喻执行政策法令严厉迅速。也形容办事声势猛烈,行动迅速@3",
    
    
    "脍炙人口@美味人人爱吃,比愉好的诗文受到人们的称赞和传颂,描述对象通常是诗文。在句中可充当谓语、定语；含褒义@12@6",
    "喜闻乐见@意思是喜欢听,乐意看。形容很受欢迎。@14",
    "家喻户晓@家家户户都知道。形容人所共知,侧重流传的广。@15",
    "口碑载道@载道：充满道路。形容到处都有人称颂。@2",
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很广,侧重知名度高,@10",
    "流芳百世@美好的名声在后世永远流传。也作流芳干古。@2",
    "风靡一时@形容一个事物在一个时期非常盛行像风吹倒草木一样。@10",
    
    
    "一如既往@指态度或做法没有任何变化,还是像从前一样。(感情色彩)褒义@12@6",
    "不遗余力@不遗余力指把所有的力量都使出来一点也不保留。@13",
    "一唱百和@意思是形容附和的人极多。@2",
    "始终如一@指自始至终都一样,多用于形容人能坚持,做事从不间断,偏重于“始终不改变”。@9",
    "一以贯之@做人做事,按照一个道理,从一而终不会改变,主要指精神、纲领、准则等。@11",
    "久久为功@要持之以恒,锲而不舍,驰而不息@2",
    "驰而不息@奔驰向前不停息的意思。@1",
    
    
    "接踵而至@指人们前脚跟看后脚,接连不断地来,形容人接连而来或事情持续发生@12@6",
    "纷至沓来@形容连续不断地到来@19",
    "络绎不绝@形容行人车马来往,接连不断。@13",
    "层出不穷@比喻事物或言论接连不断地出现,尚未究尽,数量多@34",
    "趋之若鹜@像鸭子一样成群跑过去,比喻许多人争看去追逐。@13",
    "车水马龙@车如流水,马如游龙一般,形容热匝繁华的景象。基结构为联合式,在句子中可作谓语定语。@9",
    "扑面而来@朝着你的方向过来。@2",
    
    
    "并行不悖@同时实行,互相之间不冲突@12@6",
    "双管齐下@比喻做一件事两个方面同时进行或两种方法同时使用。在句中一般作谓语、宾语。@6",
    "如影随形@指的是好像影子老是跟看身体。比喻两人事物关系密切或两个人关系密切不能分离。@13",
    "并驾齐驱@指并排套着的几匹马一齐快跑,比喻彼此的力量或才能不分高下或地位相当。@8",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@32",
    "不谋而合@强调事先没有商量过,意见或行动却完全一致,。@15",
    "自成一家@在某一方面的学问或技术有独到的见解或独特的做法,能自成体系。@2",
    
    
    "大行其道@在桌范围内广为流传,盛行一时。@12@6",
    "风靡一时@形容一个事物在一个时期非常盛行像风吹倒草木一样。@10",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@34",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@20",
    "应运而生@由于某件事衍生新事物,必然性。@16",
    "大张旗鼓@形容进攻的声势和规模很大,也形容群众活动声势和规模很大。@12",
    "蔚然成风@事物盛极一时,成为风气(多指好的)。@10",
    
    
    "大势所趋@意思是整个局势发展的趋向。@12@6",
    "势在必行@不能躲开或回避；从事情发展的趋势看,必须采取行动@14",
    "当务之急@当前任务中最急切的要做的事,一般作主语、宾语。@10",
    "重中之重@比喻一件事是在一些重要的事中最重要的,形容这件事十分重要。@9",
    "势不可挡@指来势迅猛,不可抵挡。@11",
    "万全之策@意思是极其周到的计谋、办法。@10",
    "未雨绸缪@意思是趁着天没下雨,先修房屋门窗。比喻事先做好准备工作,预防意外的事情发生,重在准备,侧重已经开始做了,有具体行动@27",
    
    
    "薪火相传@意思是比愉学问和技艺代代相传@12@6",
    "生生不息@指不断地生长、繁殖。@9",
    "继往开来@继承前人的事业,开辟未来的道路。@6",
    "一脉相承@从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系。@16",
    "承前启后@继承前代并启发后代,多用去学习、事业等方面。@3",
    "前赴后继@前面的人上去,后面的人就跟上去形容奋勇前进,连续不断。@8",
    "生机勃勃@形容生命力旺盛的样子。@9",
    
    
    "浅尝辄止@略微尝试一下就停下来,重点强调研究/学习不钻研。偏重于浅,不深入。@12@6",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。又指文章言论的肤浅,无真知实学。@23",
    "走马观花@现比喻观察事物不深,常与风景、旅行等搭配。@20",
    "蜻蜓点水@蜻蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入；也形容轻轻一吻。@10",
    "言谈举止@指人的言语、举动、行为。@2",
    "轻描淡写@原指描绘时用浅淡的颜色轻轻地着笔,现多指说话写文章把重要问题轻轻带过,不加重视,也比喻做事不费力。@9",
    "删繁就简@意思是去掉删除繁杂部分,使它趋于简明。@5",
    
    
    "勇往直前@剪敢地一直向前进,@12@6",
    "前赴后继@前面的人上去,后面的人就跟上去。形容奋勇前进,连续不断。@8",
    "义无反顾@从道义上只有勇往直前,不能犹像回顾。@6",
    "瞻前顾后@原形容做事谨慎,考虑周到。后多形容顾虑过多,犹像不决。@11",
    "视死如归@原义是把把死看得像回家一样平常：形容人勇敢不怕死；在句子中可充当作谓语、定语状语。@4",
    "百折不挠@指虽然受到很多挫折,但仍不动摇退缩或屈服。形容意志坚强。含义；作谓语、定语、状语。@7",
    "不屈不挠@喻在压力和困难面前不屈服,表现十分顾强。作谓语、定语、状语。@3",
    
    
    "美轮美奂@用于形容建筑物雄伟壮观,富丽堂皇也用来形容雕刻或建筑艺术的精美效果。「31在句中一般作谓语、定语。@12@6",
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@22",
    "异彩纷呈@比喻突出的成就或表现@11",
    "精美绝伦@精致美妙得没有东西可以比得上。@3",
    "华而不实@原义是花开得好看,但不结果实；比喻中看不中用；在句子中可充当谓语、定语；含贬义。@5",
    "表里不一@表面与内在不一样。@2",
    "沁人心脾@原指芳香凉爽的空气、饮料或花香使人感到舒适。也形容诗歌和文章优美动人,给人清新爽朗的感觉。@5",
    
    
    "林林总总@形容杂乱众多。形容人或事物众多,只体现“多“之意。@12@6",
    "五花八门@比喻事物繁多,变化莫测,体现出变化之意。@16",
    "千奇百怪@十分的奇怪,形容各种各样奇怪的事物。@11",
    "形形色色@形容事物种类繁多,各式各样。@11",
    "琳琅满目@比喻眼前到处充满了美好的事物@17",
    "纷繁芜杂@形容文章内容芜杂,没有条理,或者是事情杂乱无章,没有头绪。@5",
    "标新立异@故意提出新奇的见解,表示自己与众不同,着重体现在显示特点。@17",
    
    
    "珠联璧合@珍珠联串在一起,美玉结合在一块,比喻杰出的人才或美好的事物聚集在一起的美好样子,色彩偏积极。@12@6",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@27",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@32",
    "交相辉映@意指各种光亮、色彩等互相映照。多用于形容美好的景象@12",
    "同放异彩@展现了自己于众不同的地方@2",
    "取长补短@指在同类事物中吸取这入的长处来弥补那人的短处。含复义@7",
    "美美与共@将各自之美和别人之美拼合在一起就会实现理想中的大同美@1",
    
    
    "集思广益@集中群众的智慧,广泛吸收有益的意见。该成语构词方式是联合式：在句中作谓语、定语、状语。@12@6",
    "博采众长@从多方面吸取各家的长处。@10",
    "群策群力@大家共同想办法,一起出力。形容遇到问题时大家团结一致,共同出力想办法。@5",
    "兼收并蓄@指把不同内容、不同性质的东西收下来,保存起来。@6",
    "取长补短@指在同类事物中吸取这个的长处来弥补那个的短处。含侵义。@7",
    "传承文明@传承文明@2",
    "广开言路@指尽可能地让人们广泛发表意见。含侵义；在句中一般作谓语、定语、宾语。@3",
    
    
    "责无旁贷@强调在自己的责任不能推卸给别人@12@6",
    "义不容辞@强调道义上不容许推辞@4",
    "理所当然@道理当然是这样的,意为发生的事情本身合平道理(非情理),不容怀疑@27",
    "刻不容缓@指形势紧迫,一刻也不允许拖延。@13",
    "迫在眉睫@事情十分紧急,已到眼前。@21",
    "当仁不让@以仁为任,无所谦让：后指遇到应该做的事就积极主动去做,不推让,@7",
    "义无反顾@从道义上只有勇往直前,不能犹豫回顾。@6",
    
    
    "屈指可数@形容数目很少。「反不计其数@12@6",
    "凤毛麟角@比喻难得而宝贵的人或事物。@16",
    "寥寥无几@形容数量很少,没有几个。@13",
    "廖若星辰@稀疏。@4",
    "首屈一指@屈指计数总是先屈大拇指,因以首屈一指表示位居第一。@6",
    "百里挑一@一百个当中就挑出这一个来。形容人才出众,不可多得。@5",
    "危在旦夕@形容处境十分危险。侧重强调时间短,危险近在眼前。@9",
    
    
    "因循守旧@死守老一,缺乏创新的精神@11@6",
    "固步自封@比喻守着老一套,不求进步。@16",
    "因嘻废食@因为有人吃饭死了,就想让天下人都不吃饭。后比要做的事情由于出了点小毛病或怕出问题就索性不去于；含贬义。@14",
    "急功近利@指急于追求成效,贪图眼前利益。含贬义@12",
    "一孔之见@从一个小雇隆里所看到的。比喻狭隘片面的见解。@3",
    "夜郎自大@原指国土很小的夜郎国王自以为大比喻人不自量力,妄自尊大；在句中作谓语、定语含贬义。@5",
    "闭门造车@关上门造车,比喻只凭主观办事,不管客观实际。@11",
    
    
    "望而生畏@意思是一见之下就产生了畏惧心理。形容人态度威严或事务艰难令人畏惧@11@6",
    "望而却步@指看到了危险或力不能及的事而往后退缩。@10",
    "望洋兴叹@原指在伟大的事物面前感叹自己的微小,后比愉因眼界大升而惊奇赞叹或因能力不及而感到无可奈何,含贬义@11",
    "知难而退@原义指作战时相机行事,遇到不利情况应及时退避；中性。后指碰到困难就退缩；含贬义。该成语在句中一般作谓语,也作宾语。@5",
    "望尘莫及@指只望见前面骑马的人走过扬起的尘土而不能赶上。比愉远远落后,常用作谦词。@14",
    "敬而远之@表示尊敬却有所顾虑不愿接近@6",
    "畏缩不前@畏惧退缩,不敢向前。也作畏蕙不前。@1",
    
    
    "博采众长@从多方面吸取各家的长处。@@6",
    "集思广益@集中群众的智慧,广泛吸收有益的意见。该成语构词方式是联合式：在句中作谓语、定语、状语。@",
    "兼收并蓄@指把不同内容、不同性质的东西收下来,保存起来。@",
    "推陈出新@去掉旧事物的糟粕,取其精华,并使它向新的方向发展,侧重强调文化的去粘取精。@",
    "修身养性@通过自我反省体察,使身心达到完美的境界。@",
    "闻过则喜@听到有人批评自已的过错就感到高兴。形容很虚心,对自己要求严格。@",
    "见贤思齐@指见到有才德的人就想着与他齐平：在句子中可充当谓语、宾语、定语；也作见德思齐。@",
    
    
    "门可罗雀@大门前面可以张网捕雀。形容门庭冷落,宾客稀少,侧重强调某个地方人少。@@6",
    "无人问津@比喻没有人来探问、尝试或购买。@",
    "门庭冷落@解释为形容十分冷落,宾客稀少。@",
    "人迹罕至@意思是人的足迹很少到达；指荒凉偏僻的地方。@",
    "无足轻重@意思是没有它并不轻些,有它也并不重些。指无关紧要。@",
    "肝脑涂地@指做事不惜一切代价,乃至牺性生命；一般在句子当中充当谓语；含义@",
    "生灵涂炭@原义是人民陷在泥塘和火坑里,形容人民处于极端困苦的境地@",
    
    
    "矫枉过正@指矫柱弯曲的东西超过了限度,使其又弯向另一边；比愉纠正事物的偏失、错误过了头,而陷入另一种偏失、错误之中。含贬义：@@6",
    "过犹不及@形容事情要适得其中；在句子中可充当谓语、宾语、定语。@",
    "因嘻废食@因为有人吃饭嚏死了,就想让天下人都不吃饭。后比喻要做的事情由于出了点小毛病或怕出问题就索性不去于：含贬义。@",
    "削足适履@指把脚削去一块来凑合鞋的大小；比喻不合理地迁就凑合或不顾具体条件,生搬硬套。含贬义@",
    "扬汤止沸@把开水留出来再倒回去,使锅中的水暂时不沸腾。比办法不彻底,只能暂时解救急难不能从根本上解决问题。@",
    "舍本逐末@放弃根本的而追求枝节的,后用以比喻轻重主次颠倒,强调去掉主要的,抓住次要的。@",
    "物极必反@事物发展到极端,会向相反方向转化。@",
    
    
    "不置可否@不说可以,也不说不可以。指不表明态度@@6",
    "不言而喻@指不用说就可以明日。形容道理很浅显。@",
    "模棱两口@指对一件事情没有明确的态度或主张(模棱：意见或态度不明确。两可：这样也可以,那样也可以)。该成语在句中可作谓语、状语、定语,补语；多含贬义。@",
    "唇枪舌剑@形容争辩激烈,言辞锋利。@",
    "莫衷一是@不能判定哪个对,哪个错,侧重描述思想上。@",
    "各持己见@意思是各人都坚持自己的意见。@",
    "不可名状@无法用语言来形容。@",
    
    
    "乐此不疲@乐于做某件事而不感觉疲倦,@@6",
    "趋之若鹜@像鸭子一样成群跑过去,比喻许多人争看去追逐。@",
    "弹精竭虑@形容用尽精力、费尽心思,一般偏重脑力劳动。@",
    "津津乐道@意思是很有兴趣地说个不停@",
    "周而复始@转了一圈又一圈,不断循环,从起点开始又回到起点,不断重复@",
    "疲于奔命@因受命奔走而搞得很累：后也指忙于奔走应付,弄得非常疲之@",
    "奉若圭臬@应为：奉为圭臬,比喻把某些言论或事当成自己的准则@",
    
    
    "推波助澜@比喻从旁鼓动、助长事物(多指坏的事物)的声势和发展,扩大影响。@@6",
    "添油加醋@比喻夸大或歪曲事实,增添原来没有的内容或细节。@",
    "助纣为虐@指帮助王作恶；比喻帮助恶人做坏事。含贬义。@",
    "煽风点火@比喻鼓动、唆使别人于坏事或故意助长别人不好的想法。也作“扇风点火”。@",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化,暗示为影响着不到,无形,主体一般是事或物。@",
    "耳濡目染@指经常听到看到,不知不觉地受到影响,多用于人,用于好的方面,侧重指技能方面。@",
    "日积月累@一天一月地积累起来,形容长时间积累。[近］积少成多@",
    
    
    "鹤立鸡群@是是指像鹤站在鸡群中一样。比一个人的仪表或才能在周围一群人里显得很突出。@@6",
    "出类拔萃@比喻超过聚在一起的同类人或物,多用于形容才德超出众人之上的人。含义@",
    "无人能及@没有人能达到这个人所达到的程度。@",
    "硕果仪仔@唯一留存下来的大果子：比喻由于时间的推移,留存下来仅存的人或事物@",
    "凤毛麟角@比喻难得而宝贵的人或事物。@",
    "高高在上@原指地位高,现在形容领导者脱离实际,脱离群众。@",
    "独当一面@指单独承当一方面的工作或使命：在句子中可充当作谓语、定语、状语；含優义@",
    
    
    "风靡一时@形容一个事物在一个时期非常盛行,像风吹倒草木一样。@@6",
    "大行其道@在某范围内广为流传,盛行一时。@",
    "蔚然成风@事物盛极一时,成为风气(多指好的)。@",
    "喜闻乐见@意思是喜欢听,乐意看。形容很受欢迎。@",
    "大张旗鼓@形容进攻的声势和规模很大,也形容群众活动声势和规模很大。@",
    "雅俗共赏@形容某些文艺作品既优美,又通俗各种文化程度的人都能够欣赏。@",
    "交口称赞@意为异口同声地称赞@",
    
    
    "妇孺皆知@妇女和小孩都知道,指某件事物众所周知,流传得很广,侧重知名度高。@@6",
    "司空见惯@某事常见,不足为奇,偏向描述事物,多用于书面语。@",
    "家喻户晓@家家户户都知道。形容人所共知,侧重流传的广。@",
    "绘炙人口@美味人人爱吃,比喻好的诗文受到人们的称赞和传颂,描述对象通常是诗文。在句中可充当谓语、定语；含义。@",
    "街谈巷议@意思是大街小巷里人们的议论。指民间的舆论。也是在街巷中谈说议论,形容议论纷纷。@",
    "耳熟能详@听得多了,能够很清楚、很详细地复述出来。@",
    "众所周知@意思是大家都知道的,侧重于普遍性。@",
    
    
    "视而不见@指不注意,不重视,静看眼却没看见。@@6",
    "熟视无睹@强调看惯了却像没看见一样。形容对事物漫不经心或不重视。@",
    "置若罔闻@放在一边,好像没有听见似的。指不去过问或不予关心,强调不重视,不关心,侧重于听。@",
    "心存芥蒂@比喻心里的不满或不快。指心里对人对事有怨恨或不愉快的情绪。@",
    "不屑一顾@意思是认为不值得一看。形容极端轻视。@",
    "与世隔绝@指与文明社会上的人们隔离,断绝来往；形容隐居或人迹罕至的极偏僻地方。@",
    "束之高阁@捆起来以后放在高高的架子上,比喻放看不用、去在一芳不管,也比愉把某事或桌种主张、意见、建议等搁置起来,不予理踩和办理,@",
    
    
    "出神入化@形容文学艺术或技艺高超达到了绝妙的境界,还形容超脱了神通达到了自由国度的境界。@@6",
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@",
    "尽善尽美@意思是指极其完善,极其美好：形容事物完美到没有一点缺点,也作“尽美尽善”。在句中作谓语、宾语、定语@",
    "触类旁通@指掌握了某一事物的知识或规律,进而推知同类事物的知识或规律；常用于学习方面。侧重于掌握知识和技能@",
    "删繁就简@意思是去掉删除繁杂部分,使它趋于简明,@",
    "惟妙惟肖@意思是形容描写或模仿得非常逼真,生动形象。@",
    "面面俱到@释义是各方面都照顾得很周到。也指不仅各方面都照顾到,而且每一个方面都处理的很得当。@",
    
    
    "绝无仅有@意思是只有一个,再没有别的。形容非常少有。@@6",
    "独一无二@没有相同的或没有可以相比的,形容十分稀少。@",
    "得天独厚@具有特殊优越的条件。多指人的资质或自然环境而言。@",
    "史无前例@历史上从来没有过这类先例。形容前所未有。@",
    "独树一帜@比喻与众不同,自成一家,多含复义,除用于艺术创作外,还可用于政治、经济等创业道路。@",
    "卓尔不群@才德超出寻常,与众不同。也可以用来强调不同。@",
    "不可多得@形容非常稀少,很难得到(多指人刁或稀有物品)。@",
    
    
    "鳞次栉比@像鱼鳞和梳子齿那样有次序地排列看,多用来形容房屋或船只等排列得很密很整齐。@@6",
    "星罗棋布@像天空中的星星和棋盘上的棋子一样罗列、分布着。形容数量众多,散布的范围很广。@",
    "浩如烟海@形容典籍、图书等极为丰富。@",
    "错落有致@形容事物的布局虽然参差不齐,但却极有情趣,使人看了有好感。@",
    "参差不齐@原意是长短、高低、大小不一致,形容很不整齐或水平不一。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未究尽,数量多。@",
    "纷繁芜杂@形容文章内容芜杂,没有条理,或者是事情杂乱无章,没有头绪。@",
    
    
    "天经地义@指关地间理所当然而不能改变的道理；也指理所当然,不容置疑的问题；含褒义。(感情色彩)褒义@@6",
    "理所当然@道理当然是这样的,意为发生的事情本身合乎道理(非情理),不容怀疑@",
    "约定俗成@指事物的名称或社会习惯往往是由人民群众经过长期社会实践而确定或形成的,@",
    "合情合理@符合情理。@",
    "无可厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非。@",
    "责无旁贷@强调在自己的责任不能推卸给别人。@",
    "正当其时@恰巧碰上那个机会时机。@",
    
    
    "心驰神往@形容思想集中在追求和向往的事情或地方上,一心向往。@@6",
    "心领神会@心里知道(对方未明说的意思),一般指一方。@",
    "流连忘返@常形容对美好景致或事物的留恋。@",
    "心旷神怡@心情愉快,精神舒畅。@",
    "心荡神迷@心神摇荡。指神魂颠倒,不能自持。也作心荡神摇。@",
    "交口赞誉@交：一齐,同时。异口同声地称赞。@",
    "如数家珍@好像在数自己家里的珍宝一样。通常用来形容某人对所讲的事情十分熟悉,@",
    
    
    "与日俱增@用于人的思想感情,指随着时间的推移而不断增长。@@6",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    "突飞猛进@侧重强调进步、进展非常快。@",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "大放异彩@闪耀着无比灿烂的光辉,散发出奇异的光彩或色彩。比喻有看优异的表现或是突出的成就。@",
    "如日中天@比喻事物正发展到最兴盛的阶段@",
    "水涨船高@水位升高,船身也随之浮起。比喻事物随看它所凭借的基础的提高而增长提高。@",
    
    
    "一气呵成@形容文章的气势首尾贯通。②形容完成整个工作的过程中不间断,不松解,@@6",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易。@",
    "一鼓作气@指作战开始时鼓足勇气。现在比喻劲头大时,一口气完成。@",
    "一挥而就@指才思敏捷,写字、作文或画画速度很快；多含复义。该成语在句中一般作谓语、定语。也说“一挥而成”@",
    "一劳永逸@辛苦一次,把事情办好,以后就可以不再费力了。@",
    "文不加点@文章一气呵成,无须修改。形容文思敏捷,写作技巧纯熟。含蔓义。@",
    "清水芙蓉@像那刚出清水的芙蓉花,质朴明媚,毫无雕琢装饰。@",
    
    
    "星罗棋布@像天空中的星星和棋盘上的棋子一样罗列、分布看。形容数量众多,散布的范围很广。@@6",
    "鳞次栉比@像鱼鳞和梳子齿那样有次序地排列看,多用来形容房屋或船只等排列得很密很整齐,@",
    "浩如烟海@形容典籍、图书等极为丰富@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未究尽,数量多。@",
    "并然有序@指整整齐齐,次序分明,条理清楚偏正式；作定语、状语；含义。@",
    "一丝不乱@形容布置或收拾得非常整齐。@",
    "有条不紊@形容做事、说话有条有理,丝毫不乱@",
    
    
    "焕然一新@形容呈现出薪新的面貌@@6",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,例重强调进步快、变化快,多形容景象变化之快。@",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不解,不中断,@",
    "亘古不变@从古到今,没有变化。@",
    "一脉相承@从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系。@",
    "波澜壮阔@原形容水面辽阔,现比喻声势雄壮或规模宏大。@",
    "雄心勃勃@形容理想和抱负非常远大。@",
    
    
    "举步维艰@形容已陷入十分艰难的处境,办事很困难@@6",
    "困难重重@一个困难接着一个困难@",
    "进退维谷@无论是进还是退,都是处在困境之中。形容处境艰难,进退两难,多用于书面。@",
    "难上加难@形容极端的难度。@",
    "千难万险@意思是形容困难和危险极多@",
    "孤军奋战@一支军队在没有友军的情况下单独英勇作战。后比喻单独承担任务或工作。也作“孤军作战”、“孤军独战”。@",
    "一筹莫展@指一点计策也施展不出,常用于形容一点办法也想不出来。含贬义；在句中一般作谓语、定语、补语。@",
    
    
    "蔚然成风@事物盛极一时,成为风气(多指好的)。@@6",
    "风靡一时@形容一个事物在一个时期非常盛行像风吹倒草木一样。@",
    "应运而生@由于某件事衍生新事物,必然性。@",
    "蔚为大观@形容丰富多彩的景色：雄伟的景象,形容事物美好而繁多,给人一种盛大的印象。多指文物、盛大的景象等。@",
    "大张旗鼓@形容进攻的声势和规模很大,也形容群众活动声势和规模很大。@",
    "大行其道@在某范围内广为流传,盛行一时。@",
    "水到渠成@比条件成熟,事情就会自然成功侧重强调条件成熟。含蔓义@",
    
    
    "跌宕起伏@形容事物多变,不稳定,也比喻音乐声忽大忽小和故事情节的曲折。(固定搭配)》“跌容起伏”、“情节是固定搭配@@6",
    "悲欢离合@泛指人生中各种遭遇和各种心情。也作离合悲欢。@",
    "峰回路转@形容山峰、道路曲折迁回。比喻事情经历挫折、失败后,出现新的转机。也指转折点。形容山水名胜路径曲折复杂。@",
    "历尽坎坷@道路高低不平.事情不顺利或不称心比喻不得志。@",
    "沧海桑田@是大海变成农田,农田变成大海；比喻世事变化巨大。其本身结构为联合式,在句子中可作谓语、宾语、分句。@",
    "此消彼长@不要太过于在乎此时的失去,别的方面会有长进。什么事情都有两面或者多面性@",
    "荡气回肠@意思是形容文章、乐曲十分婉转动人。@",
    
    
    "力不从心@指心中想做某事而力量达不到或无力去做。在句中一股作谓语、宾语。@@6",
    "捉襟见肘@指整理一下衣襟,就露出了胳膊肘,形容衣服破烂,生活窘困；也比喻顾此失彼,穷于应付。@",
    "力有不逮@指能力达不到,能力触及不到。@",
    "无能为力@意思是用不上力量,帮不上忙,指没有能力或力不能及。@",
    "文思不畅@表示文笔不佳。@",
    "无从下手@指没有任何途径没法着手去办。@",
    "不通文墨@指人文化水平不高或识字不多。@",
    
    
    "截然不同@指两种事物毫无共同之处,@@6",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同,不同之处很多。@",
    "背道而驰@指向着相反的方向奔驰：形容背离正确目标,朝反方向走,一般形容2个人。@",
    "相去甚远@互相之间存在很大差异和距离@",
    "南辕北撤@该成语比喻行动和目的正好相反。强调方向不对,一般是一入人,含贬义。@",
    "天差地别@形容两种或多种事物之间的差距很大,就像天和地之间的距离一样。@",
    "水火不容@水和火是两种性质相反的东西,根本不相容。比喻二者对立,绝不相容,@",
    
    
    "旷日持久@荒废时日,拖延很久。@@6",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "立竿见影@指在阳光下竖起竹竿,立刻就看到了竹竿的影子。词意比喻行事能马上看到效果或付出能马上得到收获。常与效应搭配@",
    "举足轻重@一拾起脚就可以改变两边的重量,使之失去平衡与均势(举足：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "润物无声@指有大胸怀者,做了贡献而不张扬默默奉献。@",
    "万古长青@比喻崇高的精神或深厚的友谊永远不会消失。@",
    "万紫千红@形容百花齐放,色彩艳丽；多指繁盛的春色,也比喻事物丰富多彩。@",
    
    
    "本末倒置@比喻巅倒了事物的轻重主次。@@6",
    "舍本逐末@放弃根本的而追求枝节的,后用以比愉轻重主次颠倒,强调去掉主要的,抓住次要的@",
    "背道而驰@指向着相反的方向奔驰：形容背离正确目标,朝反方向走,一般形容2入人。@",
    "因小失大@为了小的利益而失去大的利益。@",
    "以一持万@持：把握。形容抓住关键,可以控制全局。@",
    "轻重倒置@把重要的和不重要的两者的地位摆颠倒了。@",
    "三心二意@意志不坚定,犹豫不决,也指又想这样又想那样,犹豫不定,@",
    
    
    "醍醐灌顶@醍醐由牛乳精制而成,最益人体。醍醐灌顶,即将牛奶中精炼出来的乳酪浇到头上。佛家以此比愉灌输智慧,使人得到后发,动底醒倍,也比赠产高明的意使人受到很大启发。也形容清凉舒@@6",
    "振聋发聩@声音很大,使耳聋的人也听得见。比用语言文字唤醒糊涂麻木的人,使他价清醒过来。@",
    "茅塞顿开@原来心理像被茅草塞住,现在忽然一下子被打开了；后比喻忽然理解、明日了。该成语在句中多作谓语,也作状语、定语；含复义。@",
    "警钟长鸣@报告发生意外或遇到危险的钟,比喻持久的保持警惕性。@",
    "恍如隔世@仿佛隔了一个时代。指一种因人事或景物变化很大而引起的感触@",
    "如梦初醒@比喻过去一直糊涂,在别人或事实的启发下,刚刚明日过来,@",
    "振奋人心@指让人精神振作奋发@",
    
    
    "蒸蒸日上@意为一天天地向上发展。形容发展速度快。多指生活和生意。@@6",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "迎来送往@指走的欢送,来的欢迎；形容忙于交际应酬,修饰人。@",
    "生机勃勃@形容生命力旺盛的样子。@",
    "熙熙攘攘@形容人来人往,非常热闹拥挤。@",
    "生生不息@指不断地生长、繁殖。@",
    "薪火相传@思是比喻学问和技艺代代相传。@",
    
    
    "孜孜以求@不知疲倦地探求。@@6",
    "念念不忘@形容牢记在心,时刻不忘。@",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    "梦寐以求@指做梦的时候都在追求,形容迫切地期望着。@",
    "虚无缥缈@形容空虚茫。指看不见,摸不着的虚幻.就像人的思想境界一样,没有实体感@",
    "一厢情愿@指只是单方面的愿望,没有考虑对方是否同意,或客观条件是否具备,@",
    "遥不可及@非常遥远而不可到达,意指非常遥远、难以得到的东西,@",
    
    
    "亘古不变@从古到今,没有变化。@@6",
    "持之以恒@有恒心地坚持下去,侧重强调时间长的坚持不解,不中断。@",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    "一以贯之@做人做事,按照一个道理,从一而终不会改变,主要指精神、纲领、准则等。@",
    "一成不变@一经形成,不再改变,常用在否定句中。@",
    "焕然一新@形容呈现出薪新的面貌@",
    "一脉相承@从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系。@",
    
    
    "车水马龙@车如流水,马如游龙一般,形容热闹繁华的景象。其结构为联合式,在句子中可作谓语、定语,@@6",
    "络绎不绝@形容行人车马来往,接连不断。@",
    "纷至沓来@形容连续不断地到来@",
    "接踵而至@指人们前脚跟看后脚,接连不断地来,形容人接连而来或事情持续发生。@",
    "接踵而来@指人们前脚跟看后脚,接连不断地来。形容来者很多,络绎不绝。@",
    "纵横交错@横的竖的交叉在一起。@",
    "血流不息@指事物像水流一样连续不断。@",
    
    
    "恰如其分@一指说话办事不过分：二指办事或说话十分恰当合适。@@6",
    "鞭辟入里@形容做学问切实。今多形容说明问题透彻,切中要害。@",
    "适可而止@指做到适当程度就停下来,不要过头；常用于比喻做事恰到好处。含复义；在句中一般作谓语、宾语。@",
    "适逢其时@恰巧碰上那个机会或时机。@",
    "及锋而试@原义是趁著军队士气旺盛时使用军队,原指乘士气高涨的时候使用军队,后比喻乘有利的时机行动。@",
    "条分缕析@有条有理地细细分析。@",
    "一针见血@比喻说话直截了当,切中要害。@",
    
    
    "遥不可及@非常遥远而不可到达,意指非常遥远、难以得到的东西。@@6",
    "虚无缥缈@形容空虚茫。指看不见,摸不着的虚幻.就像人的思想境界一样,没有实体感@",
    "高不可攀@高得没法擎登。形容难以达到@",
    "一相情愿@指只是单方面的愿望,没有考虑对方是否同意,或客观条件是否具备。@",
    "孜孜以求@不知疲倦地探求。@",
    "一文不值@指一点价值都没有,后指人无用。@",
    "可有可无@可以有,也可以没有。形容无关紧要。@",
    
    
    "心无旁骛@意思是心中没有另外的追求。形容心思集中,专心致志。@@6",
    "专心致志@形容一心一意,精神高度集中地做事。也作“专心一志”。@",
    "全神贯注@全部精神集中在一点上。形容注意力高度集中。@",
    "聚精会神@形容专心致志,注意力高度集中的样子。@",
    "一本正经@形容庄重严肃,非常认真。多用于贬义。「近】道貌岸然@",
    "走马观花@现比喻观察事物不深,常与风景、旅行等搭配。@",
    "下马看花@比喻停下来,深入实际,认真调查研究。@",
    
    
    "分道扬镳@多比愉志趣、自的不同,各走各的路,@@6",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义。@",
    "背道而驰@指向着相反的方向奔驰：形容背离正确目标,朝反方向走,一般形容2入人。@",
    "分庭抗礼@客人与主人分立在庭的两侧,以平等的地位相对行礼。后用来比喻彼此地位或势力相等平起平座或互相对立。该成谱在句中多作谓谱,也作定语。@",
    "若即若离@好像接近,又好像离开。指对人保持一定的距离。@",
    "失之交臂@形容当面错过。@",
    "格格不入@形容彼此思想不协调,想法不相容,不体现对立关系。@",
    
    
    "翻天覆地@形容变化巨大而彻底,也指闹得很区@@6",
    "来之不易@得到它不容易：表示财物的取得或事物的成功是不容易的,@",
    "前所未有@从来没有过的。@",
    "开天辟地@第一种意思是指开辟天地,艰苦创业,多形容创造了空前宏伟的事业；第二种意思是指以前从未有过,有史以来第一次。在句中作谓语、定语。@",
    "筚路蓝缕@指驾着简陋的柴车,穿着破烂的衣服去开辟山林道路。形容创业的艰苦。@",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "参差不齐@原意是长短、高低、大小不一致,形容很不整齐或水平不一。@",
    
    
    "披荆斩棘@指的是保护某事物能让其能正常发展@@6",
    "遮风挡雨@比喻起保护作用。@",
    "保驾护航@保护某事物能让其能正常发展。@",
    "添砖加瓦@原来指建房屋时给不断地添砖块加瓦片。后比喻做一些工作,尽一点力量@",
    "劈波斩浪@船只行进时冲开波浪,比喻排除前进中的困难和障碍。也指勇敢向前的精神。@",
    "乘风破浪@指船只乘着风势破浪前进(乘：趋看、借看；破：冲开),形容发展迅猛,也比喻志趣远大,勇往直前；在句中一般作谓语；多含义。@",
    "攻坚克难@常常用来形容或鼓励人们克服各种艰难险阻,圆满的完成任务。@",
    
    
    "不屑一顾@意思是认为不值得一看。形容极端轻视@@6",
    "嗤之以鼻@用鼻子声冷笑,形容对某事物或桌种现象的轻曦。侧重强调看不上、瞧不起、体现出部视之意。@",
    "置若罔闻@放在一边,好像没有听见似的。指不去过问或不予关心,强调不重视,不关心,侧重于听。@",
    "不足挂齿@表示不值得一提。@",
    "心存介蒂@比喻心里的不满或不快。指心里对人对事有忽恨或不愉快的情绪。@",
    "视而不见@指不注意,不重视,静着眼却没看见。@",
    "颇有微词@有很多(隐嗨的)批评和不满的话语,表示对某人某事不满。@",
    
    
    "筚路蓝缕@指驾看简陋的柴车,穿看破烂的衣服去开辟山林道路。形容创业的艰苦。@@6",
    "开天辟地@第一种意思是指开辟天地,艰苦创业,多形容创造了空前宏伟的事业；第二种意思是指以前未有过,有史以来第一次。在句中作谓语、定语。@",
    "来之不易@得到它不容易：表示财物的取得或事物的成功是不容易的。@",
    "翻天覆地@形容变化巨大而彻底,也指闹得很凶。@",
    "栉风沐雨@借风梳头,借雨洗发,形容奔波劳碌,风雨不避@",
    "呕心沥血@形容苦思寞想,费尽心血,为事业工作、文艺创作用心的艰苦,含义@",
    "鞠躬尽瘁@指不辞辛劳,尽力于国事,形容小心谨慎,贡献出全部精力。@",
    
    
    "不计其数@是没办法计算数目,形容极多。@@6",
    "俯拾皆是@只要低下头来捡取,到处都是,形容多而易得,对象一般食物。@",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@",
    "不可胜数@数也数不过来。形容数量极多。@",
    "浩如烟海@形容典籍、图书等极为丰富。@",
    "数不胜数@数都数不过来。形容数量极多,很难计算。@",
    "数以百计@数量以百来计算.表示数量多。@",
    
    
    "必不可少@是绝对需要的或者不达到某种自的就不能做成某种事情的意思。近义词为不可或缺和至关重要。@@6",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举足：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "不可或缺@不可缺少,引申为非常重要。@",
    "缺一不可@少一样也不行,往往搭配多项内容。@",
    "至关重要@相当地重要,要紧关头是不可缺少,词意比举足轻重来的重@",
    "不口替代@指某人或某物是不能够用他人或他物来进行代替的。@",
    "不可推卸@自己的责任不可推卸成语解释,不能推卸给别人。@",
    
    
    "水涨船高@水位升高,船身也随之浮起。比喻事物随看它所凭借的基础的提高而增长提高。@@6",
    "相形见绌@意为和同类的事物相比较显得不足。@",
    "一日千里@形容马跑得很快,偏重于前进得快,@",
    "居高不下@没有下降的趋势。@",
    "与日俱增@用于人的思想感情,指随着时间的推移而不断增长。@",
    "如影随形@指的是好像影子老是跟着身体。比喻两人事物关系密切或两人人关系密切不能分离@",
    "随波逐流@自己没有立场和主见,只是随着潮流走,含贬义。@",
    
    
    "不知所措@不知道怎么办才好,形容处境为难或心神慌乱。@@6",
    "无所适丛@指不知依从谁才好,也指不知道怎么办才好；在句子中可充当谓语、宾语、定语。@",
    "手足无措@形容举动慌张或无法应付,@",
    "茫然若失@形容心中茫茫然然,像失去了什么。@",
    "倍感泪丧@十分沮丧@",
    "神经错乱@是精神病；精神和思虑迷糊不清,失去常态。@",
    "颠一倒四@形容说话做事错杂紊乱,没有次序。@",
    
    
    "近在咫尺@形容距离很近。@@6",
    "触手可及@指近在手边,一伸手就可以接触到。形容距离极近。@",
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@",
    "唾手可得@指动手就可以取得,比喻极容易得到。@",
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作“活龙活现”。@",
    "一目了然@一眼就看得很清楚。形容事物、事情原委很清晰,一看就知道是怎么回事。@",
    "纸上谈兵@比喻空谈理论,不解决实际问题,含贬义。@",
    
    
    "并驾齐驱@指并排套看的几匹马一齐快跑,比愉彼此的力量或才能不分高下或地位相当。@@6",
    "并行不悖@同时实行,互相之间不冲突。@",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "各有所长@各有各的长处、优点；一般多指人才而言。@",
    "不分彼此@不分这个和那个,形容关系密切,交情深厚。@",
    "化整为零@把一个整体分成许多零散的部分。@",
    "齐头并进@多方面同时前进。多形容几件事情或几项工作同时进行。@",
    
    
    "匠心独运@独创性地运用精巧的心思,强调在文学、艺术等方面。@@6",
    "独树一帜@比喻与众不同,自成一家,多含复义,除用于艺术创作外,还可用于政治、经济等创业道路。@",
    "不落窠日@指比喻不落俗套,有独创风格(多指文章、作品)。@",
    "鬼斧神工@是像是鬼神制作出来的。一般形容建筑、雕塑等的技艺精巧。@",
    "别具一格@意思是比喻另有一种独特的风格,形容别致、新颖的样子,多用于艺术创作。@",
    "天造地设@事物自然形成,合乎理想,不必再加工。@",
    "巧夺天工@形容人的精巧胜过天然,比喻技艺高超巧妙。含义@",
    
    
    "出类拔萃@比喻超过聚在一起的同类人或物,多用于形容才德超出众人之上的人。含义；@@6",
    "出人头地@指高人一等,超出一般人；形容德才超众或成就突出比其他人优秀。含复义；在句中一般作谓语、宾语、定语@",
    "鹤立鸡群@是指像鹤站在鸡群中一样。比喻一个人的仪表或才能在周围一群人里显得很突出@",
    "脱颖而出@比喻有才能的人得到机会,即本领全部显现出来。基本身结构为偏正式,在句子中可充当谓语、宾语、定语,含優义。@",
    "硕果仅存@唯一留存下来的大果子；比喻由于时间的推移,留存下来仅存的人或事物,@",
    "凤毛麟角@比喻难得而宝贵的人或事物。@",
    "遥遥领先@远远地走在最前面,@",
    
    
    "空前绝后@意思是从前没有过,今后也不会再有；弯张性地形容独一无二。在句中作定语。@@6",
    "弥足珍贵@形容十分珍贵、非常珍贵,含褒义。@",
    "迫在眉睫@事情士分紧急,已到眼前。@",
    "举足轻重@一起脚就可以改变两边的重量,使之失去平衡与均势(举足：抬脚)。形容身份或地位特殊,一举一动定以影响全局。@",
    "无与伦比@意思是指事物非常完美,没有能够与它相比的同类的东西@",
    "世人皆知@指很多人都知道@",
    "举世瞩且@全世界的人都注意着。@",
    
    
    "前赴后继@前面的人上去,后面的人就跟上去。形容奋剪前进,连续不断,@@6",
    "勇往直前@勇敢地一直向前进@",
    "薪火相传@意思是比喻学问和技艺代代相传@",
    "心向往之@指对某人或某些事物极为崇敬仰幕。@",
    "魂牵梦绕@)形容万分思念。@",
    "孜孜以求@不知疲倦地探求。@",
    "首尾相接@事物的头和尾连接到一起。@",
    
    
    "水乳交融@是是像水和乳汁那样融合在一起,比喻关系非常融洽或结合得很紧密。@@6",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@",
    "唇齿相依@意思是嘴唇和牙齿互相依靠。比喻双方关系密切,相互依存。@",
    "同舟共济@侧重在困境中同心协力,共同度过难关；多含复义@",
    "浑然一体@合成一个整体,不可分割。也形容文章绘画,布置匀整,结构谨严。@",
    "若合符节@比喻两者完全吻合。@",
    "相映成趣@相互衬托着,显得很有趣味,很有意思。@",
    
    
    "无人问津@比愉没有人来探问、尝试或购实@@6",
    "门可罗雀@大门前面可以张网捕雀。形容门庭冷落,宾客稀少,侧重强调某个地方人少。@",
    "门庭冷落@解释为形容十分冷落,宾客稀少。@",
    "人迹罕至@意思是人的足迹很少到达；指荒凉偏僻的地方。@",
    "销声匿迹@不再公开讲话,不再出头露面,形容隐藏起来不出声不露面。不可作“消声匿迹”。@",
    "匿影藏形@隐藏形迹,不露真相@",
    "无影无踪@没有一点踪影。形容完全消失,不知去向。@",
    
    
    "聚精会神@形容专心致志,注意力高度集中的样子。@@6",
    "专心致志@形容一心一意,精神高度集中地做事。也作“专心一志”。@",
    "全神贯注@全部精神集中在一点上。形容注意力高度集中。@",
    "一本正经@形容庄重严肃,非常认真。多用于贬义。「近道貌岸然@",
    "心无旁骛@意思是心中没有另外的追求。形容心思集中,专心致志@",
    "全心全意@投入全部精力,毫无保留。@",
    "坚定不移@意思是稳定坚强,毫不动摇：不放弃,不改变自己的想法。@",
    
    
    "当仁不让@以仁为任,无所谦让；后指遇到应该做的事就积极主动去做,不推让。@@6",
    "责无旁贷@强调在自己的责任不能推卸给别人。@",
    "义不容辞@强调道义上不容许推辞。@",
    "一马当先@作战时策马冲锋在前。形容领先。也比喻工作走在群众前面,积极带头。@",
    "不可推卸@自己的责任不可推卸成语解释,不能推卸给别人。@",
    "不容置疑@不允许有什么怀疑,表示论证严密无可怀疑。@",
    "必不可少@是绝对需要的或者不达到某种目的就不能做成某种事情的意思。近义词为不可或缺和至关重要。@",
    
    
    "丰富多彩@形容内容丰富,花色繁多。@@6",
    "博大精深@形容思想和学术广博高深。多用于形容理论、学识、思想、作品等广博丰富,深奥精微其形容对象多为某某内容。@",
    "情之所钟@指痴情所向,十分专注。@",
    "生机勃勃@形容生命力旺盛的样子。@",
    "情深意长@形容感情真挚深切绵长,那种感情是言语无法表达的。@",
    "先进发展@发展很先进@",
    "独具匠心@多指技术或艺术方面有创造性。@",
    
    
    "今非昔比@指现在不是过去能比得上的,多指形势、自然面貌等发生了巨大的变化。@@6",
    "今不如昔@指现在不如过去。@",
    "波云诡谲@原形容房屋构造就像云彩、波浪一样十姿白态。后多形容事物变莫测@",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "每况愈下@指越往下越明显,表示情况越来越坏。@",
    "烟消云散@像烟云消散一样。比喻事物消失得干干净净。@",
    
    
    "不言自明@指不用说话就能明白,形容道理很明显,容易理解。@@6",
    "显而易见@事情或道理很明显,极容易看清。@",
    "不言而喻@指不用说就可以明白。形容道理很浅显。@",
    "昭然若揭@形容真相毕露,所有一切都已显现了出来。@",
    "毋庸讳言@指用不着隐违,可以直说的内容。册庸指不用。@",
    "难以预测@难以估计神密莫测@",
    "毋庸置疑@事实明显或理由充分,根本就没有怀疑的余地。@",
    
    
    "春风化雨@指适宜草木生长的风雨,多用在人或事,比喻良好的需陶和教育。@@6",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化,暗示为影响看不到,无形,主体一股是事或物。@",
    "润物无声@指有大胸怀者,做了贡献而不张扬默默奉献。@",
    "耳濡目染@指经常听到看到,不知不觉地受到影响,多用于人,用于好的方面,侧重指技能方面。@",
    "和风细雨@比喻耐心地和颜悦色地批评或劝说。@",
    "谆谆不倦@愿切耐心地教海,不知疲倦。@",
    "暖人心脾@心里感觉温暖@",
    
    
    "无能为力@意思是用不上力量,帮不上忙,指没有能力或力不能及。@@6",
    "鞭长莫及@指虽然鞭子很长,但总不能打到马肚子上,比喻距离太远而无能为力。@",
    "望尘莫及@指只望见前面骑马的人走过扬起的尘土而不能赶上。比喻远远落后,常用作谦词。@",
    "爱莫能助@指虽然心中关切同情,却没有力量帮助；在句子中一般作谓语、定语。@",
    "力不从心@指心中想做某事而力量达不到或无力去做。在包句中一般作谓语、宾语。@",
    "无可奈何@指事已如此,想挽回已无能为力。该成语在句中常作定语、谓语、状语,也作宾语。@",
    "不能自拔@指陷进很深的境地；难以使自己从中解脱出来。@",
    
    
    "独辟蹊径@意思是自己开辟一条路。比喻独创一种新风格或者新方法。@@6",
    "推陈出新@去掉旧事物的糟粕,取其精华,并使它向新的方向发展,侧重强调文化的去粘取精。@",
    "标新立异@故意提出新奇的见解,表示自己与众不同,看重体现在显示特点。@",
    "别具匠心@具有与众不同的巧妙构思,多用于写文章、绘画、工程设计等。@",
    "博学多识@才：才识。识：见识。：少。天资高,但见识少。@",
    "气势恢宏@气势磅,场面大气。@",
    "墨守成规@指思想保守,守着老规矩不肯改变@",
    
    
    "盛气凌人@原义是以骄横的气势压人：形容傲慢自大,气势逼人；在句子中可充当谓语、宾语、定语、状语；含贬义。(感情色彩)贬义@@6",
    "目空一切@形容妄自尊大,一切都不放在眼里。@",
    "狂妄自大@胆大妄为,自以为是。@",
    "仗势欺人@依仗某种权势欺压人。@",
    "吹毛求疵@比喻故意挑剔毛病,寻找差错。@",
    "唠唠叨叨@说话啰嗪,一说起来没完没了。@",
    "居高临下@指处在高处向下俯视,形容地势非常有利,处在有利的地位@",
    
    
    "改头换面@指人的容貌发生了改变。现多比愉只改外表和形式,内容实质不变。@@6",
    "日新月异@指发展或进步迅速,不断出现新事物、新气象,侧重强调进步快、变化快,多形容景象变化之快。@",
    "束之高阁@捆起来以后放在高高的架子上,比喻放看不用、丢在一旁不管,也比把某事或某种主张、意见、建议等搁置起来,不予理踩和办理@",
    "置之脑后@放在一边不再想起。形容极不重视@",
    "弃如敝屣@敝：破旧。屣：鞋子。像抛弃破鞋子一样扔掉。比毫不可惜地抛弃掉。@",
    "顾此失彼@顾了这头,丢了那头。形容照顾不过来。反两全基美面面俱到@",
    "以是而非@指好像是对的,实际上不对；好像是,又好像不是；多用于形容相以而不同但又容易被混渚的事物,含贬义；在句中一般作谓语、定语、状语。@",
    
    
    "防患未然@意思是指在祸患发生之前就加以预防,重在预防。@@6",
    "未雨绸缪@意思是趁着天没下雨,先修缮房屋门窗。比喻事先做好准备工作,预防意外的事情发生,重在准备,侧重已经开始做了,有具体行动@",
    "居安思危@指处在安定的环境中,也要想到可能产生的危难和祸害。仅停留在思想层面,没有具体行动。@",
    "有备无患@事先有准备,就可以避免祸惠(患：祸患,灾难)；在句子中一般充当谓语、定语。@",
    "防微杜渐@指在错误、或坏事刚露出苗头的时候就加以制止,不使其发展。在包句中一般作语、定语、宾语。@",
    "夕惕若厉@朝夕戒惧,如临危境,不敢稍懈。@",
    "常备不懈@时刻准备着,从不松懈。@",
    
    
    "若隐若现@隐隐约约,看不清楚,很难分清。@@6",
    "崭露头角@比喻突出地显示出才能和本领@",
    "蓄势待发@指随时准备进攻。原意是指半尊着的人随时准备站起来冲出去。近义词：厚积薄发反义词：废以待@",
    "初见端倪@意为看到了事件的雏形,有了初步的印象。一般用于指推测事物的始未,@",
    "漫遇不清@模糊不可瓣别、犹迷茫不清@",
    "惊天动地@使天地惊动。形容某个事件的声势或意义极大。@",
    "惊心动魄@原指文辞优美,意境深远,使人感受极深,震动极大。后常形容使人惊孩紧张到极点,@",
    
    
    "半途而废@事情没有完成就放弃了,侧重于“半中途停止,有婉惜之意。@@6",
    "因嘻废食@因为有人吃饭壹死了,就想让天下人都不吃饭。后比喻要做的事情由于出了点小毛病或怕出问题就索性不去于：含贬义。@",
    "功败垂成@事情快要成功时遭到失败(含婉惜意)。@",
    "功亏一篑@后多用于比喻做一件事只差最后一点努力未能完成,多含婉惜之意。@",
    "前功尽弃@指以往的功劳全部废弃。含贬义。@",
    "三心二意@意志不坚定,犹豫不决,也指又想这样又想那样,犹豫不定。@",
    "本末倒置@比喻颠倒了事物的轻重主次。@",
    
    
    "迥然不同@意思是形容差别很大,一点儿也不相同@@6",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同,不同之处很多。@",
    "天差地别@形容两种或多种事物之间的差距很大,就像大和地之间的距离一样。@",
    "泾渭分明@泾河水清,渭河水浑,泾河的水流入渭河时,清浊不混。比界限清楚或是非分明@",
    "水到渠成@比喻条件成熟,事情就会自然成功侧重强调条件成熟。含义@",
    "天壤之别@天和地,一极在上,一极在下。比喻差别极大。@",
    "毫无二致@意思是丝毫没有什么两样,指完全样。@",
    
    
    "沧海一粟@意思是大海里的一粒谷子。比非常小,微不足道。@@6",
    "微不足道@指意义、价值等小得不值得一提。@",
    "一鳞半爪@原指龙在云中,东露一鳞,西露半,看不到它的全貌。比喻零星片段的事物。@",
    "一孔之见@从一个小窟隆里所看到的。比喻狭片面的见解。@",
    "浮光掠影@像水面的光和掠过的影子一样,一晃就消逝,形容印象不深刻。又指文章言论的肤浅,无真知实学。@",
    "无济于事@对事情没有什么帮助或益处,比喻不解决问题。@",
    "螳臂当车@比喻做力量做不到的事情,必然失败；含贬义。@",
    
    
    "取长补短@指在同类事物中吸取这入的长处来弥补那人的短处。含褒义。(感情色彩)褒义@@6",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "群策群力@大家共同想办法,一起出力。形容遇到问题时大家团结一致,共同出力想办法,@",
    "传承文明@传承文明@",
    "集思广益@集中群众的智慧,广泛吸收有益的意见。该成语构词方式是联合式；在句中作谓语、定语、状语。@",
    "珠联壁合@珍珠联串在一起,美玉结合在一块,比喻杰出的人才或美好的事物聚集在一起的美好样子,色彩偏积极。@",
    "相辅相成@指两种事物互相辅助,互相促成,缺-不可,没有1+1>2效果@",
    
    
    "错落有致@形容事物的布局虽然参差不齐,但却极有情趣,使人看了有好感,@@6",
    "鳞次栉比@像鱼鳞和梳子齿那样有次序地排列看,多用来形容房屋或船只等排列得很密很整齐@",
    "参差不齐@原意是长短、高低、大小不一致,形容很不整齐或水平不一。@",
    "纵横绵延@纵横绵延@",
    "巍峨挺拔@形容山或建筑物高大而雄伟。@",
    "婉蜓起伏@弯弯曲曲延伸的样子。@",
    "长短不一@参差不齐的意思。@",
    
    
    "置之不理@放在一边；不予理躲,形容对某人某事十分冷淡,@@6",
    "置若罔闻@放在一边,好像没有听见似的。指不去过问或不予关心,强调不重视,不关心,侧重于听。@",
    "漠然置之@很冷淡地把它搁在一边。指对人或事态度冷淡,放在一边不理。@",
    "充耳不闻@塞住耳柔不听。形容有意不听别人的意见。@",
    "不以为然@不认为是对的@",
    "将信将疑@意思是有点相信,又有点怀疑。@",
    "置之度外@置：搁,放。度：考虑,打算。把它放在考虑之外。指不把它放在心上。@",
    
    
    "美不胜收@美好的东西很多,一时看不过来,@@6",
    "赏心悦目@因看到好的事物而心情欢畅。@",
    "琳琅满目@比喻眼前到处充满了美好的事物。@",
    "美轮美奂@用于形容建筑物雄伟壮观,富丽堂皇；也用来形容雕刻或建筑艺术的精美效果。[3]在句中一般作谓语、定语,@",
    "尽收眼底@指可以把景物全部看在眼里。@",
    "柳暗花明@形容柳树成荫,繁花似锦的春天景象,比喻在曲折艰辛之后,忽然绝处逢生,另有一番情景；在句中可充当作定语、宾语；含優义。@",
    "目不暇接@东西太多,眼睛看不过来。@",
    
    
    "处心积虑@形容蕾谋已久。(感情色彩)贬义@@6",
    "费尽心机@挖空心思,想尽办法@",
    "弹精竭虑@形容用尽精力、费尽心思,一般偏重脑力劳动。@",
    "呕心沥血@形容苦思想,费尽心血,为事业工作、文艺创作用心的艰苦,含褒义。@",
    "精雕细琢@精雕细刻,比喻做事情精益求精,@",
    "绞尽脑汁@形容苦思积虑,费尽脑筋,想尽力法；费尽心思去思考一件事情。@",
    "千方百计@释义是想尽种种办法；用出种种计谋。@",
    
    
    "微乎其微@意思是形容非常小或非常少。@@6",
    "举足轻重@一拾起脚就可以改变两边的重量,使之失去平衡与均势(举足：抬脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "至关重要@相当地重要,要紧关头是不可缺少,词意比举足轻重来的重。@",
    "无关大局@对整个局势没有关系或没有影响。@",
    "微不足道@指意义、价值等小得不值得一提。@",
    "难乎其难@指非常困难。@",
    "难以为继@难以继续下去。@",
    
    
    "同日而语@放在同一时间谈论,指相提并论,@@6",
    "相提并论@把不同的人或不同的事物混在一起谈论或看待,侧重强调共同谈论的事物差别大或不同。@",
    "等量齐观@指对有差别的事物同等看待。@",
    "混为一谈@把本质不同的事物混在一起,当作同样的事物谈论@",
    "同舟共济@侧重在困境中同心协力,共同度过难关；多含复义。@",
    "一视同仁@表示对人同等看待,不分厚薄@",
    "衡短论长@比较、评定事物的优劣。@",
    
    
    "全神贯注@全部精神集中在一点上。形容注意力高度集中。@@6",
    "目不转睛@看东西时眼珠一点都不转动。形容注意力很集中,看得出神。@",
    "心无旁骛@意思是心中没有另外的追求。形容心思集中,专心致志。@",
    "聚精会神@形容专心致志,注意力高度集中的样子。@",
    "屏气凝神@形容注意力高度集中。@",
    "专心致志@形容一心一意,精神高度集中地做事。也作“专心一志”。@",
    "无忧无虑@形容没有什么可忧虑和担心的,心情安然自得。@",
    
    
    "细枝末节@比愉事情或问可题的细小而无关紧要的部分。@@6",
    "蛛丝马迹@从挂下来的蜘蛛丝可以找到蜘蛛的所在,从灶马爬过留下的痕迹可以查出灶马的去向。比愉事情所留下的隐约可寻的痕迹和线索,@",
    "只言片语@作主语、宾语、定语；指很少的话@",
    "真凭实据@真实可靠的凭据。@",
    "一鳞半爪@原指龙在云中,东露一鳞,西露半小,看不到它的全貌。比零星片段的事物。@",
    "考生常谈@老书生经常发表的平凡议论：多用于比喻毫无新意的理论或老话,属中性词。@",
    "似是而非@指好像是对的,实际上不对；好像是,又好像不是；多用于形容相似而不同但又容易被混淆的事物,含贬义；在句中一般作谓语、定语,状语。@",
    
    
    "来势汹汹@形容事物或动作到来的气势盛大,@@6",
    "所向披靡@指力量所到之处,一切障碍全被扫除。此语常用于形容军事或体育竞技中绝无对手的常胜劲旅@",
    "错综复杂@头绪多,情况复杂,作谓语、定语；形容斗争、矛盾等@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    "各有所长@各有各的长处、优点；一般多指人才而言。@",
    "此消彼长@不要太过于在乎此时的失去,别的方面会有长进。什么事情都有两面或者多面性。@",
    "势不可挡@指来势迅猛,不可抵挡。@",
    
    
    "手足无措@形容举动慌张或无法应付。@@6",
    "无所适丛@指不知依从谁才好,也指不知道怎么办才好；在句子中可充当谓语、宾语、定语。@",
    "不知所措@不知道怎么办才好,形容处境为难或心神慌乱。@",
    "顾此失彼@顾了这头,丢了那头。形容照顾不过来。「反两全其美面面俱到。@",
    "独木难支@一根木头支持不住高大的房子,比喻一个人的力量难以支撑全局@",
    "漏洞白出@比喻说话或文章内容没有充足的理由和根据,不能自圆基说的地方很多@",
    "捉襟见肘@指整理一下衣襟,就露出了胳膊肘,形容衣服破烂,生活窘困；也比顾此失彼,究于应付。@",
    
    
    "无可非议@没有什么可以指责的,表示言行合乎情理。可用来形容人、事、思想、行动、品质等@@6",
    "无可厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非@",
    "无懈可击@意思是没有可以被人攻击或桃剔的缝隙形容非常严密@",
    "无可争议@指对一个问题的看法、观点或做法没有其他不同的看法、观点可以辩论、争论和议论。@",
    "无可违言@没有什么不可直说的。表示事情是明摆着的。@",
    "回味无穷@比喻事后越想越觉得意味深长@",
    "不可思议@原为佛教用语,指思想言语所不能达到的境界。后来形容无法想象,很难理解。@",
    
    
    "轰轰烈烈@形容事业的兴旺。也形容声势浩大,气魄宏伟,@@6",
    "如火如荼@比喻军容之盛,现用来形容大规模的行动气势旺盛,气氛热烈。含义@",
    "方兴未艾@事物正在蓬勃发展,不会很快终止强调新事物初级阶段正在蓬勃的发展,偏向积极方向。@",
    "洋洋洒洒@形容文章或谈话丰富明快,连续不断。@",
    "浩浩荡荡@形容人多声势广大的样子,后来形容事物的广阔壮大或前进的人流声势浩大。@",
    "风风火火@形容急急忙忙,冒冒失失的样子@",
    "风起云涌@形容雄浑磅磺之势：也比喻事物迅速发展,声势浩大。@",
    
    
    "一无是处@没有一点儿对的或好的地方,比喻一个人或物没有一点用处。@@6",
    "体无完肤@全身的皮肤没有一块好的。形容遍体都是伤。也比喻理由全部被驳倒,或被批评、责骂得很厉害。@",
    "一塌糊涂@形容混乱或败坏到了不可收拾的程度。@",
    "空中楼阁@指悬在半空中的阁楼,比喻虚幻的事物或脱离实际的空想。该成语构词方式是偏正式；在句中作主语、宾语。@",
    "荡然无存@形容东西完全失去,一点没有留下。@",
    "子虚乌有@表示为假设而非实有的事物,含贬义,在句子中可充当谓语、定语@",
    "面目全非@指面孔变得完全不是原来的样子,也形容事物变化很大。多为贬义@",
    
    
    "千方百计@释义是想尽种种办法；用出种种计谋,@@6",
    "重中之重@比喻一件事是在一些重要的事中最重要的,形容这件事十分重要。@",
    "首当其冲@比喻最先受到攻击或遇到灾难。@",
    "归根结底@是归结到根本上。@",
    "处心积虑@形容蓄谋已久。@",
    "费尽心机@挖空心思,想尽办法。@",
    "弹精竭虑@形容用尽精力、费尽心思,一般偏重脑力劳动。@",
    
    
    "危言耸听@指故意说些弯大的吓人的话,使人惊疑震动@@6",
    "空穴来风@由于广泛的误用,现在多用来指消息和传说毫无根据。@",
    "虚张声势@指大造声势,借以吓人。含贬义；在句中一般作谓语、宾语、定语。@",
    "耸人听闻@指故意夸大或捏造事实,使人听后感到震惊,其“事实“并非如此@",
    "骇人听闻@多指社会上发生的坏事使人吃惊,其事实是客观实际的@",
    "杞人忧天@比喻缺乏根据和不必要的忧虑；主谓式结构；动词性；含有贬义：主要用作谓语、宾语等。@",
    "故弄玄虚@指故意玩弄花招,使人迷惑,无法捉摸。@",
    
    
    "以邻为壑@原义是拿邻国当做大水坑,把本国的洪水排到邻国去。后比喻只图自己一方的利益,把困难或祸害转嫁给别人；在句中可充当谓语、定语；含贬义@@6",
    "削足适履@指把脚削去一块来凑合鞋的大小；比愉不合理地计就凑合或不顾具体条件,生搬硬套。含贬义;@",
    "兄弟阋墙@指兄弟之间的纠纷,也比喻内部争斗。@",
    "自行其道@自己认为对的就做,不考虑别人的意见。@",
    "各行其是@按照各自认为对的去做,指思想不统一,各人按照自己的意见、主张去做,侧重强调做法。@",
    "独善其身@只顾自己,不管他人的个人主义处事哲学。@",
    "两败俱伤@相斗的双方都受到损伤,@",
    
    
    "杞人忧天@上比愉缺乏根据和不必要的忧虑；主请式结构：动词性；含有贬义；主要用作谓语、宾语等。@@6",
    "庸人自扰@指平庸的人无事生事,自找麻烦,自讨烦恼：多用于讽刺惠味或神经过敏的人；主谓式结构；含有贬义：主要用作谓语、宾语等。@",
    "听天由命@听任事态自然发展变化,不做主观努力。也比喻碰机会,该怎么样就怎么样。@",
    "因噎废食@因为有人吃饭嚏死了,就想让天下人都不吃饭。后比愉要做的事情由于出了点小毛病或怕出问题就索性不去于：含贬义。@",
    "患得患失@指担心得不到,得到了又担心失去。后指对于入人的利害得失斤斤计较。该成语在句中多作谓语、定语,也作状语、补语；含贬义@",
    "自找麻烦@自己给自己找麻烦事。@",
    "自怨自艾@是悔恨自己的错误,自己改正。现在只指悔恨自己的错误。@",
    
    
    "高高在上@原指地位高,现在形容领导者脱离实际,脱离群众。@@6",
    "无人能及@没有人能达到这个人所达到的程度。@",
    "鹤立鸡群@是指像鹤站在鸡群中一样。比喻一个人的仪表或才能在周围一群人里显得很突出。@",
    "独当一面@指单独承当一方面的工作或使命；在句子中可充当作谓语、定语、状语；含义。@",
    "空空如也@形容一无所知,也用来形容一无所有。@",
    "一尘不染@原指佛教徒修行时,排除物欲,保持心地洁净。现泛指丝毫不受坏习惯,坏风气的影响。也用来形容非常清洁、干净。@",
    "一无所有@什么都没有。@",
    
    
    "漠然置之@很冷淡地把它搁在一边。指对人或事态度冷淡,放在一边不理。@@6",
    "不闻不问@既不听也不问。重在行动。@",
    "束之高阁@捆起来以后放在高高的架子上,比喻放看不用、丢在一旁不管,也比喻把某事或某种主张、意见、建议等搁置起来,不予理踩和办理。@",
    "置之不理@放在一边；不予理踩,形容对某人某事十分冷淡。@",
    "泰然处之@形容毫不在意,沉着镇定。@",
    "听之任之@意思是任凭事物存在发展而不去过问。@",
    "不屑一顾@意思是认为不值得一看。形容极端轻视。@",
    
    
    "深谋远虑@指计划得很周密,考虑得很长远,@@6",
    "深思熟虑@反复深入细致地考虑。@",
    "直知灼见@意思是真正知道,确实看见。也指正确、深刻而透彻的见解,@",
    "远见卓识@解释为有远大的眼光和卓越的见解。@",
    "肺腑之言@指发自内心的真诚话。@",
    "思前想后@形容对事情发生的缘由、发展后果作再三考虑。@",
    "老谋深算@形容人办事精明老练。@",
    
    
    "侃侃而谈@指理直气壮、从容不迫地说话；在句子中可充当作谓语、定语：含褒义(感情色彩义@@6",
    "娓娓道来@连续不断地说、生动地谈论。形容谈论不倦或说话动听@",
    "滔滔不绝@像流水那样毫不间断。形容说话很多,连续不断。也指连续不断的事物。@",
    "促膝长谈@比喻双方关系亲密。也指双方亲密的谈话而且投机。@",
    "娓娓而谈@娓：说话连续不断而又不知疲倦的样子。形容连续不断地讲话,@",
    "老生常谈@老书生经常发表的平凡议论：多用于比喻毫无新意的理论或老话,属中性词@",
    "纸上谈兵@比喻空谈理论,不解决实际问题,含贬义。@",
    
    
    "触自惊心@看见某种严重情况而内心震惊,形容事态严重,引起轰动,也写作目惊心。@@6",
    "惊心动魄@原指文辞优美,意境深远,使人感受极深,震动极大。后常形容使人惊孩紧张到极点@",
    "毋庸置疑@事实明显或理由充分,根本就没有怀疑的余地。@",
    "惨不忍赌@悲惨得让人不忍心看下去,形容极其悲惨。@",
    "骇人听闻@多指社会上发生的坏事使人吃惊,其事实是客观实际的,@",
    "膛目结舌@瞪眼翘舌说不出话来。形容人窘迫或惊呆的样子。也形容人害怕的表情。@",
    "诚惶诚恐@非常小心谨慎以至达到害怕不安的程度。@",
    
    
    "不相上下@分不出高低、好坏、胜负。形容程度相等。@@6",
    "息息相关@意思是彼此呼吸都相互关联,形容关系非常密切。@",
    "平起平座@比喻彼此地位或权力平等。@",
    "相差无几@彼此没有多大差别。@",
    "并行不悖@同时实行,互相之间不冲突@",
    "双管齐下@比喻做一件事两个方面同时进行或两种方法同时使用。在句中一般作谓语、宾语。@",
    "大同小异@指大体相同,略有差异。@",
    
    
    "刻骨铭心@铬刻在心灵深处：形容记忆深刻,难以忘却@@6",
    "与生俱来@一生下来就是如此。@",
    "根深蒂固@比喻基础稳固,不容易动摇,经常和抽象事物搭配,如：观念、思想,一般适用于较消极的语境。@",
    "气吞斗牛@形容怒气冲天或气势很盛@",
    "难以割舍@形容人对事或人的感情深,难以放弃或分开。@",
    "永生难忘@指一辈子也难以忘怀。@",
    "积重难返@指长期形成的不良的风俗、习惯不易改变。也指长期积累的问题不易解决,@",
    
    
    "循循善诱@善于有步骤地引导、教育。也作“恂恂善诱”。@@6",
    "和风细雨@比喻耐心地和颜悦色地批评或劝说。@",
    "耳濡目染@指经常听到看到,不知不觉地受到影响,多用于人,用于好的方面,侧重指技能方面。@",
    "潜移默化@修饰人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化,暗示为影响看不到,无形,主体一般是事或物。@",
    "推心置腹@原义是把赤诚的心交给人家,比喻真心诚意的待人；含侵义。@",
    "温文尔雅@态度温和,举止斯文。也形容人缺乏斗争性,做事不大胆泼辣。@",
    "因势利导@因势利导指顺着事情发展的趋势向有利的方向引导,与顺水推舟相近。含义@",
    
    
    "情有独钟@指对某人或某件事特别有感情,把自己的心思和感情都集中到他(她/它)上面。作谓语、定语；指专爱@@6",
    "一往情深@对人或对事物倾注了很深的感情向往而不能克制。@",
    "欢呼雀跃@高兴得像麻雀那样跳跃起来。形容十分欢乐的情景@",
    "如痴如狂@形容神态失常,不能自制。亦指为某人某事所倾倒。同“如醉如狂”。@",
    "欣喜若狂@意思是形容高兴、兴奋到了极点。@",
    "乐不思蜀@指快乐得不再思念蜀国：比喻乐而忘返或乐而忘本留恋他乡。含贬义；在句中一般作谓语、定语。@",
    "流连忘返@常形容对美好景致或事物的留恋。@",
    
    
    "寅吃卯粮@意思是形容这一年吃了下一年的粮@@6",
    "饮鸠止渴@比喻用错误的办法来解决眼前的困难而制造出更严重麻烦@",
    "掩耳盗铃@措着自己已的耳朵去偷别人家的铃铛后比愉自己欺骗遍自己,明明是播盖不任的事情偏要想法子掩盖。@",
    "管窥蠡测@指竹孔中观天,所见有限；以飘量海水,所得无几。比喻对事物观察了解狭窄片面。含贬义;@",
    "坐并观天@坐在井里看天,用来比喻眼界小、见识少；该成语在句中可以作谓语、定语,一般用作口语。@",
    "杀鸡取卵@意思是为了要得到鸡蛋,不惜把鸡杀了。比喻资图眼前利益而不顾长远利益。@",
    "唯利是图@指只贪图利益,不顾及其他@",
    
    
    "量体裁衣@指按照身材裁剪衣服；比喻按照实际情况办事。含褒义；在句中一般作谓语、宾语、分句。@@6",
    "点石成金@比愉把不好的文字改好@",
    "有的放矢@放箭要对准靶子。比喻说话做事有针对性。@",
    "单刀直入@比喻认定目标,勇猛精进；后比喻说话直截了当,不绕弯子@",
    "随机应变@随着情况的变化灵活机动地应付,形容临事能妥善变通处置。含义@",
    "随遇而安@指处于各种环境都能安心自在@",
    "量力而行@指按照自己能力大小去做事,在句子中可充当谓语,也作“量力而为”。@",
    
    
    "各有所长@客有客的长处、优点；一般多指人才而言。@@6",
    "并驾齐驱@指并排套看的几匹马一齐快跑,比喻彼此的力量或才能不分高下或地位相当,@",
    "不分彼此@不分这个和那个,形容关系密切,交情深厚。@",
    "化整为零@把一人整体分成许多零散的部分。@",
    "如影随形@指的是好像影子老是跟看身体。比喻两人事物关系密切或两人关系密切不能分离。@",
    "并行不悖@同时实行,互相之间不冲突。@",
    "不可或缺@不可缺少,引申为非常重要。@",
    
    
    "随遇而安@指处于各种环境都能安心自在@@6",
    "随波逐流@自已没有立场和主见,只是随看潮流走,含贬义。@",
    "知足常乐@知道满足,就总是快乐。形容对已经取得的成就感到满足并取得快乐。@",
    "未雨绸缪@意思是趁着天没下雨,先修房屋门窗。比愉事先做好准备工作,预防意外的事情发生重在准备,侧重已经开始做了,有具体行动@",
    "居安思危@指处在安定的环境中,也要想到可能产生的危难和祸害。仅停留在思想层面,没有具体行动。@",
    "人云亦云@别人说什么,自己也跟着说什么。形容没有主见,随声附和,含贬义色彩,通常搭配人。@",
    "亦步亦趋@指学生紧紧追随老师：比喻没有主见,处处追随模仿的意思。含贬义@",
    
    
    "事半功倍@形容做事的方法费力大,收效小,@@6",
    "适得其反@恰恰得到与预期相反的结果。@",
    "于事无补@指对事情没有什么益处。常用来表示所做之事对真正需要完成的事情没有帮助。@",
    "事与愿违@事情的发展与愿望相反,指事情没能按照预想的方向发展。@",
    "针锋相对@比喻双方在策略、论点及行动方式等方面尖锐对立。强调彼此对立。@",
    "南辕北辙@该成语比喻行动和自的正好相反。强调方向不对,一般是一个人,含贬义。@",
    "削足适履@指把脚削去一块来凑合鞋的大小；比愉不合理地迁就凑合或不顾具体条件,生搬硬套。含贬义;@",
    
    
    "煞费苦心@形容费尽心思、费尽心机：同费尽心机、宴思苦想词义。@@6",
    "绞尽脑汁@形容苦思积虑,费尽脑筋,想尽力法；费尽心思去思考一件事情。@",
    "呕心沥血@形容苦思寞想,费尽心血,为事业、工作、文艺创作用心的艰苦,含優义。@",
    "弹精竭虑@形容用尽精力、费尽心思,一般偏重脑力劳动。@",
    "推陈出新@去掉旧事物的糟粕,取其精华,并使它向新的方向发展,侧重强调文化的去粘取精,@",
    "深谋远虑@指计划得很周密,考虑得很长远。@",
    "处心积虑@形容蕾谋已久。@",
    
    
    "不一而足@指同类的事物不止一个而是很多,无法列举齐全@@6",
    "不胜枚举@意思是指无法一一全举出来,形容数量很多。@",
    "比比皆是@到处都是,形容极其常见,对象可是物,也可是人。@",
    "屡见不鲜@多次见到,已经不新奇了,通常指不好现象。「近司空见惯。@",
    "数不胜数@数都数不过来。形容数量极多,很难计算。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    "至关重要@相当地重要,要紧关头是不可缺少,词意比举足轻重来的重。@",
    
    
    "缺一不可@少一样也不行,往往搭配多项内容。@@6",
    "举足轻重@一抬起脚就可以改变两边的重量,使之失去平衡与均势(举定：拾脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "至关重要@相当地重要,要紧关头是不可缺少,词意比举足轻重来的重。@",
    "必不可少@是绝对需要的或者不达到某种自的就不能做成某种事情的意思。近义词为不可或缺和至关重要@",
    "供不应求@供应的东西不能够满足需要@",
    "千金难买@形容某物的珍贵,不能用金钱买到。@",
    "难能可贵@做到了难做之事,十分可贵。@",
    
    
    "模棱两可@指对一件事情没有明确的态度或主张(模棱：意见或态度不明确。两可：这样也可以,那样也可以)。该成语在句中可作谓语、状语、定语、补语；多含贬义。@@6",
    "不置可否@不说可以,也不说不可以。指不表明态度。@",
    "语焉不详@指虽然提到了,但说得不详细@",
    "变幻无常@变化多端,令人难以预料。@",
    "捉摸不定@意思是估量不透。@",
    "高深莫测@是山川高而且深,无法测量；后引申为人或事深沉不可测,使人难以理解；在句子中可充当作谓语、定语；含贬义。@",
    "不言而喻@指不用说就可以明白。形容道理很浅显。@",
    
    
    "高屋建瓴@在很高的屋顶上把水瓶里的水倒下来,比愉居高临下,势不可当。在现代汉语中指对事物把握全面,了解透彻。该成语结构为偏正式；在句中作谓语、定语。@@6",
    "鞭辟入里@形容做学问切实。今多形容说明问题透彻,切中要害@",
    "恰如其分@一指说话办事不过分：二指办事或说话十分恰当合适。@",
    "一针见血@比喻说话直截了当,切中要害。@",
    "侃侃而谈@指理直气壮、从容不迫地说话；在句子中可充当作谓语、定语；含優义。@",
    "高瞻远瞩@站得高,看得远。比眼光远大@",
    "见微知著@指见到事情的苗头,就能知道它的实质和发展趋势。比喻小中见大、以小见大,@",
    
    
    "来之不易@得到它不容易：表示财物的取得或事物的成功是不容易的。@@6",
    "翻天覆地@形容变化巨大而彻底,也指闹得很凶。@",
    "难能可贵@做到了难做之事,十分可贵。@",
    "开天辟地@第一种意思是指开辟天地,艰苦创业,多形容创造了空前宏伟的事业；第二种意思是指以前以未有过,有史以来第一次。在句中作谓语,定语。@",
    "筚路蓝缕@指驾着简陋的柴车,穿着破烂的衣服去开辟山林道路。形容创业的艰苦。@",
    "有目共睹@形容人人都可以看到,极其明显@",
    "前所未有@从来没有过的。@",
    
    
    "老生常谈@老书生经常发表的平凡议论：多用于比喻毫无新意的理论或老话,属中性词,@@6",
    "见仁见智@对同一个问题,不同的人从不同的立场或角度有不同的看法。@",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    "无稽之谈@毫无根据的说法。@",
    "陈词滥调@形容语言陈腐、空泛,含贬义。@",
    "侃侃而谈@指理直气壮、从容不迫地说话；在句子中可充当作谓语、定语；含優义。@",
    "纸上谈兵@比喻空谈理论,不解决实际问题,含贬义。@",
    
    
    "耸人听闻@指故意夸大或捏造事实,使人听后感到震惊,事实并非如此。@@6",
    "虚张声势@指大造声势,借以吓人。含贬义；在句中一般作谓语、宾语、定语。@",
    "危言耸听@指故意说些夸大的吓人的话,使人惊疑震动。@",
    "骇人听闻@多指社会上发生的坏事使人吃惊,其事实是客观实际的,@",
    "空穴来风@由于广泛的误用,现在多用来指消息和传说毫无根据。@",
    "捕风捉影@逮住风,抓住影子,后指不可能做到的事,比喻说话做事没有确切的事实根据,无事生非；含贬义。@",
    "铺天盖地@形容来势猛,声势大,到处都是。@",
    
    
    "触手可及@指近在手边,一伸手就可以接触到。形容距离极近。@@6",
    "近在咫尺@形容距离很近。@",
    "栩栩如生@比喻画作、雕塑中的艺术形象等生动逼真,就像活的一样。@",
    "一目了然@一眼就看得很清楚。形容事物、事情原委很清晰,一看就知道是怎久回事。@",
    "活灵活现@形容非常生动逼真,使人好像亲眼看到一样。也作“活龙活现”。@",
    "应有尽有@意思是应该有的都有。形容十分齐备。@",
    "扑面而来@朝着你的方向过来。@",
    
    
    "闻名遐迩@形容名声很大,主要指远近闻名,崭露头角@@6",
    "闻名于世@全世界都知道,无人不知无人不晓。形容非常著名。@",
    "引人瞩目@引起,吸引,瞩目：注视,指吸引人们注意,含复义。@",
    "绝冠天下@绝冠天下@",
    "如雷贯耳@响亮得像需声传进耳朵里。形容人的名声大。@",
    "声名鹊起@形容名声突然大振,知名度迅速提高。@",
    "风靡一时@形容一个事物在一个时期非常盛行像风吹倒草木一样。@",
    
    
    "审时度势@仔细研究并估计时势的特点和变化,@@6",
    "因势利导@因势利导指顺看事情发展的趋势向有利的方向引导,与顺水推舟相近。含复义@",
    "度德量力@指正确估量自己的德行和能力@",
    "统筹兼顾@统一筹划,全面照顾。@",
    "耳提面命@“耳提”提着耳朵叮嘱；“面命”当面指教,容教殷切。多指(长辈对晚辈、上级对下级)切地教导。@",
    "蒙以养正@指从童年开始,就要施以正确的教育。@",
    "番时度势@审度时势。@",
    
    
    "功亏一篑@后多用于比愉做一件事只差最后一点努力未能完成,多含婉惜之意。@@6",
    "功败垂成@事情快要成功时遭到失败(含婉惜意)。@",
    "前功尽弃@指以往的功劳全部废弃。含贬义。@",
    "无功而返@指没有任何成效而回来。@",
    "半途而废@事情没有完成就放弃了,侧重于“半中途停止,有婉惜之意。@",
    "马失前蹄@本指马匹奔跑时前蹄弯折：后引申为失算、栽跟斗。@",
    "一败涂地@一旦失败就肝脑涂染遍地,形容惨败；后用于溃败的不可收拾。含贬义；在句中一般作谓语、定语、补语。@",
    
    
    "喧宾夺主@指客人的声音压倒了主人的声音。比喻外来的或次要的事物占据了原有的或主要的事物的位置@@6",
    "断章取义@指不顾全篇文章或谈话的内容,只根据需要孤立地取其中一段或一句的意思。@",
    "大惊小怪@形容对没有任么了不起的事情过分惊诉。@",
    "小题大做@比喻人将小事视为大事办理,有故意号张的意思；在句子中可充当谓语、宾语；常用在否定句、反语句里；含贬义。@",
    "反客为主@指客人反过来成为主人。比喻变被动为主动或变次要为主要。@",
    "主客颠倒@比喻事物轻重大小颠倒了位置。@",
    "太阿倒持@比喻把权柄给人家,自己已反而受到威胁或祸害。@",
    
    
    "痛心疾首@指对人或事的痛恨,也指对自己所犯错误的悔恨；在句子中可充当谓语、状语、补语；也作“疾首痛心”。作谓语、状语、补语。@@6",
    "咬牙切齿@形容痛恨到极点的样子,指痛恨的表情。@",
    "始料未及@没有想到的,在意料之外的@",
    "啼笑皆韭@形容处境尴尬或既令人难受又令人发笑的行为。@",
    "匪夷所思@形容人的思想、言谈、技艺、事情等离奇,超出寻常,指言谈行动离奇古怪,超出常情,不是一般人根据常理所能想象的。@",
    "首当其冲@比喻最先受到攻击或遇到灾难@",
    "焦头烂额@头部被火烧伤的样子。比喻情状或境遇非常狼狐窘迫。@",
    
    
    "功败垂成@事情快要成功时遭到失败(含婉惜意)。@@6",
    "功亏一篑@后多用于比喻做一件事只差最后一点努力未能完成,多含婉惜之意。@",
    "前功尽弃@指以往的功劳全部废弃。含贬义。@",
    "半途而废@事情没有完成就放弃了,侧重于“半中途停止,有婉惜之意。@",
    "力所不及@凭自己已的力量不能做到。@",
    "不可端倪@找不着头绪,形容变化莫测。@",
    "难以名状@无法用语言形容。@",
    
    
    "一步登天@一步跨上青天,比一下子就达到很高的境界或程度,有时也用来比喻人突然得志,爬上高位@@6",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易。@",
    "一日千里@形容马跑得很快,偏重于前进得快@",
    "一劳永逸@辛苦一次,把事情办好,以后就可以不再费力了。@",
    "后来居上@原指资历浅的反而位在资历长的之上；现在多用来比喻后来的人和事,进步很快,赶上或超过了先前的；主谓式结构；在句中一般作谓语、定语。@",
    "反客为主@指客人反过来成为主人。比喻变被动为主动或变次要为主要。@",
    "登堂入室@登上厅堂,进入内室。比喻学问或技能从浅到深,达到很高的水平。@",
    
    
    "顺水推舟@意思是制定计谋策略。多指为人出主意。@@6",
    "建言献策@陈述主张或意见,通过口头或文章提出的有益的意见,出谋划策,进献计策。@",
    "添砖加瓦@原来指建房屋时给不断地添砖块加瓦片。后比喻做一些工作,尽一点力量。@",
    "竭尽全力@用尽全部力量,一般是体力劳动。@",
    "精益求精@形容追求好上加好,永无止境@",
    "运筹帷幄@指在帐幕中谋划军机,拟定作战策略。含复义；在句中一般作谓语、定语@",
    "指点迷津@针对事物的困难处,提供解决的方向、办法或途径。@",
    
    
    "全力以赴@把全部力量都用上去。@@6",
    "精雕细刻@意思是精心细致地雕刻：形容创作艺术品时的苦心刻画；也比喻认真细致地加工@",
    "全心全意@投入全部精力,毫无保留@",
    "不遗余力@不遗余力指把所有的力量都使出来一点也不保留。@",
    "全权代理@全权代理@",
    "求全责备@指苛责别人,要求完美无缺。联合式：作谓语、定语；含贬义。@",
    "包办代替@指把所有工作一手包揽,不让旁人参与。@",
    
    
    "唯利是图@指只贪图利益,不顾及其他,@@6",
    "杀鸡取卵@意思是为了要得到鸡蛋,不惜把鸡杀了。比愉资图眼前利益而不顾长远利益。@",
    "寅吃卯粮@意思是形容这一年吃了下一年的粮。@",
    "暴殄天物@指残害灭绝天生万物。后指任意糟踪东西,不知爱惜。@",
    "利欲熏心@贪财图利的欲望迷住了心窝。@",
    "急功近利@指急于追求成效,贪图眼前利益。含贬义@",
    "急于求成@形容急看要取得成功。@",
    
    
    "吹毛求疵@比愉故意挑剔毛病,寻找差错。@@6",
    "盛气凌人@原义是以骄横的气势压人：形容傲慢自大,气势逼人；在句子中可充当谓语、宾语、定语、状语；含贬义。@",
    "唠唠叨叨@说话啰嗪,一说起来没完没了@",
    "居高临上@指处在高处向下俯视,形容地势非常有利,处在有利的地位@",
    "明察秋毫@本义为视力好到能瓣秋天鸟鲁的细毛；后多形容人精明,自光敏锐,能洞察一切；多含义。@",
    "洞若观火@强调观察事物非常清楚,好像看火一样,侧重的是理性而非想象力。@",
    "且光如炬@眼光像火炬那样亮,形容见识高明远大。@",
    
    
    "姹紫嫣红@指各种色彩艳丽的花。@@6",
    "千姿百态@形容姿态多种多样或种类十分丰富。@",
    "千变万化@比喻变化很多,在句子中一般充当谓语、定语。@",
    "千娇百媚@形容女子姿态神情极为美丽动人。@",
    "风光旖旅@风光：景色。旖旅：柔美。形容景色柔和优美。@",
    "生机勃勃@形容生命力旺盛的样子。@",
    "阿娜多姿@各种轻盈软美的姿态。形容女性轻盈柔美。@",
    
    
    "众望所归@用于形容某人威望很高,受到大家敬仰和信赖。@@6",
    "势在必行@不能躲开或回避；从事情发展的趋势看,必须采取行动@",
    "不负众望@指为人所信服,很争气,不辜负大家的期望。@",
    "实至名归@有了真正的学识、本领或功业,自然就有声誉。@",
    "刻不容缓@指形势紧迫,一刻也不允许拖延@",
    "风生水起@风从水面吹过,水面掀起波澜。形容事情做得有生气,蓬勃兴旺。@",
    "板上钉钉@比喻事情已经决定,不能改变或事情已经成了事实@",
    
    
    "精雕细刻@意思是精心细致地雕刻：形容创作艺术品时的苦心刻画：也比喻认真细致地加工@@6",
    "巧夺天工@形容人的精巧胜过天然,比喻技艺高超巧妙。含蔓义@",
    "返璞归真@指除去外饰,恢复原来的质朴状态回复淳补的本性。它在句子中可作谓语、定语@",
    "一丝不苟@形容办事认真；连最细微的地方也不马虎。@",
    "纤毫毕现@纤毫：细小的毫毛。毕：全,都。形容极细小的部分都显现出来了。@",
    "鬼斧神工@是像是鬼神制作出来的。一般形容建筑、雕塑等的技艺精巧@",
    "匠心独运@独创性地运用精巧的心思,强调在文学、艺术等方面。@",
    
    
    "畏首畏尾@形容做事胆子小,顾虑重重@@6",
    "固步自封@比喻守着老一套,不求进步。@",
    "铤而走险@指无路可走的时候采取冒险行动。含义；在句中一般作谓语、定语、补语。@",
    "误入歧途@指由于受煽惑而走上了错误的道路@",
    "坐失良机@指不主动及时行动而失去好机会。@",
    "忍气吞声@受了气勉强忍耐：把话压在肚子里不敢说出来。【反】扬眉吐气。@",
    "瞻前顾后@原形容做事谨慎,考虑周到。后多形容顾虑过多,犹豫不决@",
    
    
    "管中窥豹@比愉只见到事物的一小部分,推测全貌。含贬义。@@6",
    "一叶知秋@比喻通过个别的细微的迹象,可以看到整入形势的发展趋可与结果：一般股在句中充当定语。@",
    "居安思危@指处在安定的环境中,也要想到可能产生的危难和祸害。仅停留在思想层面,没有具体行动。@",
    "高谈弘论@高深空洞不切实际的谈论,@",
    "高瞻远瞩@站得高,看得远。比喻眼光远大。@",
    "略知一二@略：略微。一二：指少的数量。稍微知道一点儿。多为自谦之语。@",
    "冰山一角@一般指非常大的事物只显露出很小的一部分,既可以作复义,也可以作贬义。@",
    
    
    "一针见血@比愉说话直截了当,切中要害。@@6",
    "鞭辟入里@形容做学问切实。今多形容说明问题透彻,切中要害。@",
    "一语中的@指一句话就说中要害。一句话就说清了事情的重点。@",
    "恰如其分@一指说话办事不过分；二指办事或说话十分恰当合适。@",
    "高屋建瓴@在很高的屋顶上把水瓶里的水倒下来,比喻居高临下,势不可当。在现代汉语中指对事物把握全面,了解透彻。该成语结构为偏正式；在右中作谓语、定语。@",
    "不药而愈@不吃药,病就好了@",
    "对症下药@医生针对患者病症用药,后比喻针对事物的问题所在,采取有效的措施；含侵义,@",
    
    
    "一览无余@一眼望去就看得很清楚,毫无遗漏,@@6",
    "一目了然@一眼就看得很清楚。形容事物、事情原委很清晰,一看就知道是怎么回事。@",
    "淋漓尽致@形容文章或说话表达得非常充分、透彻。也可形容非常痛快。@",
    "一览而尽@指一眼望去,事物就都收入眼底@",
    "一目千里@原意指视力好.眼睛看得远。意指：某人有先见之明。@",
    "酣畅淋漓@形容非常畅快、舒适。常指文章绘画,文艺作品感情饱满,笔意流畅,情感得到充分打发。@",
    "毫无保留@一点都没有剩余。指全盘托出。@",
    
    
    "心悦诚服@诚心诚意地服从或佩服。「近五体投地。「反满腹狐疑。@@6",
    "心甘情愿@心里完全愿意,没有勉强。多指自愿做出某种牺牲。@",
    "身临其境@指亲身面临那种境地；也作身历其境。@",
    "耳濡目染@指经常听到看到,不知不觉地受到影响,多用于人,用于好的方面,侧重指技能方面。@",
    "心服首肯@心里信服,并点头同意。@",
    "肃然起敬@形容对某人或某件事产生了敬佩之情。偏正式；作谓语、定语；含义。@",
    "望尘莫及@指只望见前面骑马的人走过扬起的尘土而不能赶上。比喻远远落后,常用作谦词。@",
    
    
    "引人注目@形容人或事物很具特色,引起人们的注意。@@6",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    "独树一帜@比喻与众不同,自成一家,多含褒义,除用于艺术创作外,还可用于政治、经济等创业道路。@",
    "经久不衰@精神饱满的状态,身体健壮的外表；形容某事或某人经历很长时间仍旧保持较高的旺盛状态。@",
    "别出心裁@表示与众不同的新观念或办法。用来形容诗文、美术、建筑等的构思设想独具一格,与众不同。@",
    "雄心勃勃@形容理想和抱负非常远大。@",
    "广为人知@流传很广,大家都知道。@",
    
    
    "孤芳自赏@指自命清高,自我欣赏的人。也指脱离群众,自以为了不起。@@6",
    "顾影自怜@回头看看自己的影子,怜惜起自己来；形容孤独失意的样子,也指自找欣赏。@",
    "阳春白雪@指战国时代楚国的较高雅的歌曲后比喻高深的不通俗的文学艺术。@",
    "闭门造车@关上门造车,比喻只凭主观办事,不管客观实际。@",
    "自命清高@自认为清雅高洁,不屑与世俗同流合污。@",
    "曲高和寡@比喻言论或作品不通俗,能了解的人很少,用于消极语气。@",
    "凄风苦雨@形容天气恶劣,后用来比喻境遇悲惨凉。@",
    
    
    "不堪重负@承受不了繁重的负荷,不能担当重任,指在经济上或别的方面无法承受@@6",
    "捉襟见肘@指整理一下衣襟,就露出了胳博肘形容衣服破烂,生活困；也比顾此失彼,穷于应付。@",
    "寥寥无几@容数量很少,没有几个。@",
    "人满为患@因人多而造成问题或麻烦@",
    "顾此失彼@顾了这头,丢了那头。形容照顾不过来。反两全其美面面俱到。@",
    "望尘莫及@指只望见前面骑马的人走过扬起的尘土而不能赶上。比喻远远落后,常用作谦词。@",
    "心力交瘁@精神和体力都极度疲劳@",
    
    
    "相濡以沫@比喻同处患难中的人能够相互扶持,给予力量,甚至彼此维系生命。后常被用来比喻比喻同处困境,相互救助。含褒义。@@6",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "同甘共苦@共同享受欢乐幸福,共同承担祸患苦难(甘：甜)；在句中可充当谓语、定语、状语；含褒义。@",
    "生死与共@与共：在一起。生和死都在一起。比喻关系极其密切。@",
    "同舟共济@侧重在困境中同心协力,共同度过难关：多含义。@",
    "相生相伴@相生相伴@",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@",
    
    
    "大放异彩@闪耀看无比灿烂的光辉,散发出奇异的光彩或色彩。比愉有看优异的表现是突出的成就@@6",
    "历久弥新@指经历长久的时间而更加鲜活,更加有活力,更显价值。或者是指一样东西不因时间而变旧,变腐,反而更加有活力,更显价值,比新的还要好。@",
    "与日俱增@用于人的思想感情,指随着时间的推移而不断增长。@",
    "如日中天@比喻事物正发展到最兴盛的阶段。@",
    "崭露头角@比突出地显示出才能和本领。@",
    "奇情异彩@奇情异彩@",
    "大方光芒@大方光芒@",
    
    
    "卓有成效@有卓著的成绩和效果。@@6",
    "立竿见影@指在阳光下竖起竹竿,立刻就看到了竹竿的影子。词意比喻行事能马上看到效果或付出能马上得到收获。常与“效应“搭配@",
    "行之有效@意思是实行起来有成效；指某种方法或措施已经实行过,证明很有效用。@",
    "胸有成竹@指画竹前竹子的完美形象已在胸中；比喻处埋事情之前已有完整的谋划打算；在句中一般作谓语、定语、状语@",
    "必不可少@是绝对需要的或者不达到某种自的就不能做成某种事情的意思。近义词为不可或缺和至关重要。@",
    "水到渠成@比喻条件成熟,事情就会自然成功侧重强调条件成熟。含义：@",
    "有条不紊@形容做事、说话有条有理,丝毫不乱@",
    
    
    "明日黄花@过时或无意义的事物。@@6",
    "不刊之论@比不能改动或不可磨灭的言论,用来形容文章或言辞的精准得当,无懈可击@",
    "泛泛之谈@泛泛：浮浅不深入。一般化地泛泛地谈谈。@",
    "齿牙余论@微末的赞扬言辞,比喻不费力的奖励的话。@",
    "时过境迁@境：环境,境遇。迁：改变。时间过去了,事情也跟看发生了变化。@",
    "昨日黄花@原指重阳过后逐渐菱谢的菊花,后多比喻过时的东西。@",
    "陈年往事@陈年往事@",
    
    
    "不足挂齿@表示不值得一提@@6",
    "微不足道@指意义、价值等小得不值得一提,@",
    "嗤之以鼻@用鼻子声冷笑,形容对某事物或种现象的轻曦。侧重强调看不上、瞧不起、体现出视之意。@",
    "不屑一顾@思是认为不值得一看。形容极端轻视。@",
    "谨小慎微@意思是过分小心谨慎,缩手缩脚,不敢放手去做。@",
    "不容赘述@不容赘述@",
    "大相径庭@强调两人事物相差很远、彼此有矛盾,大不相同,不同之处很多。@",
    
    
    "变本加厉@意思是指比原来更加发展。现指情况变得比本来更加严重。@@6",
    "愈演愈烈@意思为指事情、情况等越加恶化、严重。@",
    "良莠不齐@旧版只能指人,现在可以指好的坏的事物混杂在一起。@",
    "竭泽而渔@指把池塘里的水抽干了捉鱼：比喻做事只顾眼前的利益,丝毫不为以后打算。含贬义；在包句中一般作谓语、宾语、定语。@",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义。@",
    "为虎作伥@被老虎吃掉的人变成长鬼,专门给老虎带路去吃别人。用来比喻做恶人的帮凶。@",
    "小题大做@比喻人将小事视为大事办理,有故意夸张的意思；在句子中可充当谓语、宾语；常用在否定句、反请句里；含义。@",
    
    
    "不合时宜@指不符合当时的需要或情况。@@6",
    "不切实际@不符合现实状况或需要@",
    "信口开河@比喻随口乱说一气,指说话没有根据,不可靠。@",
    "言不及义@形容说适内容无聊或说不到问题的关键所在。也指只说些无聊的话,不涉及正经道理@",
    "俗不可耐@庸俗得让人无法忍受@",
    "不可思议@原为佛教用语,指思想言语所不能达到的境界。后来形容无法想象,很难理解。@",
    "格格不入@形容彼此思想不协调,想法不相容不体现对立关系。@",
    
    
    "返璞归真@指除去外饰,恢复原来的质朴状态,回复淳朴的本性。它在句子中可作谓语、定语。@@6",
    "精雕细刻@意思是精心细致地雕刻；形容创作艺术品时的苦心刻画；也比喻认真细致地加工@",
    "一丝不苟@形容办事认真：连最细微的地方也不马虎。@",
    "纤毫毕现@纤毫：细小的毫毛。毕：全,都。形容极细小的部分都显现出来了。@",
    "别出心裁@表示与众不同的新观念或办法。用来形容诗文、美术、建筑等的构思设想独具一格,与众不同。@",
    "推陈出新@去掉旧日事物的糟粕,取其精华,并使它向新的方向发展,侧重强调文化的去取精。@",
    "标新立异@故意提出新奇的见解,表示自己与众不同,看重体现在显示特点。@",
    
    
    "形同虚设@形式上虽有,却不起作用@@6",
    "销声匿迹@不再公开讲话,不再出头露面,形容隐藏起来不出声不露面。不可作“消声迹”。@",
    "荡然无存@形容东西完全失去,一点没有留下。@",
    "不名一钱@指一个钱也没有；形容贫穷到了极点。@",
    "不攻目破@不用攻击就自动破灭,形容情节、论点虚谬,经不起反驳、攻击。@",
    "后继无人@意思是没有后人来继承前人的事业。@",
    "难以为继@难以继续下去。@",
    
    
    "突如其来@意思是出乎意料地突然发生,@@6",
    "猝不及防@形容事情来得突然,来不及防备。@",
    "出乎意料@超出人们的料想之外。@",
    "无孔不入@比喻有空子就钻,不放过任何一个机会,多指做坏事。@",
    "一步到位@形容办事情讲进究于净利落,不拖泥带水,一下子就做到事情所要求的结果,达到极高的境界和某种程度。@",
    "翻天覆地@形容变化巨大孟彻底,也指闹得很凶。@",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易@",
    
    
    "纷繁芜杂@形容文章内容芜杂,没有条理,或者是事情杂乱无章,没有头绪。@@6",
    "林林总总@形容杂乱众多。形容人或事物众多只体现多之意。@",
    "琳琅满目@比喻眼前到处充满了美好的事物。@",
    "标新立异@故意提出新奇的见解,表示自己与众不同,看重体现在显示特点。@",
    "浩如烟海@形容典籍、图书等极为丰富。@",
    "汗牛充栋@指用牛运书,牛要累得出汗；用屋子放书,要放满整入屋子。形容藏书很多。@",
    "鳞次栉比@像鱼鳞和梳子齿那样有次序地排列看,多用来形容房屋或船只等排列得很密很整齐。@",
    
    
    "买椟还珠@指买了装了珍珠的木更退还了珍珠：比愉取舍不当,次要的东西比主要的还要好。在句中作谓语、宾语、定语；@@6",
    "缘木求鱼@比喻行事的方向、方法不对,必将劳而无功,含贬义。@",
    "掩耳盗铃@捂着自己的耳朵去偷别人家的铃铛后比喻自己欺骗自己,明明是掩盖不住的事情偏要想法子掩盖。@",
    "邯郸学步@比喻一味地模仿别人,不仅没学到本事,反而把原来的本事也去了。@",
    "刻舟求剑@一般比喻死守教条,拘泥成法,固执不变通的人。在句子中多作谓语、定语或状语,多含贬义。@",
    "囫囵吞枣@原指把枣整个咽下去,不加咀嚼,不辨滋味；比喻对事物不加分析思考。含贬义。@",
    
    
    "顺水推舟@意思是顺着水流的方向推船,比喻顺着某个趋势或某种方式说话办事。@@6",
    "因势利导@因势利导指顺着事情发展的趋势向有利的方向引导,与“顺水推舟“相近。含褒义@",
    "济困扶危@指扶助有危难,救济困苦的人。@",
    "锦上添花@指在有彩色花纹的丝织品上再绣上花朵。比喻美上加美,喜上加喜。在句中作谓语、宾语、补语；含侵义@",
    "见缝插针@比喻尽量利用一切可以利用的空间时间或机会。@",
    "顺其自然@意思是顺着事物本来的性质自然发展。@",
    "举一反三@举一例便能够推知其他的,侧重于理解知识。@",
    
    
    "板上钉钉@比愉事情已经决定,不能改变或事情已经成了事实。@@6",
    "不可更改@就是不能改,想改也改不了。或者改后就是错误。@",
    "翘首以待@形容殷切盼望。@",
    "雷打不动@形容态度坚定,不可动摇。也形容严格遵守规定,决不变更。@",
    "天经地义@指天地间理所当然而不能改变的道理；也指理所当然,不容置疑的问题；含侵义,@",
    "人之常情@指人们通常有的感情或想法。也作人情之常。@",
    "顺水人情@利用机会顺便给人的好处。也指不费力的人情。@",
    
    
    "沁人心脾@原指芳香凉爽的空气、饮料或花香便人感到舒适也形容诗歌和文章优美动人,给人清新爽朗的感觉,@@6",
    "心旷神怡@心情愉快,精神舒畅。@",
    "神清气爽@形容人头脑清醒,心情畅快。@",
    "美轮美奂@用于形容建筑物雄伟壮观,富丽堂皇；也用来形容雕刻或建筑艺术的精美效果。[3]在句中一般股作谓语、定语。@",
    "乐以忘忧@因快乐而忘掉了忧愁。@",
    "言犹在耳@说的话还在耳边：形容对人家说的话还记得清清楚楚@",
    "赏心悦目@因看到好的事物而心情欢畅。@",
    
    
    "删繁就简@意思是去掉删除繁杂部分,使它趋于简明。(感情色彩)豪义@@6",
    "触类旁通@指掌握了某一事物的知识或规律,进而推知同类事物的知识或规律；常用于学习方面。侧重于掌握知识和技能。@",
    "出神入化@形容文学艺术或技艺高超达到了绝如的境界,还形容超脱了神通达到了自由国度的境界。@",
    "举一反三@举一例便能够推知其他的,侧重于理解知识。@",
    "言简意赅@形容说话写文章简明抛要。@",
    "去伪存真@意思是除掉虚假的,留下真实的。@",
    "去粗取精@除去杂质,留取精华。@",
    
    
    "周而复始@转了一圈又一圈,不断循环,从起点开始又回到起点,不断重复@@6",
    "年复一年@一年又一年,比喻日子久,时间长也形容光阴日日地过去。@",
    "循环往复@指事物周而复始地反复出现或进行可以有变化的发展。@",
    "平庸琐碎@平庸琐碎@",
    "生生不息@指不断地生长、繁殖。@",
    "绵延不断@形指连续不断。@",
    "代代相传@一代一代的传承下来。@",
    
    
    "华而不实@原义是花开得好看,但不结果实；比愉中看不中用：在句子中可充当谓语、定语；含贬义。@@6",
    "夸夸其谈@指浮弯空泛地大发议论或写文章浮夸,不切合实际,@",
    "花拳绣腿@指姿势好看而搏斗时用处不大的拳术。@",
    "朝令夕改@意思是早晨发布的命令,晚上就改了。比喻经常改变主张和办法,一会儿一个样。一般在句中作谓请、定请、补语、分句：用于政策的变更。@",
    "精美绝伦@精致美妙得没有东西可以比得上。@",
    "美轮美奂@用于形容建筑物雄伟壮观,富丽堂皇；也用来形容雕刻或建筑艺术的精美效果。[31在句中一般作谓语、定语。@",
    "表里不一@表面与内在不一样。@",
    
    
    "点石成金@比愉把不好的文字改好。@@6",
    "脱胎换骨@道教徒认为人在苦修得道之后,就能脱下胎,换上骨。现在常用来比痛改前非,重新做人。@",
    "力透纸背@形容书法刚劲有力,笔锋简直要透到纸张背面。也常用来形容诗文等作品运力巧妙,内涵深刻。@",
    "明察秋毫@本义为视力好到能香瓣秋天鸟鲁的细毛；后多形容人精明,目光敏锐,能洞察一切；多含褒义。@",
    "目光如炬@眼光像火炬那样亮,形容见识高明远大。@",
    "扭转乾坤@比喻从根本上改变整个局面。@",
    "画龙点睛@比喻写文章或讲话时,在关键处用几句话点明实质,使内容更加生动有力。该成语在句中一般充当作谓语、定语、状语；含复义。@",
    
    
    "阿谀奉承@指的是曲从拍马,迎合别人,竭力讨好别人,@@6",
    "趋炎附势@比喻奉承依附有权势的人。@",
    "卑躬屈膝@形容没有骨气,谄媚、奉承别人。@",
    "溜须拍马@比喻媚奉承。@",
    "曲意逢迎@意思是违背自己的本心去迎合别人。@",
    "吹牛拍马@指爱说大话,喜欢自我吹嘘和一味逢迎巴结别人的行为@",
    "低眉顺眼@低着眉头,两眼流露出顺从的神情。形容卵良、顺从。@",
    
    
    "如鱼得水@原义是像鱼得到水一样,比愉得到跟自已最相投合的人或最合适的环境；也比愉有所依靠；在句子中可充当作谓语、宾语、补语：含褒义@@6",
    "游刃有余@形容技艺熟练,做事轻松利落。含义：在句中一般作谓语、宾语,@",
    "独当一面@指单独承当一方面的工作或使命；在句子中可充当作谓语、定语、状语；含侵义。@",
    "臻于佳境@指达到最佳境界。形容状态极佳或解决问题非常轻松。@",
    "异军突起@比喻突然兴起的新生力量,一下崛起；在句子中可充当谓语、宾语、补语；含义@",
    "崭露头角@比喻突出地显示出才能和本领@",
    "雨后春笋@春天下雨后竹笋长得又多又快,比喻新生事物大量涌现和蓬勃发展,@",
    
    
    "改弦更张@指换掉旧的琴弦,再安上新的。比喻去旧更新,改变制度或做法等。@@6",
    "洗心革面@比喻彻底悔改。[近】脱胎换骨。@",
    "痛改前非@彻底改正过去所犯的错误。@",
    "改弦易辙@本义是乐器更换弦,车子改变道路(改弦：更换琴弦。易：改变。撤：车轮压过的痕迹,指道路)；比喻改变方向或态度。@",
    "心猿意马@比喻人的心思流荡散乱,如猿马难以控制。@",
    "无所适丛@指不知依从谁才好,也指不知道怎么办才好：在句子中可充当谓语、宾语、定语@",
    "委曲求全@指曲意迁就,以求事成。含复义@",
    
    
    "昭然若揭@形容真相毕露,所有一切都已显现了出来。@@6",
    "举一反三@举一例便能够推知其他的,侧重于理解知识。@",
    "迎刃而解@指竹子劈开口后,下面一段竹子就迎看力刃裂开；比喻处理事情,解决问题非常顺利。含侵义；在句中一般作谓语、定语、宾语。@",
    "拨云见日@比喻冲破黑暗见到光明。也比喻疑团消除,心里顿时明白。@",
    "毋庸赘述@不需要啰唆地陈述。鳌：多余的。@",
    "不言而喻@指不用说就可以明日。形容道理很浅显。@",
    "显而易见@事情或道理很明显,极容易看清。@",
    
    
    "洗心革面@比喻彻底悔改。「近脱胎换骨。@@6",
    "改弦易辙@本义是乐器更换弦,车子改变道路(改弦：更换琴弦。易：改变。辙撤：车轮压过的痕迹,指道路)；比喻改变方向或态度。@",
    "改弦更张@指换掉旧的琴弦,再安上新的。比喻去旧更新,改变制度或做法等。@",
    "痛改前非@彻底改正过去所犯的错误@",
    "见贤思齐@指见到有才德的人就想着与他齐平在句子中可充当谓语、宾语、定语；也作见德思齐。@",
    "兼听则明@听取多方面意见,就能明辨是非,做出正确判断。@",
    "闻过则喜@听到有人批评自己的过错就感到高兴。形容很虚心,对自己要求严格@",
    
    
    "川流不息@指事物像水流一样连续不断,@@6",
    "络绎不绝@形容行人车马来往,接连不断。@",
    "源源不断@形容接连不断、连绵不绝。多用于事物,而少用于人。@",
    "纷至沓来@形容连续不断地到来。@",
    "比肩接踵@比肩继,形容人很多或接连不断。@",
    "亘古不变@从古到今,没有变化@",
    "奔腾不息@意思是奔跑跳跃,不停息,泛指江河。向前跳跃看奔跑永不解意、永不停止。比愉很有气势。@",
    
    
    "爱莫能助@指虽然心中关切同情,却没有力量帮助；在句子中一股作谓语、定语。@@6",
    "望尘莫及@指只望见前面骑马的人走过扬起的尘土而不能赶上。比喻远远落后,常用作谦词,@",
    "鞭长莫及@指虽然鞭子很长,但总不能打到马肚子上,比喻距离太远而无能为力。@",
    "无能为力@意思是用不上力量,帮不上忙,指没有能力或力不能及,@",
    "相形见绌@意为和同类的事物相比较显得不足。@",
    "左支右出@原指弯弓射箭的姿势,左手支持,右手屈曲。指力量不足,应付了这方面,那方面又出了问题。@",
    "捉襟见肘@指整理一下衣襟,就露出了胳膊肘形容衣服破烂,生活窘困；也比顾此失彼,究于应付。@",
    
    
    "风雨同舟@意思是指在狂风暴雨中同乘一条船,一起与风雨搏斗,比喻共同经历患难。@@6",
    "风流云散@像风和云那样流动散开,比喻在一起的人分散到四面八方。@",
    "如影随形@指的是好像影子老是跟着身体。比喻两人事物关系密切或两人人关系密切不能分离。@",
    "通同一气@通同：串通。指互相串通勾结在一起。@",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@",
    "荣辱与共@光荣与耻厚共同分享与承担。@",
    "一脉相连@比喻关系非常密切,不可分离。@",
    
    
    "因小失大@为了小的利益而失去大的利益,@@6",
    "因嘻废食@因为有人吃饭嚏死了,就想让天下人都不吃饭。后比愉要做的事情由于出了点小毛病或怕出问题就索性不去于：含贬义。@",
    "本末倒置@比喻颠倒了事物的轻重主次。@",
    "得不偿失@所得的利益抵偿不了所受的损失@",
    "背道而驰@指向着相反的方向奔驰：形容背离正确目标,朝反方向走,一般形容2个人。@",
    "南辕北辙@该成语比喻行动和目的正好相反。强调方向不对,一般是一个人,含贬义。@",
    "喧宾夺主@指客人的声音压倒了主人的声音。比愉外来的或次要的事物占据了原有的或主要的事物的位置。@",
    
    
    "无可比拟@没有可以相比的。@@6",
    "得天独厚@具有特殊优越的条件。多指人的资质或自然环境而言。@",
    "如痴如醉@形容神态失常,失去自制。@",
    "由外及内@外：表面；内：本质。从表面现象看到本质。@",
    "酣畅淋漓@形容非常畅快、舒适。常指文章绘画,文艺作品感情饱满,笔意流畅,情感得到充分发。@",
    "略逊一筹@指比较起来,稍微差一点。@",
    "无与伦比@意思是指事物非常完美,没有能够与它相比的同类的东西。@",
    
    
    "耳提面命@“耳提”,提着耳朵叮嘱：“面命”当面指教,形容教海殷切。多指(长辈对晚辈、上级对下级)愿切地教导@@6",
    "苦口婆心@善意的耐心地劝导某人。@",
    "朝督暮责@从早到晚不停地督促检查。形容督促检查非常严格。@",
    "循规蹈矩@指拘泥于旧的准则,不敢稍做变通。@",
    "阳奉阴违@指玩弄两面派手法,表面上遵丛,暗地里违背(当众同意背后反对)。@",
    "醍醐灌顶@醍醐由牛乳精制而成,最益人体。醍醐灌顶,即将生奶中精炼出来的乳酪浇到头上。佛家以此比喻灌输智慧,使人得到启发,彻底醒悟,也比喻听了高明的意见使人受到很大启发。也形容清凉舒@",
    "顶礼膜拜@指崇拜之意。@",
    
    
    "天差地别@形容两种或多种事物之间的差距很大,就像天和地之间的距离一样。@@6",
    "大相径庭@强调两个事物相差很远、彼此有矛盾,大不相同,不同之处很多。@",
    "泾渭分明@泾河水清,渭河水浑,泾河的水流入渭河时,清浊不混。比喻界限清楚或是非分明@",
    "迥然不同@意思是形容差别很大,一点儿也不相同。@",
    "背道而驰@指向着相反的方向奔驰：形容背离正确目标,朝反方向走,一般形容2个人。@",
    "相去甚远@互相之间存在很大差异和距离。@",
    "截然不同@指两种事物毫无共同之处。@",
    
    
    "不绝如缕@只有一根细线连系着,似断非断。比事情极其危急,后也比喻技艺等方面继承人稀少。@@6",
    "此起彼伏@意思是这里起来,那里下去；形容接连不断。@",
    "前仆后继@指前面的人倒下了,后面的人继续跟上去。英勇斗争,不怕牺牲。@",
    "如火如荼@比喻军容之盛,现用来形容大规模的行动气势旺盛,气氛热烈。含义@",
    "汗牛充栋@指用牛运书,生要累得出汪：用屋子放书,要放满整个屋子。形容藏书很多。@",
    "层出不穷@比喻事物或言论接连不断地出现,尚未穷尽,数量多。@",
    "无与伦比@意思是指事物非常完美,没有能够与它相比的同类的东西,@",
    
    
    "毋庸讳言@指用不看隐违,可以直说的内容。势庸指不用。@@6",
    "毋庸置疑@事实明显或理由充分,根本就没有怀疑的余地,@",
    "昭然若揭@形容真相毕露,所有一切都已显现了出来。@",
    "不言自明@指不用说话就能明白,形容道理很明显,容易理解。@",
    "难以预测@难以预测@",
    "无懈可击@意思是没有可以被人攻击或挑剔的缝隙,形容非常严密@",
    "无可厚非@意为不可过分指责,表示虽有缺点但是可以理解或原谅。也说未可厚非。@",
    
    
    "实事求是@原指根据实证,求索真知；现多用以按照实际情况办事,不弯大不缩小。含义；在句中一股作定语、宾语,状语。@@6",
    "勇往直前@勇敢地一直向前进。@",
    "另辟蹊径@另外开辟一条路。比喻另创一种风格或方法。@",
    "锐意创新@锐意创新@",
    "兢兢业业@形容做事小心谨慎,认真踏实,一般用在工作上。@",
    "脚踏实地@比喻做事踏实认真,实事求是而不浮夸。@",
    "稳扎稳打@意思是有把握地作战。也比喻有把握、有步骤地工作。@",
    
    
    "荡气回肠@意思是形容文章、乐曲十分婉转动人。@@5",
    "跌宕起伏@形容事物多变,不稳定,也比喻音乐声忽大忽小和故事情节的曲折。@",
    "悲欢离合@泛指人生中各种遭遇和各种心情。也作离合悲欢。@",
    "峰回路转@形容山峰、道路曲折迁回。比喻事情经历挫折、失败后,出现新的转机。也指转折点。形容山水名胜路径曲折复杂。@",
    "宛转悠扬@指委宛曲折,也指声音悠扬动听@",
    "行云流水@形容文章自然不受约束,就像漂浮着的云和流动看的水一样。作宾语、定语；含優义。@",
    
    
    "神秘莫测@不可理解的,形容无法捉摸,高深难测@@6",
    "人迹罕至@意思是人的足迹很少到达；指荒凉偏僻的地方。@",
    "郁郁葱葱@形容草木苍翠茂盛,也形容气势美好逢勃,生机勃勃的样子@",
    "一望无际@一眼望不到边,形容非常辽阔@",
    "水泄不通@像是连水也流不出去,形容拥挤或包围得非常严密。@",
    "广阔无垠@形容森林等任何广阔的地方。@",
    "一无所知@什么也不知道。@",
    
    
    "念念不忘@形容牢记在心,时刻不忘,@@6",
    "孜孜以求@不知疲倦地探求。@",
    "梦寐以求@指做梦的时候都在追求,形容迫切地期望着。@",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    "如数家珍@好像在数自己家里的珍宝一样。通常用来形容某人对所讲的事情十分熟悉。@",
    "了如指掌@指对事物十分了解；强调对情况了解非常清楚。@",
    "津津乐道@意思是很有兴趣地说个不停@",
    
    
    "一叶障目@一片叶子挡在眼前会让人看不到外面的广阔世界比被局部或暂时的现象所迷惑@@6",
    "先入为主@意思是指先听进去的话或先获得的印象往往在头脑中占有主导地位,以后再遇到不同的意见时,就不容易接受。@",
    "以偏概全@用片面的观点看待整体问题；片面地根据局部现象来推论整体,得出错误的结论。@",
    "断章取义@指不顾全篇文章或谈话的内容,只根据需要孤立地取其中一段或一句的意思。@",
    "避重就轻@指回避重的责任,只炼轻的来承担也指回避主要的问题,只谈无关重要的方面。@",
    "违疾忌医@比喻怕人批评而掩饰自已的的缺点和错误；在句子中作主语、宾语、定语@",
    "舍本逐末@放弃根本的而追求枝节的,后用以比愉轻重主次颠倒,强调去掉主要的,抓住次要的,@",
    
    
    "高深莫测@是山小高而且深,无法测量；后引申为人或事深沉不可测,使人难以理解；在句子中可充当作谓语、定语；含贬义。@@6",
    "模棱两可@指对一件事情没有明确的态度或主张(模棱：意见或态度不明确。两可：这样也可以,那样也可以)。该成语在句中可作谓语、状语、定语、补语；多含贬义@",
    "变幻无常@变化多端,令人难以预料。@",
    "捉摸不定@意思是估量不透。@",
    "光明正大@指人的行为正当、正派@",
    "光明磊落@偏重指人的精神品质,指胸襟坦荡。@",
    "胸无城府@形容待人接物坦率真诚,心口如一。@",
    
    
    "移花接木@指把一种花木的枝条或嫩芽嫁接在另一种花木上比喻暗中用手段更换人或事物来欺骗别人。@@6",
    "偷梁换柱@比喻暗中玩弄手法,以假代真,以势代优。@",
    "削足适履@指把脚削去一块来凑合鞋的大小；比不合理地迁就合或不顾具体条件,生搬硬套。含贬义：@",
    "生搬硬套@指不顾实际情况,机械地运用别人的经验,照抄别人的办法。@",
    "舍近求远@舍去近处的,追求远处的,形容做事走弯路。联合式；在句中作谓语、宾语；含贬义。@",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "取长补短@指在同类事物中吸取这个的长处来弥补那个的短处。含义。@",
    
    
    "故步自封@指把自己限制在原来的地方：比喻因循守旧,安于现状,不求创新进取。含贬义；在句中一般作谓语、定语。@@6",
    "抱残守缺@指抱着残缺破旧的东西不放；形容思想守旧,不肯接受新事物,含贬义；@",
    "曲高和寡@比喻言论或作品不通俗,能了解的人很少,用于消极语气。@",
    "特立独行@形容人的志行高洁,不同流俗@",
    "一成不变@一经形成,不再改变,常用在否定句中。@",
    "失之交臂@形容当面错过。@",
    "错失良机@错过或失去了良好的机会。错失：错过、失去。@",
    
    
    "剑走偏锋@指不走常规,我一些新的、不同以往的办法来解决问题,以求出奇制胜；二指剑法评述语。@@6",
    "泥古不化@泥：拘泥,固执。拘泥于古代的成规或古人的说法,而不知灵活运用。@",
    "刚愎自用@指强固执,自以为是；形容十分固执已见,不考虑别人意见。含贬义；在句中一般作谓语、定语。@",
    "特才放旷@倚仗着自己的才能而对自己的行为不加以约束。@",
    "走火入魔@走火：过头。意思是对某种事物迷恋到失去理智的地步。@",
    "鬼迷心窍@鬼怪迷感住心窝。指对问题认识不清。@",
    "趋之若鹜@像鸭子一样成群跑过去,比喻许多人争着去追逐。@",
    
    
    "沾沾自喜@目自己觉得美好而得意：多用于形容对自己的成绩感到满足得意,表现出一种轻浮的样子。含贬义；在句中一般作谓语、定语、状语。@@4",
    "固步自封@比喻守着老一套,不求进步。@",
    "一劳永逸@辛苦一次,把事情办好,以后就可以不再费力了。@",
    "高枕无忧@垫高枕头,无忧无虑地睡觉：比喻身心安逸,无所忧虑；也用来形容思想麻痹,放松警惕；在句中一般作谓语、状语。@",
    "洋洋得意@形容得意时神气十足的姿态。@",
    
    
    "无出其右@意思是古代以右为尊。没有能超过他的。形容在某方面居领先地位,没有能比得上的。@@6",
    "叹为观止@用来赞叹所见的事物尽善尽美,好到了极点。@",
    "登峰造极@登上顶峰,指到达最高点：比喻学问、技艺等已达到最高的境界,@",
    "无与伦比@意思是指事物非常完美,没有能够与它相比的同类的东西@",
    "不同寻常@不同于平常的事物。@",
    "不同凡响@比喻事物(多指文艺作品)不平凡。@",
    "无以伦比@指事物非常完美,没有能够与它相比的同类的东西。@",
    
    
    "顺势而为@做事要顺应潮流,不要逆势而行@@6",
    "因势利导@因势利导指顺着事情发展的趋势向有利的方向引导,与顺水推舟相近。含复义@",
    "因地制宜@根据不同环境的实际情况制定相应的妥善办法。@",
    "有的放矢@放箭要对准靶子。比喻说话做事有针对性。@",
    "对症开方@对症开方@",
    "随机应变@随着情况的变化灵活机动地应付,形容临事能妥善变通处置。含复义。@",
    "心甘情愿@心里完全愿意,没有勉强。多指自愿做出某种牺性。@",
    
    
    "浑然一体@融合成一个整体,不可分割。也形容文章绘画,布置勾整,结构谨产。@@6",
    "相辅相成@指两种事物互相辅助,互相促成,缺一不可,没有1+1>2效果。@",
    "水乳交融@是像水和乳汁那样融合在一起,比喻关系非常融洽或结合得很紧密@",
    "交相辉映@意指各种光亮、色彩等互相映照。多用于形容美好的景象,@",
    "合而为一@指两个或更多的事物合成一个。@",
    "天衣无缝@喻事物没有一点儿破绽。【反]】破绽百出。@",
    "错落有致@形容事物的布局虽然参差不齐,但却极有情趣,使人看了有好感@",
    
    
    "奋发图强@意思是振作精神,以求强盛,@@6",
    "奋发有为@振作精神,有所作为。@",
    "攻坚克难@常常用来形容或鼓励人们克服各种艰难险阻,圆满的完成任务。@",
    "自强不息@指自己努力上进,永不解急；形容一种积极的人生态度。含义；在句中一般作谓语、宾语、状语。@",
    "百折不挠@指虽然受到很多挫折,但仍不动摇退缩或屈服。形容意志坚强。含蔓义；作谓语、定语、状语。@",
    "坚韧不拔@形容信念坚定,意志顽强,不可动摇。@",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    
    
    "一步到位@形容办事情讲究干净利落,不拖泥带水,一下子就做到事情所要求的结果,达到极高的境界和某种程度@@6",
    "一蹴而就@踏一步就成功。形容事情轻而易举一下子就能完成,侧重强调时间短且十分容易@",
    "一本万利@意思是指本钱小,利润大。@",
    "一劳永逸@辛苦一次,把事情办好,以后就可以不再费力了。@",
    "一鸣惊人@一叫就使人震惊。比喻平时不被人注意的人,突然做出惊人的成绩。@",
    "一鼓作气@指作战开始时鼓足勇气。现在比劲头大时,一口气完成@",
    "一气呵成@①形容文章的气势首尾贯通。②形容完成整个工作的过程中不间断,不松解@",
    
    
    "群策群力@大家共同想办法,一起出力。形容遇到问题时大家团结一致,共同出力想办法。@@6",
    "集思广益@集中群众的智慧,广泛吸收有益的意见。该成语构词方式是联合式；在句中作谓语、定语、状语。@",
    "取长补短@指在同类事物中吸取这个的长处来弥补那个的短处。含义。@",
    "传承文明@传承文明@",
    "精雕细琢@精雕细刻,比喻做事情精益求精。@",
    "洋为中用@指批判地吸收外国文化中一切有益的东西,为我所用,@",
    "因地制宜@根据不同环境的实际情况制定相应的妥善办法。@",
    
    
    "一举两得@指做一件事,同时收获两方面的好处。含褒义；在句中一般作谓语、定语。@@6",
    "相得益彰@指两个人或两件事物互相配合,双方的能力和作用更能显示出来,侧重强调配合,有1+1>2效果。@",
    "推陈出新@去掉旧事物的糟,取其精华,并使它向新的方向发展,侧重强调文化的去粘取精,@",
    "另辟蹊径@另外开辟一条路。比喻另创一种风格或方法。@",
    "扬长避短@发挥或发扬优点或有利条件,克服或回避缺点或不利条件。@",
    "事半功倍@意思是只用一半的力气,而收到加倍的功效。形容用力小而收效大。@",
    "十拿九稳@形容做事很有把握。也作十拿九准。@",
    
    
    "蛛丝马迹@从挂下来的蜘蛛丝可以找到蜘蛛的所在,从灶马爬过留下的痕迹可以查出灶马的去向。比愉事情所留下的隐约可寻的痕迹和线索。@@6",
    "一鳞半爪@原指龙在云中,东露一鳞,西露半小爪,看不到它的全貌。比喻零星片段的事物,@",
    "细枝末节@比喻事情或问题的细小而无关紧要的部分。@",
    "真凭实据@真实可靠的凭据。@",
    "精益求精@形容追求好上加好,永无止境@",
    "细致入微@比喻看问题非常全面。对人体贴关心无微不至。@",
    "千头万绪@比喻事情的开端,头绪非常多。也形容事情复杂纷乱。@",
    
    
    "混为一谈@把本质不同的事物混在一起,当作同样的事物谈论。@@6",
    "等量齐观@指对有差别的事物同等看待。@",
    "相提并论@把不同的人或不同的事物混在一起谈论或看待,侧重强调共同谈论的事物差别大或不同。@",
    "同日而语@放在同一时间谈论,指相提并论。@",
    "一概而论@指处理事情或问题不分性质,不加区别,用同一标准来对待或处理@",
    "一视同仁@表示对人同等看待,不分厚薄。@",
    "一言蔽之@指用一句话来概括。@",
    
    
    "乐不思蜀@指快乐得不再思念蜀国：比愉乐而忘返或乐而忘本留恋他乡。含贬义；在句中一般股作谓语、定语,(感情色彩)贬义@@6",
    "流连忘返@常形容对美好景致或事物的留恋。@",
    "物我两忘@指创作时艺术家的主体与创作对象的客体浑然为一而兼忘的境界@",
    "感概万千@指变化很大而引起许多感想、感触。@",
    "别有天地@天地：境界。另有一种境界。形容风景或艺术创作等引人入胜。@",
    "逐宕失返@随波流荡而忘却归来。谓随逐时俗而不知返归根本。@",
    "情有独钟@指对某人或某件事特别有感情,把自己的心思和感情都集中到他(她/它)上面。作谓语、定语：指专爱@",
    
    
    "交口称赞@意为异口同声地称赞。@@6",
    "喜闻乐见@意思是喜欢听,乐意看。形容很受欢迎。@",
    "风靡一时@形容一个事物在一个时期非常盛行,像风吹倒草木一样。@",
    "绘炙人口@美味人人爱吃,比喻好的诗文受到人们的称赞和传颂,描述对象通常是诗文。在句中可充当谓语、定语；含侵义。@",
    "举足轻重@一拾起脚就可以改变两边的重量,使之失去平衡与均势(举足：抬脚)。形容身份或地位特殊,一举一动足以影响全局。@",
    "必不可少@是绝对需要的或者不达到某种目的就不能做成某种事情的意思。近义词为不可或缺和至关重要。@",
    "崭露头角@比喻突出地显示出才能和本领。@",
    
    
    "心猿意马@上比愉人的心思流荡散乱,如猿马难以控制@@6",
    "心不在焉@思想、精神不集中。@",
    "改弦更张@指换掉旧的琴弦,再安上新的。比喻去旧更新,改变制度或做法等。@",
    "无所适丛@指不知依从谁才好,也指不知道怎么办才好；在句子中可充当谓语、宾语、定语,@",
    "委曲求全@指曲意迁就,以求事成。含复义@",
    "心神不定@指心里烦躁,精神不安。@",
    "心驰神往@形容思想集中在追求和向往的事情或地方上,一心向往。@",
    
    
    "拨云见日@比愉冲破黑暗见到光明。也比愉疑团消除,心里顿时明白。@@6",
    "举一反三@举一例便能够推知其他的,侧重于理解知识。@",
    "迎刃而解@指竹子劈开口后,下面一段竹子就迎着刀刃裂开；比喻处理事情,解决问题非常顺利。含义；在句中一般作谓语、定语、宾语@",
    "昭然若揭@形容真相毕露,所有一切都已显现了出来。@",
    "尘埃落定@比喻事情经过许多变化,终于有了结果。@",
    "众口一词@所有的人都说同样的话。@",
    "异口同声@不同的嘴说同样的话。形容大家说的完全一致。@",
    
    
    "裹足不前@停步不前,好像脚被缠住了一样,比有所顾忌不愿去做；在句子中可充当谓语、定语、状语。@@6",
    "望而却步@指看到了危险或力不能及的事而往后退缩。@",
    "高歌猛进@高声歌唱,勇猛前进：形容在前进的道路上,充满乐观精神。@",
    "如履薄冰@好像走在薄冰上,比喻随时都会发生危险,做事极为小心谨慎,侧重在主观心态上。@",
    "故步自封@指把自己限制在原来的地方：比喻因循守日,安于现状,不求创新进取。含贬义；在右中一般作谓语、定语。@",
    "无可奈何@指事已如此,想挽回已无能为力。该成语在句中常作定语、谓语、状语,也作宾语。@",
    "束手无策@手被绑住,无法解脱。形容遇到问题毫无解决的办法。@",
    
    
    "优胜劣汰@意思是优胜劣败。指生物在生存竞争中适应力强的保存下来,适应力差的被淘汰。@@6",
    "弱肉强食@原指动物中弱者被强者吞食,比喻弱的被强的吞并。@",
    "此消彼长@不要太过于在乎此时的失去,别的方面会有长进。任么事情都有两面或者多面性。@",
    "硝烟四起@硝烟：战火。战火四起战争爆发或者爆发之前的那种紧张气氛。@",
    "品质为王@品质为王@",
    "不进则退@不前进就会后退。常用于鼓励人奋发上进。常和逆水行舟连用。@",
    "与时俱进@行动和时代一起进步。@",
    
    
    "耳目一新@听到的、看到的跟以前完全不同,令人感觉到很新鲜。形容事物的面貌有了显著的变化。@@6",
    "戛然而止@形容声音因为被打断而突然终止@",
    "百读不厌@形容诗文或书籍写得非常好,不论读多少遍也不感到厌倦。@",
    "意犹未尽@形容一些小型活动的感想,比如旅行、读书、吃饭等,形容该活动给人的感觉很好,结束之后还没有尽兴。@",
    "心驰神往@形容思想集中在追求和向往的事情或地方上,一心向往。@",
    "目不转睛@看东西时眼珠一点都不转动。形容注意力很集中,看得出神。@",
    "流连忘返@常形容对美好景致或事物的留恋。@",
    
    
    "娓娓道来@连续不断地说、生动地谈论。形容谈论不倦或说话动听。@@6",
    "侃侃而谈@指理直气壮、从容不迫地说话；在句子中可充当作谓语、定语；含蔓义。@",
    "滔滔不绝@像流水那样毫不间断。形容说话很多,连续不断。也指连续不断的事物。@",
    "促膝长谈@比喻双方关系亲密。也指双方亲密的谈话而且投机。@",
    "娓娓而谈@娓娓：说话连续不断而又不知疲倦的样子。形容连续不断地讲话。@",
    "不赞一词@指文章写得很好,别人不能再添一话。也指一言不发。@",
    "拍案叫绝@是拍桌子叫好。形容非常赞赏。作语、宾语、补语；含义。@",
    
    
    "全心全意@投入全部精力,毫无保留。@@6",
    "不遗余力@不遗余力指把所有的力量都使出来,一点也不保留。@",
    "坚定不移@意思是稳定坚强,毫不动摇：不放弃,不改变自己的想法,@",
    "矢志不渝@立志不会改变,表示永远不变心,重点强调志向、心意不会改变,程度更重。@",
    "聚精会神@形容专心致志,注意力高度集中的样子。@",
    "倾巢而出@比喻敌人出动全部兵力侵扰@",
    "精雕细刻@意思是精心细致地雕刻：形容创作艺术品时的苦心刻画；也比喻认真细致地加工@",
    
    
    "首屈一指@屈指计数总是先屈大拇指,因以“首屈一指“表示位居第一。@@6",
    "屈指可数@形容数目很少。【反]不计其数。@",
    "独树一帜@比喻与众不同,自成一家,多含复义,除用于艺术创作外,还可用于政治、经济等创业道路。@",
    "独领风骚@形容表现特出,超越群伦。@",
    "一枝独秀@其他花都没有开放,只有这一枝在开看。比喻技高一筹,优势明显。@",
    "不可取代@指某人或某物是不能够用他人或他物来进行代替的。@",
    "交口称赞@意为异口同声地称赞。@",
]